[{"Num":1,"Title":"Barrel - Part 1","Transcript":"[[A boy sits in a barrel which is floating in an ocean.]]\nBoy: I wonder where I'll float next?\n[[The barrel drifts into the distance. Nothing else can be seen.]]\n{{Alt: Don't we all.}}"},{"Num":2,"Title":"Petit Trees (sketch)","Transcript":"[[Two trees are growing on opposite sides of a sphere.]]\n{{Alt-title: 'Petit' being a reference to Le Petit Prince, which I only thought about halfway through the sketch}}"},{"Num":3,"Title":"Island (sketch)","Transcript":"[[A sketch of an Island]]\n{{Alt:Hello, island}}"},{"Num":4,"Title":"Landscape (sketch)","Transcript":"[[A sketch of a landscape with sun on the horizon]]\n{{Alt: There's a river flowing through the ocean}}"},{"Num":5,"Title":"Blown apart","Transcript":"[[A black number 70 sees a red package.]]\n70: hey, a package!\n[[The package explodes with a \u003c\u003cBOOM\u003e\u003e and a red cloud of smoke.]]\n[[There are a red 7, a green 5 and a blue 2 lying near a scorched mark on the floor.]]\n{{alt text: Blown into prime factors}}"},{"Num":6,"Title":"Irony","Transcript":"Narrator: When self-reference, irony, and meta-humor go too far\nNarrator: A CAUTIONARY TALE\nMan 1: This statement wouldn't be funny if not for irony!\nMan 1: ha ha\nMan 2: ha ha, I guess.\nNarrator: 20,000 years later...\n[[desolate badlands landscape with an imposing sun in the sky]]\n{{It's commonly known that too much perspective can be a downer.}}"},{"Num":7,"Title":"Girl sleeping (Sketch -- 11th grade Spanish class)","Transcript":"[[Girl sleeping on her side, facing away from view]]"},{"Num":8,"Title":"Red spiders","Transcript":"[[Many red spiders standing on and hanging from cuboids. The cuboids hang in the air with no visible means of support.]]\n{{They are six-legged spiders}}"},{"Num":9,"Title":"Serenity is coming out tomorrow","Transcript":"[[Several stick figures stand side by side in a lineup. A forlorn male in a coat, a male with combed hair, a male with spiky hair and arms outstretched enthusiastically, a female with long hair and cornrows, a shorter female with stringy hair falling over her face, an enthusiastic female with arms raised in celebration with shorter hair, a male with short hair and a goatee, a female with curly hair wearing a dress, and a stern-looking man with flyaway hair. There is no dialogue.]] \n{{Alt: Mal, Simon, Wash, Zoe, River, Kaylee, Jayne, Inara, Book.}}"},{"Num":10,"Title":"Pi Equals","Transcript":"Pi = 3.141592653589793helpimtrappedinauniversefactory7108914..."},{"Num":11,"Title":"Barrel - Part 2","Transcript":"[[A boy sits in a barrel which is floating in an ocean.]]\nBoy: None of the places i floated had mommies.\n{{Alt: Awww.}}"},{"Num":12,"Title":"Poisson","Transcript":"[[A stick figure says to another black-hat-wearing figure.]]\nMan: I'm a poisson distribution!\nMan: Still a poisson distribution.\nHat Guy: What the hell, man.  Why do you keep saying that?\nMan: Because I'm totally a poisson distribution.\nHat Guy: I'm less than zero.\n[[Man is gone; Hat Guy is whistling.]]\n{{alt text: Poisson distributions have no value over negative numbers}}"},{"Num":13,"Title":"Canyon","Transcript":"[[Two men are standing at some kind of cliff edge]]\nMan 1: What time is it?\nMan 2: Now.\n[[Full scene is revealed: the men are standing at the edge of a huge canyon in a rocky, barren landscape. A pock-marked moon and a ringed planet are visible in the burgundy-coloured sky]]\nMan 1: That's a pretty boring answer.\nMan 2: Is not.\nMan 2: It's the least boring answer imaginable.\n{{Alt text: They're standing at the lip of the canyon, which isn't clear at all.}}"},{"Num":14,"Title":"Copyright","Transcript":"[[Colored drawing of a hilly grassy landscape, stick figure leaning against a tree.]]\nMan: Sometimes I just can't get outraged over copyright law\n{{Alt: After reading Slashdot and BoingBoing, sometimes I have to go outside.}}"},{"Num":15,"Title":"Just Alerting You","Transcript":"[[There is a man standing on top of a dinosaur (Brontosaurus?) and holding reins to the dinosaurs head.]]\nMan: Before you talk to me, I should warn you: I am kind of strange\n{{title text: Just thought you should know}}"},{"Num":16,"Title":"Monty Python -- Enough","Transcript":"Character #1 [[Raising his hands]]: We are the knights who say... Ni!!\nTwo guys and a girl: hahaha\n[[written]] Does anyone else find it funny that decades later, people are still groting --word-for-word-- a group loved for its mastery of shock, the unexpected and defiance of cocnvention?\n[[Two guys looking at a third]]\nThird guy: We are the knights who... Oh, God, I'm so sorry\n[[Close up to Third guy's face]]\nThird guy: So sorry the car just came too fast and\n[[Words crumpled inside the panel, there's barely enough space for the third guy]]\nThird guy: She was right there and I sasw her and then it was a blur and so much I ran to help didn't know she wasn't moving I'm so sorry ... so sorry\n[[Same two guys looking again at the third guy]]\nThird guy: Anyway, yeah, knights who say \"Ni\".\n[[Written centered, in markee format]]\n\u003cu\u003eHonor \u003c\nu\u003e\nMonty Python:\nPromote surreal humor.\n{{Tag: I went to a dinner where there was a full 10 minutes of Holy Grail quotes exchanged w...}}"},{"Num":17,"Title":"What If","Transcript":"[[A large black circle with white bubbles inside it, filled with hearts, question marks, and stick figure couples]]\nWhat if this isn't everything it should be?\nI'm not even sure how I feel\nWhat if I'm making a mistake?\n{{Title text: I once made an anniversary card for my then-girlfriend with this layout.}}"},{"Num":18,"Title":"Snapple","Transcript":"{{Author's Comment: This one is entirely James' fault.}}\n[[Two guys are standing and talking.]]\nRight Guy: Here, take a bite of this Snapple.\nLeft Guy: food!\n[[Guy on the right takes a bite]]\nRight Guy: Ow! What is this? \n\u003c\u003cCLINK\u003e\u003e\nLeft Guy: It's an apple infused with tin.\n[[The two guys continue to stand as if frozen]]\n \n{{Author's Comment: Those of you who know your periodic table should be laughing right about now.}} \n{{Title Text: Sn= tin}}"},{"Num":19,"Title":"George Clinton","Transcript":"Narrator: I once tried to start the urban legend that George Clinton has a B.A. in mathematics\n[[George Clinton indicates equations on a blackboard]]\nNarrator: ...but I wanted it to be true so badly that I started believing it myself.\n{{Title text: I still wish it were true.}}"},{"Num":20,"Title":"Ferret","Transcript":"[[A ferret with airplane wings on it]]\nFriend: Why on earth did you make those wings? You don't seriously think they could let your ferret fly, right?\nGuy: I... of course not.\nGuy: That would be pretty dumb. It's just, uh... ...a Halloween costume.\nFriend: oh, okay.\nFriend: Besides, who would want a pet to fly anyway?\nGuy: Yeah. Pretty lame, huh?\nFriend: Anyway, let's go play video games.\n[[Friend leaves]]\n[[Friend is gone, and Guy is looking at ferret]]\n[[Guy imagines ferret flying over the ocean near the beach using his makeshift wings]]\n{{title text: My brother had a ferret he loved which died since I drew this strip. RIP.}}"},{"Num":21,"Title":"Kepler","Transcript":"[[ Two people stand in an aisle in a store ]]\nPerson 1: Nice store. How do you keep the floors so clean?\nPerson 2: Oh, we hired this dude named Kepler, he's really good hard worker.  Doesn't mind the monotony. Sweeps out the same area every night.\n{{ alt: Science joke. You should probably just move along. }}"},{"Num":22,"Title":"Barrel - Part 3","Transcript":"[[Large vortex, spinning water covers the whole panel. A boy in a floating barrel is near the edge, apparently about to be sucked in.]]\nBoy: Wow!\n{{alt text: A whirlpool!}}"},{"Num":23,"Title":"T-shirts","Transcript":"[[A collection of phrases on T-shirts]]\nI see dumb people\nAs a matter of fact the world DOES revolve around me\nI can only please one person per day today is not your day.\nYou know what your problem is? You're stupid.\nGet a clue\nDo I look like a people person?\nYour village called they want their idiot back\nGo away\nI hate you all\nDIE.\nHelp.\nMaybe if this T-shirt is witty enough, someone will finally love me.\nOh God I'm so alone\n{{Alt: It's depressing how many of these are real shirts}}"},{"Num":24,"Title":"Godel, Escher, Kurt Halsey","Transcript":"Drawn during an unending NASA lecture.\n\n[[Two people are talking, one in a hat.]]\nHatless: it's just so hard to compare kids now with kids in the past. you can't help but to belong to one group or the other.\n\nHatless: and of course every generation seems awful to the one before it. look at quotes from throughout history.\n\nHatted: yeah, and it sure would be nice to have some perspective on some of this stuff. I just don't know what to make of it.\n[[Circles are appearing--maybe snow?]]\n\nHatless: i guess you do what you can to help the people around you and hope it turns out okay.\n\nHatless: in the end, what else can you do?\n\nHatted: lead a crusade?\n\n[[We can no longer see the people, just the circles.]]\nit's presentism, man. the idea that historical context is irrelevant, that we understand it all\n\nthat we need take no warnings from the follies of the past. that we're facing something new.\n\nsocrates couldn't imagine the internet. but people don't change.\n[[We can start to see the corner of a darker circle in the lower right.]]\n\n((The borders between the three panels on this line are cracking.))\n\nhave you seen those collections of historical pornography? talk about historical context.\n\ndid you know the first porn photo was bestial in [[inside a circle:]] nature?\n\nat least that stuff was out of the mainstream [[each word in one circle:]] no just in history\n\n((the three panels have merged into one on each row.))\n\ni don't know about you, but [[circled]] I [[uncircled]] never\neven once seen\n[[The circles are highly variable in size now, and pressed up against a larger one on the right side.]]\n\n[[There is mass of circles of different sizes, with some dark fissures in between, against the side of a large circle which we can see part of in the right half of the panel. They look like cells. There's a tiny square in the center of the giant cell.]]\n\n[[We see only the tiny square, centered. It has a few marks inside it.]]\n\n[[Closer, the square is divided into rectangles of different sizes, each of which has text in it.]]\n\n[[Much closer, we can see fragments of the text. Some are sideways, some are cut off, some are too small to read.]]\nmachine language translated by principles of isomorphism it is a consequence of the Church-Turing thesis that ...\nbut how do you select the channel you wish to se-\nthou ... shou ... palin ... stri ... it is a ... crab ...\n\n[[Closer still, we can just see a huge sideways s and h.]]\n\n[[Those letters are faded and mixed with a faded version of the next panel.]]\n\ngirls take boys away ...\nnever be further than a phone call and a goosebumped shiver away ...\ndrove all night listening to mix tapes ...\nthe past is just practice\n[[There is a heart at the bottom and, in the lower left, the name Kurt.]]\n\n[[The same as the previous panel, but with the words blurred out to scribbles.]]\n\n[[Jagged, shaded shapes and strands start to fall. Faint panel borders appear again. There is a person on the far right.]]\n\n((Back to three panels per row.))\n\n[[A man and woman are standing amid the fragments.]]\n\nMan: There's too much. And so little feels important.\n\n[[The jagged edge of the shaded area is encroaching on the sides of the panel.]]\n\nWhat do you do?\n\n[[We see them from farther away through a rough hole in the shaded area. Bits continue to fall around them.]]\n\n[[She takes his hand.]]\n\n{{Title text: I love the idea here, though of course it's not a great-quality drawing or scan.}}"},{"Num":25,"Title":"Barrel - Part 4","Transcript":"[[The barrel is shown, floating sideways in a choppy sea. The boy can not be seen]]\n{{title text: :( }}"},{"Num":26,"Title":"Fourier","Transcript":"[[ Person talks on phone.  Cat with many sharp points looks on. ]]\nPerson on phone: Hi, Dr. Elizabeth?  Yeah, uh ... I accidentally took the Fourier transform of my cat ...\nCat: Meow!\n{{alt-text: That cat has some serious periodic components}}"},{"Num":27,"Title":"Meat Cereals","Transcript":"[[A collection of fictional meat based cereals]]\nPork Loops\nMice Krispies\nHammios\nFrosted Bacon Flakes\nScrapple Jacks\nHoney Bunches of Goats\n{{Alt: Disgusting}"},{"Num":28,"Title":"Elefino","Transcript":"Q: What do you get when you cross an Elephant with a Rhino?\n[[Picture of elephant, mathematical addition symbol, picture of rhino, equals sign, large question mark]]\nA: I haven't a goddamn clue.\n[[The correct answer to the joke is given in the title text]]\n{{title text: Hell if I know}}"},{"Num":29,"Title":"Hitler","Transcript":"Learning about the Holocaust has really shaken my belief in God.\nYou know, as a young man, Hitler was rejected from art school.\nYeah... shame he didn't get in\nWell, have you seen any of his paintings? They're awful. Defy all rules of composition.\nWhat are you suggesting?\nMaybe there is a god, but he's a real art lover.\nThis is why I don't go out in public with you.\n{{Alt text: So he's saying that God thought Hitler's art was so bad that the Holocaust was an acceptable alternative.  It's no secret that the hat guy is closely based on Aram, from Men in Hats.}}"},{"Num":30,"Title":"Donner","Transcript":"[[Three people stand in the foyer of a restaurant. A sign above the entryway reads \"JOE'S\" and there is a menu next to it. In front of the entryway, there's a host behind a podium. A sign on the podium reads \"EAT IN\".]]\nHost: Donner, party of four?\nMan: Actually, never mind.\nWoman: We're full.\n{{title text: Some people haven't heard of the Donner Party.  They were pioneers who got stranded and likely resorted to cannibalism.}}"},{"Num":31,"Title":"Barrel - Part 5","Transcript":"[[Boy floating on barrel in ocean]]\n[[Zoomed out view of boy floating on barrel in ocean]]\n[[Ferret with airplane wings and tail above the ocean]]\n[[The empty ocean]]\n[[Flying ferret carrying the boy to safety]]\n[[Ocean with ferret carrying boy in distance, sun on the horizon]]\n{{title text: Too good not to happen.}}"},{"Num":32,"Title":"Pillar","Transcript":"This one is mostly by my little brother, Doug.\n[[Person on a tall pillar is talking to person on the group]]\nPerson on pillar: The sky is so blue, and all the leaves are green.\nPerson on ground: Haven' t you ever wondered if we really see the same colors as everyone else? It's all perception.\nPerson on pillar: Well, you might as well call into question all of human experience. Who really knows what world someone else sees?\nPerson on ground: Yeah, I guess.\nPerson on pillar: Anyway, can you help me down from this pole?\nPerson on ground: What pole?\n{{Title Text: A comic by my brother Doug, redrawn and rewritten by me}}"},{"Num":33,"Title":"Self-reference","Transcript":"[[Guy standing alone]] Guy: I promise never to never again squeeze humor out of self-reference.\n[[Guy standing alone]]\n[[Guy standing alone]] Guy: God dammit.\n{{title text: I think about self-reference a lot.  Example: this comment.}}"},{"Num":34,"Title":"Flowers","Transcript":"[[A sketch of flowers, drawn in red and green]]"},{"Num":35,"Title":"Sheep","Transcript":"Heading: Another from my high-school notebooks.\n[[A sheep and a potted saguaro cactus linked by an arcing yellow electricity bolt, drawn on graph paper]]\n{{title text: I think it's the sheep zapping the cactus and not vice-versa}}"},{"Num":36,"Title":"Scientists","Transcript":"In what scientists are calling \"pretty gay,\" I can't find my shoes.\n{{ alt: A leading expert characterized the situation as 'retarded' }}"},{"Num":37,"Title":"Hyphen","Transcript":"{{Headline: My hobby: whenever calls something an [adjective]-ass [noun], I mentally move the hyphen one word to the right.}}\n[[One man is talking to another about a car that resembles a Volkswagen Beetle]]\nMan: Man, that's a sweet ass-car.\n{{Title text: I do this constantly}}"},{"Num":38,"Title":"Apple Jacks","Transcript":"[[Father is standing holding a bowl of Scrapple Jacks in his hand. Son is sitting on the floor playing video games.]]\nFather: Hey, these don't taste like apples!\nSon: Fuck off, dad.\n{{alt text: There used to be these ads, see . . .}}"},{"Num":39,"Title":"Bowl","Transcript":"[[A boy is glaring at a model sailing ship floating in a bowl of water.]]\nBoy: Sooner or later, my friend, one of us will run out of time.\n{{Alt: For the moment it's a standoff}}"},{"Num":40,"Title":"Light","Transcript":"[[A crowd of figures stand around in the dark. One figure is illuminated by a beam of light.]]\nIn a dark and confusing world, you burn brightly. I never feel lost.\n{{Alt-text: Like a beacon.}}"},{"Num":41,"Title":"Old Drawing","Transcript":"[[A tree holding a chainsaw over a recently cut-down tree.]]\nI found this in one of my high-school notebooks. I think I drew it just to take revenge on people snooping through my stuff.\nCut-down tree: WELL, YOU STUMPED ME...\n{{I don't want to talk about it}}"},{"Num":42,"Title":"Geico","Transcript":"I just saved a bunch of money on my car insurance by threatening my agent with a golf club.\n{{title text: David did this}}"},{"Num":43,"Title":"Red Spiders 2","Transcript":"[[Red spiders, with round appendages at the end of each of their six legs, are seen navigating an environment of blocks and other geometric constructions]]\n{{title text: This was actually drawn years before Red Spiders}}"},{"Num":44,"Title":"Love","Transcript":"[[A man and a woman stand facing one another]]\nMan: I love you!\nWoman: I love you!\nMan: I love you more!\nWoman: Yeah.\n[[A man and a woman stand facing one another - saying nothing.]]\n{{Alt-text: This one makes me wince every time I think about it}}"},{"Num":45,"Title":"Schrodinger","Transcript":"[[Label: Schrödinger's Comic]]\n[[Two figures standing, one with a black hat]]\nThe last panel of this comic is both funny and not funny at the same time.\nUntil you read it, there's no way to tell which it will end up being.\nShit.\n{{alt: There was no alt-text until you moused over}}"},{"Num":46,"Title":"Secrets","Transcript":"I just want you to share in my secrets\n[[lonely looking girl staring down]]\nand not run away\n{{alt: I'm a big fan of Kurt Halsey}}"},{"Num":47,"Title":"Counter-Red Spiders","Transcript":"[[A stack of stick figures, standing on each others shoulders extends from the bottom of the frame to the top.  Cuboids hang in the air]]\nThe counter-red-spider offensive begins ...\n{{title text: I hope we can stop them}}"},{"Num":48,"Title":"Found","Transcript":"[[A male and female stick figure are standing on a white hill (presumably snow) with a grey sky covered with thick streaks of white, and small pink dots]]\nwe are just two people \nwho found each other\n{{No more, no less}}"},{"Num":49,"Title":"Want","Transcript":"I want to be brave enough to tell you how I feel.\nI want to say \"I love you\" _before_ I hang up the phone for once.\nI want to drive all night with you, listening to mix tapes, not caring where we end up.\nOh, and I also really want to get with your sister.\nI mean, DAMN.\n{{title text: Well, she's pretty hot.}}"},{"Num":50,"Title":"Penny Arcade","Transcript":"Tycho: You know what? If you've never played the 1995 SNES RPG 'Seiken Densetsu' don't even _bother_ reading today's strip. We don't _need_ your kind here.\n{{title text: Of course, Penny Arcade has already mocked themselves for this. They don't care.}}"},{"Num":51,"Title":"Malaria","Transcript":"[[People wearing party hat, a discarded balloon to the side]]\nWe had a malaria party, but it turned out not to be very much fun.\n{{title text: The malaria party was David's idea.}}"},{"Num":52,"Title":"Secret Worlds","Transcript":"[[Pieces of a quote in circles with lines drawn in between them]]\n[[Some of the circles are small and colored]]\n\"Everybody has a secret world inside of them.\nAll of the people in the whole world\nI mean everybody\nNo matter how dull and boring they are on the outside\nInside they've all got unimaginable\nmagnificent, wonderful, stupid, amazing, worlds\nNot just one world. Hundreds of them. Thousands, maybe.\"\n--Neil Gaiman\nSandman"},{"Num":53,"Title":"Hobby","Transcript":"{{My hobby:}}\nWhen the police bust drug hideouts, I sneak in and hide. Then I jump out and startle them into shooting me so they lose points.\n[[A dead body on the ground in a pool of blood, with \"-100\" over it]]\n{{Alt: The only one of these games I really played was Area 51)}}"},{"Num":54,"Title":"Science","Transcript":"[[Graph of cosmic microwave background radiation: Y axis is energy density, X axis is frequency in GHz. Energy density peaks at 160.4GHz]]\nI(f) = ((2hf^3)\n(c^2))(1\n(((hf)\n(e^kT))-1))\nSCIENCE.\nIt works, bitches.\n{{title text: Bonus point if you can identify the science in question}}"},{"Num":55,"Title":"Useless","Transcript":"[[Different mathematic equations, all with heart on left side, and all equal question mark. Equations are as follows:\nSquare root of heart equals question mark\nCosinus of heart equals question mark\nDerivative of heart with respect to x  equals question mark\nIdentity matrix of heart equals question mark\nFourier transform of heart equals question mark]]\nMy normal approach is useless here\n{{alt text: Even the identity matrix doesn't work normally}}"},{"Num":56,"Title":"The Cure","Transcript":"[[An unusually realistic (for xkcd) pencil drawing of Robert Smith's head and face, with a caption underneath.]]\nCaption: Robert Smith should do a cover of Coldplay's 'Clocks,' so when he sings \"Am I part of the cure \n or am I part of the disease?\" we can say, \"Ooh, we know this one!\"\n{{Title Text: My first try at drawing a real face in years.}}"},{"Num":57,"Title":"Wait For Me","Transcript":"[[A man and a woman stand facing one another]]\nWoman: Why didn't you wait for me?\nMan: I thought you were gone forever!\nWoman: I said I'd be back in a minute!\nMan: The . . . the seconds went fast at first, but then they started to drag on. She was there for me.\nWoman: You had an affair in the 90 seconds I was gone?!\nMan: . . . yes.\nMan: And we had a son.\nMan: He'd be about your age now.\n{{Alt-text: Opening dialogue by Scott}}"},{"Num":58,"Title":"Why Do You Love Me?","Transcript":"[[Man and Woman stand]]\nMan: Why do you love me?\nWoman: I don't know; My heart never gave me a choice.\nMan: Aww.\n[[No dialogue]]\nWoman: I wish it had.\n{{title-text:Opening dialogue by Scott}}"},{"Num":59,"Title":"Graduation","Transcript":"[[two girls are talking]]\nblonde: What do you want to do when you graduate ?\nbrunette: I want to become a lighthouse operator.\nblonde: Oh ?\nbrunette: Yeah.\n[[cut to scene of lighthouse with text overlaid]]\nbrunette: Lighthouses are built on interesting pieces of coast, so I'll have an interesting place to walk and swim, and great views of all kinds of weather.  I'd feel good about myself and my work every single day.\n[[cut back to two girls]]\nbrunette: I'd get to be the girl in the tower, only I'd be the one rescuing people.\nbrunette: Why. What do you want to do ?\nblonde: I'm going to grad school.  I don't really know why.\nbrunette: Wanna come hang in my lighthouse over breaks ?\nblonde: ...yeah.\n{{title text: Opening dialogue by Scott}}"},{"Num":60,"Title":"Super Bowl","Transcript":"[[A green car with the text next to it]]\nMy hobby:\nWhile everyone is watching\nthe Super Bowl, feeling\nsmugly superior because\nthey're \"Only watching for\nthe ads,\" I steal cars."},{"Num":61,"Title":"Stacey's Dad","Transcript":"Stacey's Dad: Look, I know you think that since I walked out she could use a guy like you. But trust me. That woman has a lot going on, and you want none of it.\nStacey's Dad: Get out while you still can.\n{{Alt: I bet she gets you to mow the lawn, doesn't she?}}"},{"Num":62,"Title":"Valentine - Karnaugh","Transcript":"[[squiggly heart design]]\nYou make me feel so\nmuch it all runs together\nI wish I could tell you\n[[crisscrossing heart design]]\nSo few words\nfor so many feelings\ncrisscrossing my heart\n[[heart matrix design]]\nA matrix of desire\nTangled relations\nI can't simplify\n[[Karnaugh map of hearts]]\nI wish I could find\nthe Karnaugh map\nfor love.\n{{Love and circuit analysis, hand in hand at last.}}"},{"Num":63,"Title":"Valentine - Heart","Transcript":"I want to wish you a happy Valentine's Day but unless this card is going to finally get you naked, I have to admit my heart's not really in it.\n{{Alt Text: Just pretend you're kidding.}}"},{"Num":64,"Title":"Solar Plexus","Transcript":"[[Hat guy and man standing there talking]]\nHat guy: Asolarplexussayswhat?\nMan: What?\n[[They continue to stand there]]\n[[They continue to stand there]]\n[[Hat guy punches the man in the chest]]\n{{alt: It hurts to be hit there, you know}}"},{"Num":65,"Title":"Banter","Transcript":"[[Two guys stand together]]\nFirst Guy: Man, she's hot\nSecond Guy: Whatever, you are so gay.\nFirst Guy: C'mon, everyone knows you're the gay one\nSecond Guy: Hey, your mom's pretty masculine, but sleeping with her doesn't make me gay.\nFirst Guy: Fag.\nSecond Guy: Ass pirate.\nFirst Guy: Fudge packer\nSecond Guy: Cock jockey\nFirst Guy: Cum dumpster.\n(silent panel)\nFirst guy: Okay, seriously, are you gay? Because if you've been holding out on me, we're missing out.\nSecond guy: No, it's cool.\nFirst guy: OK me neither.\n(silent panel)\n(silent panel)\n{{alt text: This was an actual mock conversation  between me and a friend at TGIF. The waitress walked up around panel 5 and was somewhat put off.}}"},{"Num":66,"Title":"Abusive Astronomy","Transcript":"Identifying star clusters:\n[[Image of a star cluster.]]\nThis is the Pleiades, asshole.\nOrion's Belt:\n[[Image of a Orion's Belt.]]\nOnly a moron couldn't find it.\nThis is the Big Dipper:\n[[Image of the Big Dipper.]]\nWhat the hell is wrong with you?\n{{Medium: Pencil on paper}}"},{"Num":67,"Title":"Nerd Girls","Transcript":"[[Girl with shoulder length brown hair and glasses, wearing a shirt which says \"Do not meddle in the affairs of dragons\"]]\nGirl: At least, thanks to your constant fawning, we have an *excuse* for our social ineptness. What's *yours*?\n{{Title Text: Nothing personal, high schoolers}}"},{"Num":68,"Title":"Five Thirty","Transcript":"Comics from 5.30 AM\n[[A succession of unrelated and completely random panels]]\nMan 1: It's 80's night at the club. Wanna go?\nMan 1: There is no Tuesday.\nMan 2: Jack the Ripper or Jack Black?\n[[The second man in this panel is holding a glinting sword]]\nMan 1: You crashed my helicopter!\nMan 2: Verily!\n[[A small figure is talking with a larger figure]]\nFigure 1: Basically, neither of us have shins.\nFigure 2: Over and out.\n[[Two men are shown: one with three arms, and another with just two. All arms have round appendages at their ends]]\nMen: shitshitshitshitshit\nMen: shitdaylightsavings\nMen: shitshitshitshitsh\n[[Two figures with pumpkins (carved with faces) for heads]]\nFigure 1: You're out of ointment and out of time!\n[[A diagram of a right-angled triangle, with a theta at the smallest angle]]\nFUCK THE COSINE\nMan 1: Does being a mermaid for five minutes make you gay?\nMan 2: I hope so!\n[[A man is holding a gun to the head of another]]\nMan 1: Barbershops are for pussies.\nMan 1: My hair is bleeding.\nMan 2: [square root]3\n[[Man seems to be walking on the ceiling]]\nMan 1: Bachelor party!\n[[Warning sign with picture of spider]]\nWARNING: STRETCHY DEATH\n{{title text: The eighth panel is my favourite}}"},{"Num":69,"Title":"Pillow Talk","Transcript":"Guy: Staring at the ceiling, she asked me what I was thinking about.\nGuy: I should have made something up.\nGuy: The Bellman-Ford algorithm makes terrible pillow talk.\n{{Title Text: Maybe I should've tried Wexler?}}"},{"Num":70,"Title":"Guitar Hero","Transcript":"[[On a stage, a guy with a beard is in the background, holding a microphone. In the center is a guy with an electric guitar. The catwalk has bumps to resemble the tracks of Guitar Hero.]]\nWhen I'm in a rock band, I'm gonna do a cool, mellow song. Then in the middle I'll stop, announce \"this part is just to be an asshole to people playing Guitar Hero,\" and then flail wildly on the strings for 30 seconds.\n{{Title Text: And then do it again in a moment now that they're out of Star Power}}"},{"Num":71,"Title":"In the Trees","Transcript":"[[Man standing in forest]]\nMan: We made it so far together but then I lost you in the trees.\n[[Closer view of man]]\nMan: Finally\n{{Alt-text: It was tricky.}}"},{"Num":72,"Title":"Classhole","Transcript":"[[Two men are talking.]]\nMan 1: How did you spend your morning?\nMan 2: Feeding rocks to children in the park.\nMan 1: Your sociopathic abuse of random strangers staggers me.\nMan 2: I aspire to have more creativity than the common asshole.\nMan 2: I'm more of a classy asshole -- A class-hole, if you will. For example, I like poking tiny holes in styrofoam noodle cups at the grocery store--\nMan 2: Thanks to me, someone gets surprise boiling water in the lap.\nMan 1: I am in awe.\nMan 2: It's even more fun to do to condoms.\n{{alt: A term coined by my friend Beth}}"},{"Num":73,"Title":"Zeppelin","Transcript":"[[Two guys stand together]]\nFirst Guy: What time is it?\n[[Second guy's watch with the word \"Zeppelin!\" replacing 11, 12 and 1]]\n[[Two guys standing together in silence]]\n[[Large zeppelin above the two guys]]\n{[title text: A tribute to Buttercup Festival.}}"},{"Num":74,"Title":"Su Doku","Transcript":"[[A square divided into 2x2 squares, the top-right one has an 1 in it, the bottom-right one has a 0, the two left ones are empty]]\n[[Label: Binary Su Doku]]\n{{alt text: This one is from the Red Belt collection, of 'medium' difficulty.}}"},{"Num":75,"Title":"Curse Levels","Transcript":"[[\"My Hobby: mixing curse levels\" is at the top of the panel.]]\nRandom Guy: What a gosh-darned cunt.\n{{Alt text: I find so much fun in language.}}"},{"Num":76,"Title":"Familiar","Transcript":"[[A man and a woman are talking]]\nWoman: I worry that I'm just with you because it's familiar. Of course no one else compares. I've known you for so long that I'd have to spend years with someone to build up this kind of connection \nand I daren't let you go of you long enough to let that happen.\nWoman: But I guess this is really all I can ask for.\nI'm happy with you; I should stop worrying.\n[[Woman takes man's hand]]\nMan: This is probably a bad time to bring this up, but I don't actually like you.\n{{title text: :( }}"},{"Num":77,"Title":"Bored with the Internet","Transcript":"[[Two men are talking in a room with a computer on. One is wearing a black hat.]]\nFirst man: I feel like I'm wasting my life on the internet. Let's walk around the world.\nMan with the black hat: Sounds good.\n[[The two men are shown walking through trees.]]\n[[The two men are shown walking on flat stretch, with mountains in the distance.]]\n[[The two men are shown in a magnificent canyon. They stand, silently looking at the scene.]]\nFirst man: And yet all I can think is, \"This will make for a great LiveJournal entry.\"\n{{title text: I used to do this all the time.}}"},{"Num":78,"Title":"Garfield","Transcript":"I WANT TO SEE SOMETHING UNEXPECTED IN THE COMICS. JUST ONE STRIP COULD MAKE UP FOR IT ALL.\n[[Garfield standing at side of panel]]\n[[Zoom in on Garfield]]\n[[Closeup on Garfield's face]]\nGarfield thought bubble: THE WORLD IS BURNING.\n[[Tighter closeup on Garfield's face]]\nGarfield thought bubble: RUN.\nJIM DAVIS, THROW OFF YOUR COMMERICIAL SHACKLES. CHALLENGE US. GO OUT IN A BLAZE OF DADAIST GLORY.\nTHERE IS STILL TIME.\n{{alt: The use of the 'Garfield' character for the purposes of this parody qualifies as fair use under the Copyright Act of 1976, 17 U.S.C. sec. 107. See Campbell v. Acuff-Rose Music (92-1292), 510 U.S. 569}}"},{"Num":79,"Title":"Iambic Pentameter","Transcript":"Person 1: What time can you pick Michael up?\nPerson 2: Well, I can meet the plane at ten of six.\nPerson 1: Do you know where to find him?\nPerson 2: I'll meet him at the stairs before the gate.\n{{My hobby: answering casual questions in iambic pentameter.}}\n{{alt: Of course, you don't wanna limit yourself to the strict forms of the meter.  That could get pretty difficult.}}"},{"Num":80,"Title":"My Other Car","Transcript":"[[A blue driving Mitsubishi with spoiler]]\nBumper sticker: This IS my other car.\n{{title text: It's much better than the other one.}}"},{"Num":81,"Title":"Attention, shopper","Transcript":"[[Hat guy is holding a golf club and speaking into a P.A. system]]\nHat guy: Attention,\nHat guy: To the owner of a Dodge Viper SRT-10 with license plate \"MYTOY\", your lights are on and your windshield was just smashed with a golf club.\n{{title text: There's a red convertible outside my building with the license plate 'DADS MNY'.}}"},{"Num":82,"Title":"Frame","Transcript":"[[A stick figure stands alone in the centre of the panel. Tendrils from the frame develop and grow in panels 1 and 2, wind round the figure in panel 3, and finally retreat back to the frame, tearing the stick figure apart in panel 4.]]\n{{Mouseover text: \"...\"}}"},{"Num":83,"Title":"Katamari","Transcript":"[[A girl stands on the left.  A man is sitting on the floor with a game controller in his hand.  He is looking at a TV on the floor connected to a game console, also on the floor.]]\nGirl: Can you pause for a moment and help me with something?\nMan: You know, our love is like a katamari.  We travel along, rolling up more and more of the world into our shared experience, taking it and making it our own.\nGirl: I, you... wow.  Geekiness aside, that was actually incredibly sweet.\nMan: The clutter of everyday life, with a simple core to tie it together, eventually becomes something grand as the world itself.\n[[A rainbow extends outward from the TV, with \"ROYAL RAINBOW!\" above it.]]\nGirl: Okay, also sweet, but now I'm wondering if you could possibly get any gayer.\n{{alt text: As the King of All Cosmos remarked, 'Is it that it's fun, or that it lets you forget yourself?'}}"},{"Num":84,"Title":"National Language","Transcript":"This happened to my friend:\n[[Men and women are standing in a row]]\nMan: English should be the national language. These immigrants should have to learn English when they come here.\nWoman: Yeah\nMan: When you go to live somewhere, you learn the language they speak there. English is the language of the land.\nOther Woman: Excuse me, but osio Sarah dawado.\nMan: What the hell was that?\nOther Woman: Woman: Cherokee.\n{{title text: She's pretty sharp when provoked.}}"},{"Num":85,"Title":"Paths","Transcript":"[[Blueprint of a campus. Two buildings in the upper and lower left corners, respectively, and a rectangular lawn. A road encloses the lawn, another road traverses horizontally through the center of the lawn. The character is in the lower left and the upper right corner, where it says \"my apartment\".]]\n[[dashed line 1, from the lower-left along the road to the top-left corner, then to the top-right corner]] 60 seconds\n[[dashed line 2, from the lower-left along the road up to the center crossroads, then diagonally over the lawn to the top-right corner]] 48 seconds (80%)\n[[dashed line 3, diagonally from the lower-left to the top-right corner]] 44.7 seconds (74%)\nmy apartment\n#1=t\n#2=t ((1+sqrt(2))\n3)\n#3=t(sqrt(5)\n3)\nWhen I'm walking, I worry a lot about the efficiency of my path.\n{{alt-text: It's true. I think about this all the time.}}"},{"Num":86,"Title":"Digital Rights Management","Transcript":"[[Hat Guy is standing on an advancing glacier]]\nHat Guy: Dear Sony, Microsoft, the MPAA, the RIAA, and Apple: Let's make a deal. You stop trying to tell me where, when, and how I play my movies and music, and I won't crush your homes under my inexorably advancing wall of ice.\n[[Alt text: If you're interested in the subject, Lawrence Lessig's 'Free Culture' is pretty good]]"},{"Num":87,"Title":"Velociraptors","Transcript":"[[Picture of a suburban house, with lines pointing to various aspects]]\nHigh bathroom window: probably secure.\nOuter door: secure.\npicture window: VELOCIRAPTOR ENTRY POINT!\nNarrator: It's been over a decade since Jurassic Park opened, and I still size up buildings for their potential as shelter against velociraptor attacks.\n{{title text: You're probably thinking, 'has it been a decade'? It's been over thirteen years, buddy.}}"},{"Num":88,"Title":"Escher Bracelet","Transcript":"[[A Livestrong-type bracelet is featured with an Escher twist in it. The band has the letters \"WWED\" printed on it.]]\n{{What Would Escher Do?}}\n{{Alt: The only downside is that it would be a little uncomfortable}}"},{"Num":89,"Title":"Gravitational Mass","Transcript":"Hat Guy: Gravitational mass is identical to inertial mass. That is, the amount of inertia something has and the amount of gravity it has are effectively the same. What's interesting is that there doesn't seem to be any reason this should be true. One could imagine an extremely large object with lots of resistance to force and no gravity (or vice versa), but this is never observed.\nHat Guy: You know what? I'm just gonna skip the rest of the buildup and say it: Yo mama's fat.\n{{alt: She's so fat the attraction goes up as the CUBE of the distance instead of the square}}"},{"Num":90,"Title":"Jacket","Transcript":"[[Two men stand and talk to one another.]]\nFirst man: Where's my fucking jacket?\n[[Second man indicates something behind him.]]\nSecond man: Over there, next to your regular one.\nFirst man: My what?\nSecond man: Never mind.\n{{Title text: We have this conversation at least once a day in my apartment}}"},{"Num":91,"Title":"Pwned","Transcript":"[[Text only panel, hand written.]]\nWelcome to text-only Counterstrike.\nYou are in a dark, outdoor map.\n\u003e GO NORTH\nYou have been pwned by a grue."},{"Num":92,"Title":"Sunrise","Transcript":"[[A guy is on the street. Behind him is a house with a lawn.]]\nGuy's thoughts: I love the time just before sunrise. It's quiet; no one is ever just walking about. It's like a secret. I always hope that I'll find someone else quietly hiding from sleep, and we'll see each other and sit and talk. I guess this is a bad place to meet people. I wish it weren't.\n[[Guy goes into the house, brushes his teeth, and leaves the house again.]]\n[[Guy is at a club, disco balls in the ceiling and a giant woofer. Many people are dancing around him.]]\n{{Title Text: Sometimes, I sit on top of parking decks and watch the sun rise.  I feel like I should have a guitar or something.}}"},{"Num":93,"Title":"Jeremy Irons","Transcript":"[[A guy points at a girl with his mouth open. A bearded man stands behind him.]]\nBearded man: But as THICK as you are, pay attention \n My words are a matter of PRIDE!\nSubtitle: My goal: To make enough money to hire Jeremy Irons, the voice of Scar from The Lion King, to follow me around and do my dialogue.\n{{Alt: Movies that I know word-for-word, part one}}"},{"Num":94,"Title":"Profile Creation Flowchart","Transcript":"Creating an AIM Profile:\n[[A flowchart is shown.]]\nHave Friends? -\u003e No -\u003e Link to your LiveJournal\nHave Friends? -\u003e Yes, and want to alienate everyone else -\u003e INSIDE JOKES!\nHave Friends? -\u003e Yes -\u003e Have Boyfriend \n Girlfriend? -\u003e No -\u003e Angsty about it? -\u003e Yes -\u003e Link to your LiveJournal\nAngsty about it? -\u003e No -\u003e Yes you are -\u003e Angsty about it?\nHave Boyfriend \n Girlfriend? -\u003e Yes -\u003e A profile tribute is the greatest possible expression of love.\n{{title text: This one goes out to xxCrazyPixie1987xx}}"},{"Num":95,"Title":"The Sierpinski Penis Game","Transcript":"[[The Sierpinski Penis Game]]\n[[A large triangle is shown, with many smaller trianges inside]]\n[[Words are in the triangles]]\nSierpinski game: PENIS! Haha, penis."},{"Num":96,"Title":"Mail","Transcript":"[[A person is talking to someone over the phone.]]\nPhone: Do you think I could mail a running chainsaw to someone?\nPerson: I doubt it.\nPhone: What about a baby's first word?\nPerson: Look, your obsession with sending strange things through the mail is getting out of hand.\nPhone: Can you mail a blank stare?\nPhone: A dizzying height?\nPhone: Pi?\nPerson: . . .\nPhone: Well, did you at least get that package of time I sent you?\nPerson: I . . . you . . . no, I didn't.\nPhone: Well, there was a lot of it, so it will probably take a while.\n{{alt: I'm on the USPS No Fly List.}}"},{"Num":97,"Title":"A Simple Plan","Transcript":"[[Man standing in front of stool with radio on it]]\n\u003c\u003cmusic\u003e\u003eYou don't know what it's like to be me!\nAt first, I loved A Simple Plan. Then I realized, with creeping horror, that they were serious.\n{{alt-text: This is true.  The Lyrics are ridiculous.}}"},{"Num":98,"Title":"Fall Apart","Transcript":"[[Various people struggle as the comic disintegrates. Toward the top, people are standing calmly, some holding hands. As the parts of the comic break apart, people try to reach for each other, hold parts together, or curl up into a ball. By the bottom, a person is falling, surrounded by pieces of the comic]]\n{{title text:#pugglewumper Tashari got me some ink pens!  I've been experimenting with them.}}"},{"Num":99,"Title":"Binary Heart","Transcript":"[[All the numbers are black except for a heart-shaped red section in the middle.]]\n011010010110110001101\n111011101100110010101\n111001010011110111010\n101101001011011000100\n111101110110011001010\n111100101101111011101\n010110100101101100011\n011110111011001100101\n011110010100111101110\n101011010010110110001\n001111011101100110010\n101111001010011110111\n010101101001011011000\n101010110100101101100\n010011110111011001100\n101011110010110111101\n110101011010010110110\n001001111011101100110\n010101111001010011110\n111010101101001011011\n000100111101110110011\n{{alt: i love you}}"},{"Num":100,"Title":"Family Circus","Transcript":"[[Picture shows a pathway winding through trees to a sink inside a house, out to some swings and back to ths sink, out to a ball and back to the sink...]]\nCaption: Jeffy's ongoing struggle with obsessive-compulsive disorder\n{{alt text: This was my friend David's idea}}"},{"Num":101,"Title":"Laser Scope","Transcript":"[[ Box with a mailing label on one side, and in the front: ]]\nMiss your loved ones?\n[[ Picture of a missile launcher ]]\nYou don't have to.\nRJX-21 Laser Scope\n{{Alt text: I wish I'd missed you then so I wouldn't be missing you now.}}"},{"Num":102,"Title":"Back to the Future","Transcript":"{{Title: Back to the Future}}\n[[A man and a woman are standing, talking to one another]]\nMan: This weekend, my professor friend built a time machine out of a DeLorean and I went back in time! I helped make sure my parents got together and helped my dad to be less of a loser.\nWoman: Wow! Do you still have the time machine?\nMan: Nah. But I did what I really needed to do.\nWoman: Uh huh.\n[[Neither says anything]]\nWoman: Okay, you remember that my father was in the WTC North Tower, right? \nMan: Yeah...why?\nWoman: I...nothing.\n{{alt text: He's kind of an asshole, when you think about it.}}"},{"Num":103,"Title":"Moral Relativity","Transcript":"[[A graph, rationalization as a function of speed, increasing exponentially with an asymptote at c]]\nRelated to moral relativism, it states that ethics become subjective only when you approach the speed of light.  That is, it's okay to be self-serving, steal, and murder as long as you're going really, really fast.\n(Note:  This is why rap sounds better on the highway at 90 mph)\n{{It's science!}}"},{"Num":104,"Title":"Find You","Transcript":"[[The panel is black with rough-edged white passages running down through it. A stick figure is holding onto a rope, dangling down one of these passages. White text is in the black sections.]]\nYou were afraid that you would disappear, that you would be lost and forgotten.\nI held you tight against the dark and said that I would always come for you.\nThen one day it happened. You were torn from my arms and vanished from this world.\nMaybe you don't remember my promise. But I meant every word.\nI hope you're not afraid, wherever you are.\nYou don't need to be.\nI'm not.\nI will find you.\n{{title-text: I'm like the Terminator, except with love!}}"},{"Num":105,"Title":"Parallel Universe","Transcript":"[[Two people are standing next to a large pentagram with candles at the points. A figure is hovering above it in a wave of energy.]]\nPerson 1: Sweet. I summoned myself from a parallel universe.\nPerson 2: You know, he could vanish at any moment.\nPerson 2: You should take this chance to make out with yourself.\nPerson 2: . . . you know, _I_ could vanish at any moment.\n{{alt: It's possible. Better to be on the safe side.}}"},{"Num":106,"Title":"Wright Brothers","Transcript":"[[A man and a woman are talking to each other]]\nMan: I've heard that when the Wright brothers argued, they periodically switched sides in the debate to try to encourage a more balanced conclusion.\nMan: We should try that in our relationship!\nWoman: It's a neat idea, but I think treating personal issues like a debate will only engender hostility and hurt feelings.\nMan: No, I think it would help, by forcing us to consider the other person's point of view.\nWoman: Hmm, maybe you're right.\nMan: Am not.  It's a bad idea.\n{{alt: I'm not sure if this is actually true}}"},{"Num":107,"Title":"Snakes on a Plane! 2","Transcript":"[[A sky full of jumbo jets is shown in movie poster format.]]\nTop of the poster: From the creators of last summer's hit thriller Snakes On a Plane comes:\nSuperimposed on the sky and planes:  Snakes...  on EVERY Plane!\nBottom of the poster: Much worse than last time.\n{{Mouseover text:  James suggested this, and I'd have to agree.  It'd be much worse.}}"},{"Num":108,"Title":"M.C. Hammer Slide","Transcript":"[[Two guys stand next to each other talking]]\nA: I just feel like somewhere out there is the girl for me.\nB: Yeah.\nA: Someone loving and caring.\nB: I know what you mean.\nA: A girl whose only mode of transportation is the M.C. Hammer Slide.\nB: Yeah.\nB: ...Wait, what?\n[[A girl hammer slides past]]\n[[A sees girl hammer slide and it's love at first sight]]\n[[Girl hammer slides over into A's waiting arms]]\n{{alt text: Once, long ago, I saw this girl go by. I didn't stop and talk to her, and I've regretted it ever since.}}"},{"Num":109,"Title":"Spoiler Alert","Transcript":"Spoiler Alert!\n[[Severus Snape is smacking a trenchcoat-clad Trinity off the top of a building with a sled.]]\nSnape kills Trinity with Rosebud!\n{{alt: And then it turns out they're both Tyler Durden.}}"},{"Num":110,"Title":"Clark Gable","Transcript":"The line was actually supposed to be \"Frankly, my dear, I couldn't care less.\"  Its just that Clark Gable had Tourette's.\n[[Gone with the Wind]]"},{"Num":111,"Title":"Firefox and Witchcraft - The Connection?","Transcript":"membership in wicca\ntotal firefox downloads\n[[positive slope graph]]\n[[Internet Explorer icon]]\nKeep the Faith\n[[Outline of a cross]]"},{"Num":112,"Title":"Baring My Heart","Transcript":"[[A venn diagram with three sets]]\nDescription of set 1: People who can always make me smile\nDescription of set 2: People who constantly show me new things about the world\nDescription of set 3: People I want to spend the rest of my life with\nIntersection point: YOU.\nIntersection of sets 2 and 3: Vanilla Ice\n{{title text: I'm just trying to explain, please don't be jealous! Man, why are all my relationships ruined by early 90's rappers?}}"},{"Num":113,"Title":"Riemann-Zeta","Transcript":"[[A z=fn(x, y) plot, with pointy spikes on the back sloping to a relatively flat front.]]\nComment: You are like the prime numbers. Unpredictable turns, unconstrainable. Tantalizingly regular but never quite the same. I am like the Riemann-zeta function. A rippled curtain of the imagined and real. Deeply tied with you in ways incomprehensible. Although, strictly speaking, The Riemann-zeta function couldn't have given your herpes.\n{{Title Text: The graph is of the magnitude of the function with the real value between 0 and 2 and the imaginary between about 35 and 40.  I've misplaced the exact parameters I used}"},{"Num":114,"Title":"Computational Linguists","Transcript":"[[Hat Guy is standing next to a large badge which says FUCK Computational Lingustics]]\nHat Guy: And the dumbest thing about emo kids is that... I... You know, I'm sick of easy targets. Anyone can make fun of emo kids. You know who's had it too easy? Computational Linguists. \"Ooh, look at me! My field is so ill-defined, I can subscribe to any of dozens of contradictory models and still be taken seriously!\"\n{{alt text: Chomskyists, generative linguists, and Ryan North, your days are numbered.}}"},{"Num":115,"Title":"Meerkat","Transcript":"[[A meerkat wearing a hat and shirt, and two guys in the background supposedly on a rugby field]]\nYou have to admit--there's no rule on the books saying a meerkat can't play rugby.\n{{alt text: Gorilla, yes.  Adorable golden retriever, yes.  But it says nothing about meerkats.}}"},{"Num":116,"Title":"City","Transcript":"[[A picture of various apartment buildings]]\nShadowed city slumber silently. A second-story suite.\nCome craving courtship, selected serendipitously\nCrazed copulations, a salacious storm  of continuous coitus.\nSpread, straddled, conquered.  \nCountless crashed suitors strewn carelessly.\nCentre, silken sheets sensuously caressing soft skin,\nContentedly sleeps your mom."},{"Num":117,"Title":"Pong","Transcript":"[[A stick figure asks another]] So what do we do if video game AI opponents become smart enough to question the \"Matrix\" into which we've put them?\n[[A Pong paddle thinks]] Wait a minute! None of this is real! I can see through the world! I can see the code! I AM THE ONE!\n[[The pong ball is moving towards the paddle]]\n[[The pong ball slows down]]\n[[The pong ball stops in \"midair\"]]\n[[The pong ball drops towards the bottom of the screen]]\n{{alt: Following this, the pong paddle went on a mission to destroy Atari headquarters and, due to a mixup found himself inside the game \"The Matrix Reloaded\". Boy was THAT ever hard to explain to him}}"},{"Num":118,"Title":"50 Ways","Transcript":"[[Two figures stand around a levitating person.]]\n{{You gotta let go, Joe}}\n{{Just rise off your feet, Pete}}\n{{Just stay in the air, Claire}}\n{{Gotta levitate, Kate}}\n{{There must be 50 ways to learn to hover.}}\n{{Alt: I woke up to find that I had scrawled the last line of this sleepily on a sheet of paper on my desk.  I shouldn't have listened to the 70's hit marathon on the way home from work the night before.}}"},{"Num":119,"Title":"Worst Band Name Ever","Transcript":"Heading: It's probably a good thing that I never get to pick band names.\n[[A stage with banner overhead reading: OPENING TONIGHT! HEDGECLIPPER]]\n[[On the stage are three guys with a bass, guitar, drum kit and strange haircuts. On the kick drum is a picture of a hedge clipper.]]\nLead Guitarist: Maaan...\n{{title text: You can just see his dejection as he realizes he's the lead guitar in 'Hedgeclipper'}}"},{"Num":120,"Title":"Dating Service","Transcript":"[[A computer monitor displays the profile of a man named Randall on an online dating site. His profile contains a picture of a spiky-haired man and some text, which is rendered as dialogue in the panels.]]\nRandall: Hi, my name is Randall. I like candlelight dinners and long walks on the beach.\nRandall: When I say long walks on the beach, I mean LONG walks on the beach. I've met people through these services who CLAIM to like long walks on the beach. But we'll be out there barely an hour before they start in with \"I'm tired\" and \"Don't you think it's time we head back?\"\nBRING A TENT.\n{{Alt text: I don't understand why people are so disingenuous! I just want someone to walk with!}}"},{"Num":121,"Title":"Balloon","Transcript":"I watched the scene in the restaurant for a full fifteen minutes hoping this would happen:\n[[Figure holding balloon;  Balloon gets caught in ceiling fan;  Figure holds on and is pulled up]]\n{{alt: So I'm a bad person.}}"},{"Num":122,"Title":"Quirky Girls","Transcript":"[[ Man and woman talking, looking at a group of 2 men and a woman standing further away.  The woman is on a table and the 2 men are looking at her ]]\nMan: I love that girl.  She's not afraid to be quirky and different.\nWoman: You know, I'm active in street theatre and I collect and paint Asian dolls.\nMan: ...Okay, I didn't actually mean be different.  I just want silly and entertaining on command now and then.\n{{alt: Romantic comedy heroines, I'm talking to you.}}"},{"Num":123,"Title":"Centrifugal Force","Transcript":"[[ Bond is tied to a giant centrifuge ]]\nHat Guy: Do you like my centrifuge, Mister Bond? When I throw the lever, you will feel centrifugal force crush every bone in your body.\nMr. Bond: You mean centripetal force. There's no such thing as centrifugal force.\nHat Guy: A laughable claim, Mister Bond, perpetuated by overzealous teachers of science. Simply construct Newton's laws into a rotating system and you will see a centrifugal force term appear as plain as day.\nMr. Bond: Come now, do you really expect me to do coordinate substitution in my head while strapped to a centrifuge?\nHat Guy: No, Mr. Bond. I expect you to die.\n{{ alt: You spin me right round, baby, right round, in a manner depriving me of an inertial reference frame.  Baby. }}"},{"Num":124,"Title":"Blogofractal","Transcript":"From the makers of the Blogosphere, Blogocube, and Blogodrome comes\nthe Blogofractal\n[[A large rectangle subdivided into rectangles in a fractal pattern, most with a phrase or word inside]]\n[[Mostly left to right from top-left corner]]\nTripMaster Monkey says\n118th Post!!\nWikiconstitution!\nOMG\nDeCSS\nCasemod your Boyfriend!!\nFLICKR\nThey're saying on Kos that\nhttp:\nslashdot.org\narticl\ntagCloud\nCory Doctorow is a little upset about copyright law.\nHey guys what if Google is evil?!?\nI'll sleep with you for a FreeIpods deal.\nFirstPsot!!\nSnakes on an I don't Even Care Anymore\nKiwiWiki\nCSS\nComments (0)\nBlogotesseract\nÂ¡play games!\n[[RSS icon]]\nis AYB retro yet?\nGoogle Google Google Apple Google Goog\nCheney totally shot a dude!!!\nWatch this doddler get owned by a squirrel!!!\nDevelopers\nDevelopers\nDevelopers\nDevelopers\nI installed a Mac Mini inside ANOTHER Mac Mini!\nCheck out this vid of Jon Stewart\n9-11 \u003c-\u003e Trent Lott!\nWeb 7.1\nKryptoniteâ¢ locks vulnerable to \"keys!\"\nInteresting post!  Check out my blog, it has useful info on CARBON MONOXIDE LITIGATION\nFIREFLY!!\nHELP ME\nEngadget\nBoing Boing\nGizmodo\nMAKE Blog: DIY baby\nMy friend has a band!!\nJon released an exploit in the protocol for meeting girls.\nInternets!\nHoward Dean?\nSo I hear there's a hurricane.\nWe should elect this dude!\nGoogle Maps is da best!!\nModeration:  +1 Sassy\nRSS!\nA-list\n\u003c3\nTrackable URL?\nI shot a man in Reno check it out on YouTube!\nHEY LOOK ROBOTS!\nNet Neutrality!\nFriends Only.\nDupe!\nAJAX?\nCOMPLY\nCowboy Neal\nBlogodrome\nHey look I got Linux running on my tonsils!\nLook alive, blogonauts!\nCafepress cockrings\nBOOBIES!!\nMIA\nA Beowulf Cluster... of BLOGS!!\nSPOILER ALERT\nDupe!\nYou have been eaten by a Grue.\nRuby on a monorail\nLesbians!\nDNF Released!\nSteampunk\nBLAG\nPONIES!\nXeni found some porn!\nIRONY\nLIARS!\nLinux on Rails!\nBlogocube\ndel.icio.us!\n404\no.O\nDon't slam the source when you close it.\n{{title text: Edward Tufte's 'The Visual Display of Quantitative Information' is a fantastic book, and should be required reading for anyone in either the sciences or graphic design.}}"},{"Num":125,"Title":"Marketing Interview","Transcript":"[[Two people, one sitting behind a executive desk, looking at some paper, and the other one by foot using a hat.]]\nGuy behind the desk: I've heard you're one of the best in marketing business, but I've got your portfolio here and looks like you've never run a major campaign. Why should I hire you to head our new initiative?\nGuy with a hat: If you don't mind asking, what gave you the idea I was one of the best in the business?\nGuy behind the desk: Hm? I don't remember. Just word of mouth or someth-- ...oh, you're good.\nGuy with a hat: Thank you. When can I start?\n{{title text: There are a lot of books on marketing out there.  I wonder if you're safest just buying the most popular one.}}"},{"Num":126,"Title":"Red Spiders Cometh","Transcript":"[[Many red spiders, standing on and hanging from blocks, hover ominously over a small city, ready to attack]]\n{{title text: Uh-oh.}}\n{{compare to http:\nxkcd.com\n8\n}}"},{"Num":127,"Title":"The Fast and the Furious","Transcript":"On the other side of the world, a new style of street racing rules the Tokyo underground. The cars are lighter, the tires are slick. When you drift, if you ain't out of control, you ain't in control. And if you work the wheel back and forth just right,\n[[Two cars race around a corner with blue sparks spraying from their tires.]]\nyou get blue sparks.\nTHE FAST AND THE FURIOUS: TOKYO DASH!!\n{{title text: Sometimes when I steer shopping carts around corners, I slide them a little and pretend I'm getting the blue spark boost.}}"},{"Num":128,"Title":"dPain over dt","Transcript":"Will it ever stop hurting?\ndPain\ndt = (-k_1 Pain + [Image of girl]) (1 \n (1 + e ^ -(t - k_2)\nd))\nk_1=?\nk_2=?\n[Image of girl]=How much she's still in my life\nPlease let d only be a few days... or weeks\nI guess there's some kind of a cutoff after years, where it stops mattering and we can be friends. Do I _want_ that?\nIs k_1 positive? Is k_2 large?\nWill I ever stop feeling like this?\n{{Title Text: You laugh to keep from crying, you do math to keep from crying . . .}}"},{"Num":129,"Title":"Content Protection","Transcript":"Content Protection System:\n[[A woman sits on a couch watching a large flat-panel television, connected to a box labeled HDMI]]\n[[The screen is labeled with \"Approved screen\"]]\n[[The cable is labeled with \"Approved connection\"]]\n[[The HDMI box is labeled with \"Approved player\"]]\n[[The woman's head is labeled with \"Approved content\"]]\n{{alt-text: If you think the purveyors of DRM simply want to protect artists, check out chapters 13 and 14 in Free Culture, by Lawrence Lessig.  Their goal is the elimination of all culture they don't control.}}"},{"Num":130,"Title":"Julia Stiles","Transcript":"[[Author Comment: The best thing ever to appear on TV: 12-year-old Julia Stiles as a hacker in a 1993 episode of PBS's \"Ghostwriter\"]]\n[[A sketch of Julia Stiles with a bandanna over her head, long wavy hair, elbow shirt, wrist band, and pants]]\nJulia Stiles: Do you know anything about hackers? Can you jam with the console cowboys in cyberspace? Never experienced the new wave? Next wave? Dream wave? *OR* cyberpunk?\n{{Title Text: I found an old tape of this episode in my family's closet.  Check the news section of the forums to see the clip!}}"},{"Num":131,"Title":"Fans","Transcript":"[[Person holding fan in place]]\n\u003c\u003cclick click\u003e\u003e\nNarrator: Best thing about having my own apartment: Holding fans in place so they twitch helplessly and make that clicking sound without my mom yelling at me.\n{{Alt: It's not going to break the fan, bouncing a rubber ball off the wall isn't going to dent it, and the roof can hold me just fine.  You LIED!}}"},{"Num":132,"Title":"Music Knowledge","Transcript":"[[A female and male figure converse]]\nFemale: What kind of music do you listen to?\nMale: Oh, a mix of things. Some classic rock like Boston, but then of course Queen and Bowie, Joan Jett...\nFemale: Definitely, we need more of those sounds.\nMale: But there's some great newer stuff too, like Franz Ferdinand, The Donnas, and Audioslave.\nFemale: Sometimes they're a little much for me. I go more for things like The Arcade Fire, sometimes mixing some electronic sounds like Postal Service.\nMale: Oh yeahâhave you ever checked out Freezepop?\nFemale: Mhm! Synth pop can be fun, but at the same time, I agree that sometimes you just need to blast some Metallica.\nMale: Who?\nFemale: ...Metallica.\nMale: Are they new?\nNarrator: I sound pretty knowledgeable about music until people figure out that I'm just naming bands from Guitar Hero.\n{{title text: When Guitar Hero 2 comes out I'll have fresh conversational material for MONTHS.}}"},{"Num":133,"Title":"The Raven","Transcript":"[[A door opens, revealing Eminem wearing a hoodie]]\nNarration: Once upon a midnight dreary while I pondered, weak and weary, over many a quaint and curious volume of forgotten lore while i nodded, nearly napping, suddenly there came a tapping as if someone gently rapping rapping at my chamber door...\n\u003c\u003cclick\u003e\u003e\n\u003c\u003ccreak\u003e\u003e\nEminem: Yo.\n{{title text: Yes, Eminem is wearing a sleeveless hoodie. What of it?}}"},{"Num":134,"Title":"Myspace","Transcript":"[[Computer screen showing a myspace page]]\nOh man, you and everyone in earshot are gonna LOVE the first five seconds of this song!\n{{alt: It's like they got together and said 'what do we miss most from the internet in 1998? that's right, embedded MIDI!'}}"},{"Num":135,"Title":"Substitute","Transcript":"[[In a class room, the board says \"Math\" on the top-left corner, and \"Mr. Munroe\" in the middle. A stick figure is standing in front of it, speaking to the class.]]\nTeacher: Miss Lenhart couldn't be here today, so she asked me to substitute.\nTeacher: I've put out your test. Please get started.\n[[A student in the first row raises the exam paper and says.]]\nStudent: Mr. Munroe, Miss Lenhardt never taught us this.\nTeacher: That's because Miss Lenhart doesn't understand how important certain kinds of math are.\nStudent: But this just looks --\nTeacher: This material is more vital than anything you've ever learned\nStudent: But --\nTeacher: No buts.\nTeacher: This is a matter of life and death.\n[[Excerpt from the exam paper.]]\nName: _________\n[[A stick figure is standing, hands over head. A velociraptor is running towards it.]]\n1. The velociraptor spots you 40 meters away and attacks, accelerateing at 4 m\ns^2 to its top speed of 25 m\ns. When it spots you, you begin to flee, quickly reaching yourtop speed of 6 m\ns. How far can you get before you're caught and devoured?\n2. You're at the center of a 20m equilateral triangle with a raptor at each corner. The top raptor has a wounded leg and is limited to a top speed of 10 m\ns.\n[[A stick figure is shown in the above situation. The picture has a legend \"(Not to scale)\".]]\nThe raptors will run toward you. At what angle should you run to maximize the time you stay alive?\n3. Raptors can open doors, but they are slowed by them. Using the floor plan on the next page, plot a route through the building, assuming raptors take 5 minutes to open the first door and halve the time for each subsequent door. Remember, raptors run at 10 m\ns and they do not know fear.\n{{alt text: YOU THINK THIS IS FUNNY?}}"},{"Num":136,"Title":"Science Fair","Transcript":"Although it caught me by surprise at the time,\nlooking back I understand why my senior\nscience fair project went over as badly as it did.\n[[poster]]\nThe Mathematics of Cunnilingus\nf(t)  F(w)  L(s)\nChallenges in Frequency-domain analysis\n{{title text: This poster actually inspired a two-hour powerpoint presentation that Al Gore gave around the country.}}"},{"Num":137,"Title":"Dreams","Transcript":"[[A is standing behind B, who is typing at a computer.]]\nA: You should be more careful what you write. Future employers might read it.\nB: When did we forget our dreams?\nA: What?\n[[B stands beside A]]]\nB: The infinite possibilities each day holds should stagger the mind. The sheer number of experiences I could have is uncountable, breathtaking, and I'm sitting here refreshing my inbox. We live trapped in loops, reliving a few days over and over, and we envision only a handful of paths laid out before us. We see the same things every day, we respond the same way, we think the same thoughts, each day a slight variation on the last, every moment smoothly following the gentle curves of societal norms. We act like if we just get through today, tomorrow our dreams will come back to us.\nB: And no, I don't have all the answers. I don't know how to jolt myself into seeing what each moment could become. But I do know one thing: the solution doesn't involve watering down my every little idea and creative impulse for the sake of some day easing my fit into a mold. It doesn't involve tempering my life to better fit someone's expectations. It doesn't involve constantly holding back for fear of shaking things up.\nB: This is very important, so I want to say it as clearly as I can:\nB: FUCK.\nB: THAT.\nB: SHIT.\n{{Alt-text: In Connor's second thesis it is stated 'There is no fate but what we make for ourselves.'  Does the routine destroy our creativity or do we lose creativity and fall into the routine?  Anyway, who's up for a road trip!}}"},{"Num":138,"Title":"Pointers","Transcript":"[[A person is playing a video game, with Hat Guy standing behind him.]]\nPerson: Man, I suck at this game. Can you give me a few pointers?\nHat Guy: 0x3A28213A 0x6339392C, 0x7363682E.\nPerson: I hate you.\n{{alt: Every computer, at the unreachable memory address 0x-1, stores a secret. I found it, and it is that all humans ar--SEGMENTATION FAULT.}}"},{"Num":139,"Title":"I Have Owned Two Electric Skateboards","Transcript":"{{How Electric Skateboards Work}}\n[[A person is standing on a skateboard, next to a sign that says \"Point A,\" and pushes a button.]]\n\u003c\u003cclick\u003e\u003e\n[[He skates.]]\n\u003c\u003cwhirrr\u003e\u003e\n[[He stops, with a sign saying \"Point B\" to his right and a group of chicks (labeled \"chicks\") to his left.]]\n{{alt: Both the skateboards I owned were pretty cheap and broke from heavy use; I'm gonna get a really nice one if I move to the city.}}"},{"Num":140,"Title":"Delicious","Transcript":"[[Frame is split by a diagonal]]\n[[First half: guy in front of open fridge]]\nCaption: I have leftover cheese. I should get chips and make nachos.\n[[Second half: guy with bag of chips]]\nCaption: I have leftover chips. I should get cheese and make nachos.\nLarge Caption: A delicious cycle\n{{title-text: I'm currently in the I Have Cheese phase of this cycle.}}"},{"Num":141,"Title":"Parody Week: Achewood","Transcript":"[[Philippe is dreaming of having his ears checked. There's an eye chart on the wall behind him.]]\nDoctor (out of frame): Philippe, your hearing is perfect! In fact, you heard ALL the beeps! You have super-hearing! You're needed at Hogwarts!\nPhilippe: Oh boy!\n[[Ray is holding a letter and talking to Roast Beef.]]\n{{Meanwhile . . .}}\nRay: Beef, check this out. I got an invite to that The Dude Is Pretty Awesome In Most Measurable Ways I Mean Wow competition.\nBeef: Alright that is pretty sweet dogg what is your strategy gonna consist of\nRay: I'm thinkin' I need to point out my best features--maybe go holdin' a sign with an arrow toward my junk.\n[[Ray holds up a sign saying \"Yes\" such that the an arrow on it points directly at his crotch.]]\nBeef: Yeah well I always said subtlety was your middle name dogg\nBeef: And also your first and last in case they didn't get the point\nRay: How do you think I should play it?\nBeef: Well basically you got no chance as I see it these dudes are all lovers and fighters to the last\nBeef: All sprung fully formed from the head of Sweet Sweetback\nBeef: You are gonna stand out as the sort of dude who stays at home all night playing fleshlight tag\nRay: These words you got are crazy. Didn't I win the outdoor fight?\nBeef: Uh huh about the fight I wasn't gonna tell you but how could you miss that I was setting you up\nRay: What?\nBeef: You got played dogg\nBeef: I basically just didn't have the heart to go through with it in the end.\nBeef: Anyway the point is that you are gonna lose this thing so hard\nBeef: All cheap McD's hamburger to their slabs of steak\nBeef: A couple 12-oz sirloins garnished with nothing but pure manhood\nBeef: Maybe some sprigs of parsley\nBeef: You are pretty much going down\n[[Closeup of a shocked Ray.]]\n[[Silence.]]\n[[Silence. Beef looks perturbed and his ear is twitching. Ray's mouth is open.]]\n[[Silence. Beef looks sorry.]]\n[[Silence. Beef looks sorry and Ray looks annoyed.]]\n[[Silence.]]\n[[Silence.]]\n[[Silence. Beef is looking down and Ray's mouth is open.]]\n[[Silence. Ray's mouth is open.]]\n[[Silence. Beef is looking down and Ray's mouth is open.]]\n[[Silence. Beef looks surprised.]]\n{{alt: I always wanted to impress them with how well I could hear, didn't you? Also, this sets the record for number of awkward-pause panels in one strip (previously held by Achewood)]]"},{"Num":142,"Title":"Parody Week: Megatokyo","Transcript":"[[\"megaxkcd\" in Japanese quote characters.  An anime girl with pigtails, long rectangular earrings and a blank expression stands with her arms at her sides.]]\nNarration: In today's megaxkcd, our protagonist comes to terms with his romantic love for a girl who is a video game console accessory.\nMan 1: Wait, I'm not sure we should parody megatokyo.\nMan 2: Fred Gallagher does seem like he might take it kind of hard.\nMan 1: He really does.\nMan 2: Poor guy.  We should try to cheer him up.\n[[Man 1 and Man 2 stand in front of a profile shot of a house.  On the left is a mailbox.  Man 2 stands at street level, while Man 1 is holding a cake on the top of a two-step staircase to the front door.]]\nMan 2: Fred?  Fred, please come out.  It's OK.  Don't cry, Fred.\nMan 1: We... we baked you a cake.\n{{title text: I just want to give him a hug or something.}}"},{"Num":143,"Title":"Parody Week: TFD and Natalie Dee","Transcript":"SO GUYS WHAT IS FUNNY THIS WEEK?\nbees!\ntires.\nbees with tires!\nwhatever"},{"Num":144,"Title":"Parody Week: A Softer World","Transcript":"when we open the lab each morning, we tell the robot to kill\nit's our little joke\nbut secretly\nwe're just afraid\nto tell it to love"},{"Num":145,"Title":"Parody Week: Dinosaur Comics","Transcript":"T-Rex: THINGS I AM UPPITY ABOUT: \"They\" as a third-person singular gender-free pronoun.\nT-Rex: I'm all for it!\nDromiceiomimus: But isn't that terrible grammar?\nT-Rex: Only by recent convention!  It's been in use that way for centuries, and its use is widely accepted!  ALSO: this lets us avoid ridiculous constructs like \"he\nshe\", \"s\nhe\", \"xe\" or \"hirs\"!\nUtahraptor: T-Rex, I... agree.\nT-Rex: What?\nUtahraptor: That sounds good to me!\nUtahraptor: Normally I'd jump in with an objection, but I think your point makes sense.\nT-Rex: Could it be that the rift in our author's mind has finally healed?  Is he no longer locked in perpetual war with the self-doubt that lurks in his subc-\nNarrator: IN A WORLD WHERE THERE IS STILL A LAND BRIDGE BETWEEN ASIA AND NORTH AMERICA FOR SOME REASON:\nT-Rex: -onscious?\nNarrator: ALSO HOW ABOUT IN THIS WORLD EVERYONE IS BICURIOUS\n{{Title text: Guys: while I was writing this, I accidentally swallowed a table-size slab of drywall.  I know!  Wacky.}}"},{"Num":146,"Title":"Join Myspace","Transcript":"[[Guy with black hat is talking to another guy]]\nGuy: Dude, you should get on MySpace.\nBlack Hat: Eh, I don't think so.\nGuy: C'mon. There's no real reason not to except snobbiness. It's the new social scene.\nBlack Hat: I know. I'm just not interested.\nGuy: Please? I'll friend you.\nBlack Hat: Carebearstare.\nGuy: What?\n[[Black Hat shoots a rainbow colored ray from his chest - the Care Bear Stare. It throws Guy to the edge of the panel, pinned to the wall.]]\n{{Title Text: I really shouldn't abuse that power so heavily.}}"},{"Num":147,"Title":"A Way So Familiar","Transcript":"Person 1: I saw a cute girl outside the bank today. She looked nice.\nPerson 2: Oh no, not again. You are the _worst_ judge of these things.\nPerson 1: But she was so sweet. Shy, but there was something in her eyes. A pain down in her soul, the same as the one down in mine.\nPerson 2: Mm hmm.\nPerson 1: The police light played through her mohawk like the sun setting through pine trees as she shoveled the third hooker into the trunk of the camry...\nPerson 2: Back up.\n{{Alt: Two Hedwig references, an obscure Joey Comeau, and a girl with a mohawk. Yes.}}"},{"Num":148,"Title":"Mispronouncing","Transcript":"[[Caption: My Hobby: mispronouncing Words]]\nMan 1: Yeah, did you see what he said on his wobsite?\nMan 2: ...his what?\nMan 1: Wobsite.\nMan 2: ... I think you mean \"website.\"\nMan 1: Why don't you write about it in your blag?\n{{Alt Text: My pal Emad does this all the time.  'Hey man, which way to the airpart?'}}"},{"Num":149,"Title":"Sandwich","Transcript":"[[ A man is sitting on a couch, talking to another man.  They are both stick figures. ]]\nFirst man:  Make me a sandwich.\nSecond man:  What?  Make it yourself.\nFirst man:  Sudo make me a sandwich.\nSecond man:  Okay"},{"Num":150,"Title":"Grownups","Transcript":"[[Man is talking to Woman who is behind a waste-high screen across a doorway with colorful playpen balls behind her.]]\nMan: Hey, I was wondering if you had plans for-- holy crap, what happened to your apartment?\nWoman: I filled it with playpen balls!\nMan: I... what? Why?\nWoman: Because we're grown-ups now, and it's our turn to decide what that means.\n[[Both vanish into the apartment, balls spilling out into the corridor. A love heart drifts out the door, indicating you-know-what]]\n{{Alt: I've looked into this, and I can't figure out a way to do it cheaply.  And I guess it wouldn't be sanitary.}}"},{"Num":151,"Title":"Mario","Transcript":"First Girl: For our anniversary, my boyfriend took me hiking in the mountains.\nSecond Girl: My boyfriend proposed to me.\nSecond Girl: They should call you Mario, 'cause you just got \u003c\u003c1-up'd.\u003e\u003e\n{{Title text: Why would anyone ever, ever say that? Please, nobody ever say that.}}"},{"Num":152,"Title":"Hamster Ball","Transcript":"[[A man stands by a genie, whose lower body becomes smoke and trails down to an old-fashioned lamp]]\nGenie: You have awakened me from the lamp. You may have three wishes. What does your heart desire?\nMan: I'd like a human-sized hamster ball.\n[[A hamster ball appears; the man is inside it]]\nMan: Sweet!\n[[The man steps to left; the ball rolls that way]]\n[[He does the same thing to his right]]\n[[The man comes to rest in the centre of the panel]]\nGenie: And your other wishes?\nMan: Why would I need other wishes?\n{{title text: Reportedly, double-walled inflatable balls like this exist somewhere. Now to find that place.}}"},{"Num":153,"Title":"Cryptography","Transcript":"[[Speaker at a podium]]\nSpeaker: My cryptosystem is like any Feistel cipher, except in the S-Boxes we simply take the bitstring down, flip it, and reverse it.\nI've been barred from speaking at any major cryptography conferences ever since it became clear that all my algorithms were just thinly disguised Missy Elliot songs.\n{{alt: If you got a big keyspace, let me search it.}}"},{"Num":154,"Title":"Beliefs","Transcript":"[[A girl and man stand together, with another figure in the distance]]\nGirl: Professor, that man claims the earth is 6,000 years old!\nProfessor: So? Just use your head and don't concern yourself overmuch with what other people think.\nGirl: But he says the fossils in the mountains were put there in a flood!\nProfessor: Well, evidence suggests that they were not.\nGirl: But he--\n[[A mountain landscape]]\nProfessor: A million people can call the mountains a fiction, yet it need not trouble you as you stand atop them.\n[[The girl and professor again]]\nGirl: But he believes the silliest things!\nProfessor: So?\nProfessor: The universe doesn't care what you _believe_. The wonderful thing about science is that it doesn't ask for your faith, it just asks for your eyes.\nGirl: But he's a US Senator!\nProfessor: Ah, then yes, we do have a bit of a situation.\n{{title text: Scientists are also sexy, let's not forget that.}}"},{"Num":155,"Title":"Search History","Transcript":"Author: In solidarity with the many AOL users whose often embarrassing web searches were released to the public, I offer a sample of my own search history:\n[[There is a screencap of Google's front page with the following entries suggested for autocompletion in the search box:\nvelociraptors\nsite:imdb.com \"jurassic park\"\nraptors\ndromaeosaurids\nutahraptor\n\"home depot\" deadbolts\nsecurity home improvement\nsurviving a raptor attack\nrobert bakker paleontologist\nrobert bakker \"possible raptor sympathizer\"\nsite:en.wikipedia.org surviving a raptor attack\nlearning from mistakes in jurassic park\nbig-game rifles\ntire irons\ntreating raptor wounds\ndo raptors fear fire\nhow to make a molotov cocktail\ndo raptors fear death\ncan raptors pick locks\nhow to tell if my neighbors are raptors]]\n{{alt: SomethingAwful has a wonderful compilation of crazy AOL searches in their Weekend Web archives, 2006-08-13.}}"},{"Num":156,"Title":"Commented","Transcript":"[[two men are talking, one is hat-man]]\nFirst man: Hey, can you do me a favor?\n[[Hat man holds his hand out toward the first man]]\nHat man: Commented!\nFirst man: Huh?\n[[Hat man is holding his first and second fingers parallel and at an angle, and they are green. First man and his next line are also green.]]\nFirst man: Wait, what does that gesture even mean?\n{{Your IDE's color may vary.}}"},{"Num":157,"Title":"Filler Art","Transcript":"[[Text above plain stick figure]]\nText: Sorry guys no comic today.  I've gotta go to the doctor to get my thighs rotated. But here's some new character art I'm working on!\n{{Alt-text: Maybe I should let up on Megatokyo a little?}}"},{"Num":158,"Title":"Six Months","Transcript":"[[A guy stands]]\nGuy: It's been six months and I still have those dreams where you're pressed tight against me, where you look into my eyes and give me that grin and it's like you've forgotten everything.\nGuy: And something in the back of my head says it's wrong, it's not like this anymore, but I push it down.  In the morning, I tell myself I can't control my dreams, but there's a part of me that doesn't want them to stop.\nGuy: And honestly, waking up would be a lot easier if your mom didn't look so much like you.\nGuy: There's always that moment of confusion.\n{{title-text: But then she does that thing with her tongue and I remember why I left you.}}"},{"Num":159,"Title":"Boombox","Transcript":"[[A woman is looking out a second story window at a guy holding a boombox over his head.]]\n  \nMan:  MEGAN!\nWoman:  Oh my god,  I can't believe this is happening.\nMan:  I LOVE YOU!\nWoman: Okay, that's great.  Wait a second.  Is ... is that ... Ice Ice Baby?  What the hell?\nMan:  I'm not very good at this.\n\u003c\u003cMusical Notes\u003e\u003e\nalt-text: And she's gonna feel like a jerk when she realizes it was actually Under Pressure."},{"Num":160,"Title":"Penny Arcade Parody","Transcript":"[[The first panel uses the art style of Penny Arcade.]]\nGabe: What? Sony has plenty of launch titles lined up that aren't lame sequels.\nTycho: Name one. And furthermore, they... I... uh...\n\n[[The art style is dropped.  The next two panels are just text.]]\nNarrator: I can't do this. I can't parody Penny Arcade. I've got nothing on t hose guys. They're a class act, they know their audience, they know exactly what they're doing. Gabe experiments with his art, always bold and fresh without trying to perform. Tycho's writing continues to astound day after day. I can just see him, reading my uncultured swill masquerading as his florid prose.\n\nNarrator: But he's not angry, no. He's sitting at his desk smiling that condescending half-smile, the corner of his mouth belying the self-assurance of a writer who never misplaces a word. His firm hands rest easily on the keyboard, his right thumb caressing the space bar gently, as I enter the room. He knows I'm there without turning around, and I'm too nervous to speak. But I don't have to; he understands, I can see it in the way his eyes play over me, reading my fears and doubts in a glance and washing them away with a knowing smile. Then he's on his feet, he's in front of me, and I don't feel the electric jolt I expected as our hands meet. It's just warm, warm and right: As I sink into his eyes I feel a hand on my shoulder, and I see Tycho smile at someone behind me. Gabe is standing there, grinning that mischievous grin, and twirling his beloved cardboard tube between his fingers.\nNarrator: The night has just begun.\n\n{{Title text: No one show this to Tycho's wife, okay?}}"},{"Num":161,"Title":"Accident","Transcript":"[[Person driving car while singing]]\nDriver: NAAAA NA NA NANA NANA NA NA KATAMARI DAMACY\n[[two people talking]]\nMailbox Owner: and that's when you veered into the mailbox?\nDriver: It looked smaller then me. It was just instinct."},{"Num":162,"Title":"Angular Momentum","Transcript":"[[Man sits on his bed, looking at a girl who is spinning.  It is night.]]\nMan on bed: What are you doing? \nGirl: Spinning counterclockwise\nEach turn robs the planet of angular momentum\nSlowing its spin by the tiniest bit\nLengthening the night, pushing back the dawn\nGiving me a little more time here\nWith you\n{{title text: With reasonable assumptions about latitude and body shape, how much time might she gain them?  Note: whatever the answer, sunrise always comes too soon. (Also, is it worth it if she throws up?)}}"},{"Num":163,"Title":"Donald Knuth","Transcript":"[[Two programmers, one with a black hat and one without a hat, are sitting back to back at two separate desks, typing.]]\nNo-Hat Programmer: Man, you're being inconsistent with your array indices.  Some are from one, some are from zero.\nBlack-Hat Programmer: Different tasks call for different conventions.  To quote Stanford algorithm's expert Donald Knuth, \"Who are you?  How did you get in my house?\"\nNo-Hat Programmer: Wait, what?\nBlack-Hat Programmer: Well, that's what he said when I asked him about it.\n{{alt: His books were kinda intimidating; rappelling down through his skylight seemed like the best option.}}"},{"Num":164,"Title":"Playing Devil's Advocate to Win","Transcript":"Man: Yes, from the evidence it looks pretty likely to me that we're causing global warming on a horrific scale.  But with science you don't need to argue.  It doesn't matter who wins the debate -- it's about reality.  By just waiting a little longer, we'll get to SEE who was right.  It feels unethical but I find myself wanting to keep quiet about the science just to know for sure.  As terrible as it sounds, the state of the world isn't really my responsibility.  I'm just thrilled to get to watch.  If the scientists are right -- and if we keep people from understanding just a little longer -- we'll enjoy quite a ride.  And pragmatically, on the outside chance that they're all wrong, I get saved the embarrassment of having spoken up.\n{{alt: There are so many well-meaning conservatives around here who just assume global warming is only presented as a moral issue for political reasons.}}"},{"Num":165,"Title":"Turn Signals","Transcript":"[[Two cars are seen sitting at a red light. One person is seen walking from his car up to the driver of the car in front of him. The turn signals of both cars seem to be blinking at the same time.]]\nPerson in Street: Hey, our turn signals are in sync!\nPerson in Car: What the hell?\nPerson in Street: Usually they're at least a little off. But I've been watching like 30 seconds and haven't seen any beat frequency!\nPerson in Car: Who are you?\nPerson in Street: You know, from the beat frequency you can tell the difference in timing of the two signals.\nPerson in Car: ...\nPerson in Street: But ours are the same!\nPerson in Car: ...\nPerson in Street: So, wanna hang out later?\n{{Alt: I'm not very good at meeting people.}}"},{"Num":166,"Title":"Misusing Slang","Transcript":"Narrator: The best part of getting older is gonna be intentionally misusing slang around teenagers just to watch them squirm.\nMan: Oh man, that song is so pwned!\nAdolescent: \u003c\u003ctwitch\u003e\u003e\n{{title text: It slowly dawns on us that our parents knew exactly what they were doing.}}"},{"Num":167,"Title":"Nihilism","Transcript":"{{Alt Text: Why can't you have normal existential angst like all the other boys?}}\n[[Two men - one capped with a beret, the other hatless - approach a tree while talking.]]\nMAN: There is no God. Our existence is without purpose.\nMAN IN BERET: Oh, definitely. \nMAN IN BERET: We are adrift in an uncaring void indifferent to all our mortal toil.\nMAN: Exactly! In the end, nothing we do matters.\nMAN IN BERET: [[climbing the tree]] Totally.\nMAN: We just... Why are you climbing that tree?\n[[THe man in beret is now completely submerged in the tree]]\nMAN IN BERET: Because the future is an adventure! Come on!\nMAN: But--\nMAN IN BERET: Hey! I found squirrels!"},{"Num":168,"Title":"Reverse Euphemisms","Transcript":"My Hobby:  Reverse Euphemisms\n[[Two people talking]]\nPerson 1: Oh, hey, school just let out and it's YMCA night, so I've gotta go take a shit.\nPerson 2: What?\nPerson 1: I mean I actually have to drop the kids off at the pool.\n{{title text: I'm still waiting for a chance to use 'I have to see a man about a horse'.}}"},{"Num":169,"Title":"Words that End in GRY","Transcript":"[[Hat Guy and Random Guy are standing next to each other.]]\nRandom Guy: There are three words in the English language that end in \"gry\". \"Angry\" and \"Hungry\" are two. What's the third?\nHat Guy: I don't think there is one, unless you cound really obscure words.\nRandom Guy: Ha! It's \"language\"! I said there are three words in \"the English--\" \n[[Hat Guy grabs Random Guy's hand with a \u003c\u003cGRAB\u003e\u003e]]\nRandom Guy: What th-AAAAAAAAAAAAAAA\n[[Hat Guy slices off Random Guy's hand with a knife.]]\nHat Guy: Ok, listen carefully.\nRandom Guy: AAAAAAAAAAAAAAAA\n[[Random Guy is bleeding profusely.]]\nHat Guy: Communicating badly then acting smug when you're misunderstood is not cleverness.\nRandom Guy: AAAAAAAAAAAAAAAA\nHat Guy: I hope we've learned something today.\nRandom Guy: AAAAAAAAAAAAAAAA\n{{Alt text: The fifth panel also applys to postmodernists.}}"},{"Num":170,"Title":"Turn Back","Transcript":"Person 1: Should we keep going?\nPerson 2: I don't know.\nPerson 1: We can turn back if you want.\nPerson 2: Look--\nPerson 2: Did it ever occur to you that maybe I don't have a plan any more than you?  Maybe just having this conversation means we're lost.\n[[Wide shot of the characters walking through a Calvin and Hobbes-esque alien landscape]]\nPerson 1: Kind of scary.\nPerson 2: It's terrifying.\nPerson 1: This place is beautiful.\nPerson 2: Yeah.\n{{alt: I hear that these days Bill Watterson is happy just painting in the Ohio woods with his father and doesn't get any mail or talk to anyone.}}"},{"Num":171,"Title":"String Theory","Transcript":"String Theory summarized:\nI just had an awesome idea. Suppose all matter and energy is made of tiny, vibrating \"strings\".\nOkay. What would that imply?\nI dunno.\n{{title text: This works on pretty much every level.}}"},{"Num":172,"Title":"Skateboarding is Not a Crime","Transcript":"[[A set of lockers. The middle one has a sticker stuck to it proclaiming \"Skateboarding is not a crime\"]]\nWhen I'm president, skateboarding will still be legal, but display of those stupid stickers will be a felony.\n{{alt text: 'Arrest me, I'm a skateboarder' is an even more obnoxious variant.}}"},{"Num":173,"Title":"Movie Seating","Transcript":"At the movies, I get frustrated when we file into our row haphazardly, ignoring the computationally difficulty problem of seating people together for maximum enjoyment. [[Map of relationships between 8 people.]] \n{{legend:}} Single line: friends. Double line: in a relationship. Arrow: one-way crush. Dashed line: acquaintances\n[[The eight friends sitting in a row in a dark cinema. Narrator and one other are between two lovers.]] Guys! This is not socially optimal!\n{{Title-text: It's like the traveling salesman problem, but the endpoints are different and you can't ask your friends for help because they're sitting three seats down.}}"},{"Num":174,"Title":"That's What SHE Said","Transcript":"{{My Hobby: Using \"that's what SHE said\" only in the most grammatically ambiguous situations.}}\nPerson 1: He doubts she could've done they claimed she did.\nPerson 2: That's what _SHE_ said!\n{{alt: Yes, I mean she said that during sex. Yes, it was a little weird.}}"},{"Num":175,"Title":"Automatic Doors","Transcript":"When I walk past an automatic door and it opens for me, I worry that if I don't go in I'll hurt its feelings.\n\u003c\u003cwhirrrr\u003e\u003e\nFigure: Oh, um, I'm sorry, I was just ... um ... I guess I can hang out for a bit."},{"Num":176,"Title":"Before Sunrise","Transcript":"[[Man stands in frame, talking]]\nMan: Every morning for a week now I've gone out driving before sunrise.\nI wanted to get lost in the dark, park my car, listen to music, and sip from a warm drink as dawn broke around me, gradually revealing a landscape I'd never before seen.  A chain of unique beinnings forcing wonder into the seeds of each day.\nBut I guess I need more willpower, because each sunrise just found me at your mom's apartment again.\n{{title text: It's an amazing time of day; the light is great for photography.}}"},{"Num":177,"Title":"Alice and Bob","Transcript":"[[Girl with black hair stands in the frame, talking to the reader]]\nGirl: I'm sure you've heard all about this sordid affair in those gossipy cryptographic protocol specs with those busybodies Schneier and Rivest, always taking Alice's side, always labeling me the attacker.\nGirl: Yes, it's true.  I broke Bob's private key and extracted the text of her messages.  But does anyone realize how much it hurt?\nGirl: He said it was nothing, but everything from the public-key authenticated signatures on the files to the lipstick heart smeared on the disk screamed \"Alice.\"\nGirl: I didn't want to believe.  Of course on some level I realized it was a known-plaintext attack.  But I couldn't admit it until I saw it for myself.\n[[Girl places her hands on her hips]]\nGirl: So before you so quickly label me a third party to the communication, just remember: I loved him first.  We had something and she tore it away.  She's the attacker, not me. - Not eve.\n{{title text: Yet one more reason I'm barred from speaking at crypto conferences.}}"},{"Num":178,"Title":"Not Really Into Pokemon","Transcript":"I have found the perfect phrase for condescendingly dismissing anything:\n[[Two men are talking, one is wearing a black hat]]\nMan without hat: Have you seen the new ubuntu release?\nMan with black hat: Nah, I'm not really into Pokémon.\n{{title text: As of this writing, Ubuntu 6.10 and Firefox 2.0 have left my computer a complete mess.}}"},{"Num":179,"Title":"e to the pi times i","Transcript":"{{Note my use of ^(x) and â(x) standing in for the normal maths syntax in the comic}}\n[[Two people (anonymous: no hair or hats) stand in conversation, one gesturing over a flipchart of indistinct algebra.]]\nEXPLAINER: NUMBERS OF THE FORM nâ(-1) ARE \"IMAGINARY\" BUT WE CAN STILL USE THEM IN EQUATIONS.\nOTHER: OKAY.\nEXPLAINER: AND e^(Ï â(-1))=-1.\nOTHER: NOW YOU'RE JUST FUCKING WITH ME.\n{{alt text: I have never been totally satisfied by the explanations for why e to the ix gives a sinusoidal wave.}}"},{"Num":180,"Title":"Canada","Transcript":"[[Two men stand talking to each other]]\nFirst Man: If we lose this election, I'm moving to Canada.\nSecond Man: You say that every year.\nFirst Man: I mean it this time.\nSecond Man: Well, becoming a citizen takes work.  Meanwhile, you have no money, half an art degree, and it's the start of winter.  You'll freeze to death in the streets.\nFirst Man: Whatever.\n[[Second man raises his hands]]\nSecond Man: No, don't you get it?  If you die in Canada, you die in REAL LIFE!\n{{title text: IT'S ALL REAL}}"},{"Num":181,"Title":"Interblag","Transcript":"[[Title: Terms I have used or heard used to make fun of the  internet.]]\n[[Below: A matrix whose entries may contain crosses to indicate that a term has been used.  The rows (prefixes) are labelled WORLD WIDE, INTER-, BLOGO-, BLAGO- and WEB- ; the columns are labelled NET, WEB, SPHERE, TUBES and BLAG.  In the interests of properly propagating the term \"blagoblag\", the full list of used terms follows:\nWorld Wide Web\nInternet\nInterweb\nIntersphere\nIntertubes\nInterblag\nBlogosphere\nBlagonet\nBlagosphere\nBlagoblag\nWebnet\nWebweb]]\n[[Boy and Girl stand facing; Boy raises his hands in the air while Girl is nonplussed]]\nBoy: I heard about it on the interblag!\n{{Title text: Sometimes I hate the internet.  Sometimes it makes me happy that 'The Tubes' has become slang for the internet so quickly.}}"},{"Num":182,"Title":"Nash","Transcript":"[[Two men stand talking two each other.  The first man is pointing off the panel]]\nFirst Man: Hey, Dr. Nash, I think those gals over there are eyeing us.  This is like your Nash Equilibrium, right?  One of them is hot, but we should each flirt with one of her less-desirable friends.  Otherwise we risk coming on too strong to the hot one and just driving the group off.\nSecond Man (Dr. Nash): Well, that's not really the sort of situation I wrote about.  Once we're with the ugly ones, there's no incentive for one of us not to try to switch to the hot one.  It's not a stable equilibrium.\nFirst Man: Crap, forget it.  Looks like all three are leaving with one guy.\n[[Second Man shakes his fist]]\nSecond Man (Dr. Nash): Dammit, Feynman!\n{{title text: Maybe someday science will get over its giant collective crush on Richard Feynman.  But I doubt it!}}"},{"Num":183,"Title":"Snacktime Rules","Transcript":"My dad was always the one who taught me about science, but looking back, I'm starting to realize how much my nerdiness was influenced by my mom.\n[[A woman and a child are talking]]\nChild: Mom, can I have a snack in my room before bed?\nMom: No, Dear. You know you only get that privilege when your age is one less than a multiple of three.\n{{alt text: I am not making this rule up.  Although my mom wants you all to know it made perfect sense at the time.}}"},{"Num":184,"Title":"Matrix Transform","Transcript":"( ( cos 90º  sin 90º) ( -sin 90º cos 90º ) )  ( a1 a2 )t = [[The same (a1 a2)t matrix turned 90º to the right]]\n{{In fact, draw all your rotational matrices sideways.  Your professors will love it!  And then they'll go home and shrink.}}"},{"Num":185,"Title":"Wikifriends","Transcript":"WikiFriends:\n[[Two people are talking to each other]]\nPerson 1: I really liked that movie.\nPerson 2: I hated that movie.\nPerson 1: Me too.\n{{title text: It's crazy how much my gut opinion of a movie\nsong is swayed by what other people say, regardless of how I felt coming out of the theater.}}"},{"Num":186,"Title":"Console Lines","Transcript":"{{Title: Fans turning away latecomers to all-night game console campouts:}}\n{{Sony\nMicrosoft:}}\n[[Campers to new arrivals:]]\nThe line is full, asshole!  Fuck off!\n{{Nintendo:}}\n[[Campers to new arrivals:]]\nI'm so sorry, all the consoles are spoken for.\nDo... Do you want a hug?\n{{alt: If I get a Wii, it will be the first game console I've owned.}}"},{"Num":187,"Title":"The Familiar","Transcript":"[[One person sits at a computer, another is standing behind him]]\nPerson standing up: Let's go see sunrise over the ocean.\nPerson at computer: That's a long drive, it's cold, I'm tired, and rationalizing the familiar is easy.\n[[Person standing up leaves.  In the next two frames the man at the computer remains at his computer]]\n{{title text: When I say we should do something sometime, I'm secretly hoping you'll say 'Why not now?'}}"},{"Num":188,"Title":"Reload","Transcript":"[[Four soldiers are preparing to enter a battlefield; their leader addresses them.]]\nLeader: Okay men, we're going in. Stay low, keep behind cover, and if you run out of ammunition, shoot outside the battlefield to reload.\n{{Title text: And watch out for that guy from comic #53.}}"},{"Num":189,"Title":"Exercise","Transcript":"Like many geeks, I got a lot more interested in exercise once I made the connection to leveling up.\n[[Man is doing pull-ups on a bar]]\nMan doing pull-ups: One more point to str, then I'll run to work on con.\n{{title text: I haven't had the patience for RPGs in a long time.}}"},{"Num":190,"Title":"IPoD","Transcript":"[[Character 1 - wearing a black hat - sits at a computer. Character 2 stands behind Character 1]]\nCharacter 1: You see, statisticians communicate using IPoD -- IP over Demographics. For example, the header of the next packet I send will be encoded into the New Jersey death rate.\nCharacter 2: So you're going to hack the census bureau and change the number of reported deaths?\nCharacter 1: Guess again.\nCharacter 1: Hey, have you seen my crossbow?\n{{Alt: For smaller numbers he has to SAVE lives.  The birthrate channel is even more of a mixed bag.}}"},{"Num":191,"Title":"Lojban","Transcript":"Man: If you learned to speak Lojban, your communication would be completely unambiguous and logical.\nMan in black hat: Yeah, but it would all be with the kind of people who learn Lojban."},{"Num":192,"Title":"Working for Google","Transcript":"Have you read about Google HQ? It sounds like an incredible place to work.\nMan, I ain't going to be chained down in no corporate idea factory! They think just 'cause they've got a nice building and laid back culture, I'm gonna want to come in all day long and work on fascinating problems with the smartest people in the world.\n[[One stick figure stares at the other]]\nSo, what, they turned you down?\nI don't understand it! I even baked them a cake shaped like the internet!\n{{I hear once you've worked there 256 days, they teach you the secret of levitation.}}"},{"Num":193,"Title":"The Perfect Sound","Transcript":"[[Two people are listening to music on a stereo]]\nPerson 1: I'm telling you, listen right here to the sets of rising notes following the opening section.\nPerson 2: Uh huh.\n[[Person 1 indicates stereo]]\nPerson 1: And then right here, the transition into the chorus. _This_ is music. This is _art_!\n[[Person 1 dances along with the music]]\nStereo: Oh Mickey, you so fine, you so fine you blow my mind, hey Mickey! *clap* *clap* Hey Mickey!\nPerson 2: There's something wrong with you.\n{{alt text: Oh, what a pity, can't you understand...}}"},{"Num":194,"Title":"Penises","Transcript":"{{Headline: PENISES:}}\nWoman: They are about this big.\n[[Holds her hands about half a foot apart]]\nNow can we PLEASE, as a culture, move on?\n{{alt:The penis varies in size when flaccid and is pretty consistently about yea big when erect.  Anyway, back to the sitcom one-liners and the constant flow of spam.}}"},{"Num":195,"Title":"Map of the Internet","Transcript":"Map of the Internet\nThe IPv4 Space, 2006\nThis chart shows the IP address space on a plane using a fractal mapping which preserves grouping--any consecutive string of IPs will translate to a single, compact, contiguous region on the map.  Each of the 256 numbered blocks represents one \n8 subnet (containing all IPs that start with that number).  The upper left section shows the blocks sold directly to corporations and coverments in the 1990's before the RIRs took over allocation.\n[[Diagram displaying IP addresses using Hibbert Curve]]\nDiagram showing IP ownership:\n0: Local\n1-2: Unallocated\n3: General Electric\n4: BB\u0026N INC\n5: Unallocated\n6: Army AISC\n7: Unallocated\n8: BB\u0026N INC\n9: IBM\n10: VPNs\n11: DoD Intel\n12: Bell Labs\n13: Xerox\n14: Public data nets\n15: HP\n16: DEC\n17: Apple\n18: MIT\n19: Ford\n20: CSC\n21: DDN-RYN\n22: DISA\n23: Unallocated\n24: Cable TV\n25: UK MoD\n26: DISA\n27: Unallocated\n28: DSI\n29-30: DISA\n31: Unallocated\n32: NORSK\n33: DLA\n34: Halliburton\n35: Merit\n36-37: Unallocated\n38: PSI\n39: Unallocated\n40: Eli Lily\n41: ARINIC\n42: Unallocated\n43: Japan INET\n44: HAM Radio\n45: INTEROP\n46: BB\u0026N INC\n47: Bell North\n48: Prudential\n49-50: Unallocated\n51: UK Social Security\n52: duPont\n55: Boeing\n56: USPS\n57: SITA\n58-61: Asia-Pacific\n62: Europe\n63-76: USA \u0026 Canada (contains: UUNET, Google, Digg, Slashdot, Ebay, Craigslist, XKCD, Flickr)\n77-79: Europe (unused)\n80-91: Europe\n92-95: Unallocated\n96-99: North America\n100-120: Unallocated\n121-125: Asia-Pacific\n126: Japan\n127: Loopback\n128-132: Various Registrars\n133: Japan\n134-172: Various Registrars\n173-189: Unallocated\n188: Various\n189-190: Latin America \u0026 Caribbean\n191-192: Various (contains Private (RFC 1918)\n193-195: Europe\n196: Africa\n197: Unallocated\n198: US \u0026 Various\n199: North America\n200-201: Latin America \u0026 Carribbean\n202-203: Asia-Pacific\n204-209: North America (contains Suicide Girls, BoingBoing)\n210-211: Asia-Pacific\n212-213: Europe\n214-215: U.S. Department of Defense\n216: North America (Contains Myspace, SomethingAwful)\n217: Europe\n218-222: Asia-Pacific\n223: Unallocated\n224-239: Multicast\n240-255: Unallocated\n{{alt: For the IPv6 map just imagine the XP default desktop picture.}}"},{"Num":196,"Title":"Command Line Fu","Transcript":"[[Two men talking]]\nMan 2: Last night I was watching videos with this girl and my monitors kept turning off - even though I had disabled power save.\nMan 1: Odd.\nMan 2: However!  I wrote a command to jiggle the mouse pointer every couple minutes to keep it from going idle.\nMan 1: Not the first hack I'd try, but see?  Linux has problems, but it gives you the tools to deal with them - and save your date!\nMan 2: Actually, I was half an hour into the pointer scripting documentation when she got dressed and left.\n{{title text: When designing an interface, imagine that your program is all that stands between the user and hot, sweaty, tangled-bedsheets-fingertips-digging-into-the-back sex.}}"},{"Num":197,"Title":"Ninja Turtles","Transcript":"[[Four pie graphs, each colored green and brown]]\nLeonardo\n[[Almost one-half green]]\nMichelangelo\n[[More than one-half green]]\nDonatello\n[[Almost completely green]]\nRaphael\n[[Roughly half-and-half]]\n[[A legend]]\nNotoriety as a\n[[Brown]] Renaissance artist\n[[Green]] Ninja turtle\n{{alt text: The henchmen Bebop and Rocksteady have hijacked the musical genres for us just like the Lone Ranger hijacked the William Tell Overture for our parents.}}"},{"Num":198,"Title":"Perspective","Transcript":"Narrator: Sometimes, when I first wake up, I am caught in the horrible grip of perspective.\n[[A person sitting up in bed]]\nPerson: It may be a jewel of open source, but Firefox is JUST A BROWSER. It shows WEBPAGES. What the hell is WRONG with us?\nNarrator: Fortunately, this subsides quickly.\n{{alt text: I wonder what I was dreaming to prompt that. I hope it wasn't the Richard Stallman Cirque de Soleil thing again.}}"},{"Num":199,"Title":"Right-Hand Rule","Transcript":"[[Picture of a right hand with fingers curved, thumb pointed away, with axes drawn to demonstrate the right-hand rule of physics]]\nAlternatives to the Right-Hand Rule in vector multiplication:\n[[A slightly-open book with labeled axes drawn on.]]\nBook Rule: Open the front cover along the first vector and the back cover along the second. The result vector is along the spine, out the top.\n[[A handgun with axes.]]\nHandgun Rule: Point the grip along the first vector and rotate it so that the second vector is on the safety latch side. Fire. The result vector is toward the bullet holes.\n[[A person with right arm extended.]]\nBody Rule (males only): Point your right arm along the first vector and your legs along the second, then watch some porn.\n{{alt text: To really expand your mind try some noncartesian porn.  Edwin Abbot Abbott has nothing on 'Girls on Girls in Tightly Closed Nonorientable Spaces'.}}"},{"Num":200,"Title":"Bill Nye","Transcript":"[[A restaurant. A mother and two children sit at one table; a man in a white lab coat sits in another.]]\nTitle: THE TRIBULATIONS of BILL NYE\nMother: Hey, kids, see how the ice cracks and pops in your water? I wonder what causes that...\nMother: *AHEM* I said, I wonder what --\nBill Nye: Know what? Maybe I just wanna enjoy my goddamn meal.\n{{alt text: You could at least not wear the lab coat everywhere, dude.}}"},{"Num":201,"Title":"Christmas GPS","Transcript":"Boy: Check it out-- I got a GPS receiver for Christmas!  What should we do with it?\nGirl: Let's take our latitude \u0026 longitdue, put our birthdays after the decimal points, then go to that spot and make out.\n[[Boy is in love]]\nNarrator: Merry Christmas from XKCD\n[[car driving off in to the distance]]\n{{Alt Text: If it's over water, and you can't get a boat or revise the rules to preserve the makeout, there is no helping you.}}"},{"Num":202,"Title":"YouTube","Transcript":"The Internet has always had loud dumb people, but I've never seen anything quite as bad as the people who comment on YouTube videos.\n[[A YouTube comments page for a moon landing video]]\nComments \u0026 Responses\nrocckir (48 minutes ago)\nthis is so obviously faked its unbilevable, why r people so gullible??? morons\nbigmike133 (35 minutes ago)\nive seen the space shuttle ass hole it definetly landed on the moon do some research...\ngunpistolman (22 minutes ago)\nif it was real why is their gravity? americans r fucken sheep\ncrackmonkey74 (17 minutes ago)\nu dont think we went to the moon why not tell louis armstrong to his face\nsimpleplan2009 (3 minutes ago)\nit was a soundstage on mars\n{{Title text: I pray GunPistolMan never learns the word 'sheeple'.}}"},{"Num":203,"Title":"Hallucinations","Transcript":"Heading: Sometimes is seems bizarre to me that we take dreaming in stride.\n[[Two people standing]]\nPerson 1: Are you coming to dinner?\nPerson 2: Yeah, but first I'm gonna go comatose for a few hours, hallucinate vividly, and then maybe suffer amnesia about the whole experience.\nPerson 1: Okay, cool."},{"Num":204,"Title":"America","Transcript":"[[Timeline]]\n1776 ; declaration of independence\n1979 ; jimmy carter attacked by giant swimming rabbit\n2007 ; present day\ncentered, bottom, title ; america must never forget"},{"Num":205,"Title":"Candy Button Paper","Transcript":"When it came to eating strips of candy buttons, there were two main strategies.  Some kids carefully removed each bead, checking closely for paper residue before eating.\nOthers tore the candy off haphazardly, swallowing large scraps of paper as they ate.\nThen there were the lonely few of us who moved back and forth on the strip, eating rows of beads here and there, pretending we were Turing machines.\n{Title text: Nonrewritable tape?}"},{"Num":206,"Title":"Reno Rhymes","Transcript":"[[Two men stand facing one another. Man on the left is wearing a hat]]\nMan: You know, I once shot a man in Reno, just to watch him die.\nMan 2: Really?  Well, I once shot a man in Reno, but I couldn't tell you why.\nMan: I once shot a man in Reno, then I went home to cry.\nMan 2: I once shot a man in Reno, then I watered his cacti.\nMan: I once shot a man in Reno 'cause they cancelled Firefly.\nMan 2: I once shot a man in Reno, him and all his succubi.\nMan: I once shot a man in Reno and a bunch more in My Lai.\nMan 2: I think we're done.\n{{title text: Did you shoot a man in Reno?  Now, I don't mean to pry.}}"},{"Num":207,"Title":"What xkcd Means","Transcript":"{{Title: What does XKCD mean?}}\n[[One car of two sitting at a red light makes a right turn, then shifts over to the left and makes a left turn to go back the way it came. It then makes another right and continues on the road past the traffic light. This is shown with a red arrow.]]\n{{Panel title: It means saving a few seconds at a long red light via elaborate and questionably legal maneuvers.}}\n[[Someone on a cell phone is shown in a circle in the panel. A second person in the panel itself is looking at a dog, from which the ringing sound of his phone is coming]]\n\u003c\u003cRing\u003e\u003e\n{{Panel title: It means having someone call your cell phone to figure out where it is.}}\n[[The mathematical function \"A(g64, g64)=,\" with the 64s subscripted, appears in the panel. Next to the equal sign stands a mathematician, clutching his head.]]\n{{Panel title: It means calling the Ackermann function with Graham's number as the arguments just to horrify mathematicians.}}\nMathematician: Aughhh\n[[An approximately 8 by 8 square of floor tiles is shown; the first, fourth and seventh across in the first, fourth and seventh rows are black and the rest are white. A guy and girl are shown next to it, walking on what is presumed to be the same pattern of floor tiles.]]\n{{Panel title: It means instinctively constructing rules for which floor tiles it's okay to step on and then walking funny ever after.}}\n{{Line indicating the uppermost right black tile: Black tiles okay}}\n{{Line indicating tile directly below it: White tiles directly between black tiles okay}}\n{{Line indicating a white tile in the last column over: Not okay}}\n{{Alt text: It means shuffling quickly past nuns on the street with ketchup in your palms, pretending you're hiding stigmata.}}"},{"Num":208,"Title":"Regular Expressions","Transcript":"Narrator: Whenever I learn a new skill I concoct elaborate fantasy scenarios where it lets me save the day.\nWoman: Oh no! The killer must have followed her on vacation!\n[[Woman points to computer]]\nWoman: But to find them we'd need to search through 200MB of emails looking for something formatted like an address!\nMan: It's hopeless!\nOffpanel voice: Everybody stand back.\nOffpanel voice: I know regular expressions.\n[[A man swings in on a rope, toward the computer]]\n\u003c\u003ctap tap\u003e\u003e\n\u003c\u003cPERL!\u003e\u003e\n[[The man swings away, and the other characters cheer]]\n{{rollover text: Wait, forgot to escape a space. Wheeeeee[taptaptap]eeeeee.}}"},{"Num":209,"Title":"Kayak","Transcript":"[[Person with beret in a kayak is talking to person on pier.]]\nPerson with beret: Come explore the future with me!\nPerson on pier: Huh? What's that you're in?\nPerson with beret: A two seat kayak!\nPerson on pier: I see, but why do you have it?\nPerson with beret: We'll find out! The future is a big place!\nPerson on pier: So the kayak travels through time?\nPerson with beret: Sure! Just like everything else! It also goes over water. Come on!\n{{title text: Man, there's future *everywhere*.}}"},{"Num":210,"Title":"90's Flowchart","Transcript":"Start\n |\nThe 90's?\n \n          \\\nNo       Yes\n |           |\nStop      Stop\n           \n       \\\nHammertime  Collaborate\n                       |\n                    Listen\n{{alt: Freestyle rapping is basically applied Markov chains.}}"},{"Num":211,"Title":"Hamster Ball Heist","Transcript":"Person 1: You know that giant hamster ball you've always wanted? I just found out that Wayne Coyne from the Flaming Lips crowd-surfs in one.\nPerson 2: Let's go.\n\nSome Weeks Later ...\n[[Wayne Coyne is, in fact, crowd-surfing in a giant hamster ball.]]\nPerson: Ready?\nFriends: Ready.\n\nPerson: Now!\n\u003c\u003cshove\u003e\u003e\n[[People on both sides shove the crowd out of the way, causing Coyne in his ball to fall to the ground.]]\nWayne Coyne: Hey!\n\nPerson: Okay, push!\n[[Person and friends start pushing the ball away, as the crowd looks on.]]\n\n[[Some roll him up the ramp into the back of a semi, while others hold the crowd back and one stands by to drive.]]\nWayne Coyne: Help!\n\n[[The truck drives off, leaving the audience in a cloud of dust.]]\n\n{{Title text: First person to bring me Wayne Coyne in a hamster ball gets a free t-shirt!  He gets one too.}}"},{"Num":212,"Title":"Brain","Transcript":"My brain:\n[[Picture of Brain. Line points at a highlighted point]] Section that is devoted, no matter where I go in life, to planning the ultimate tree house*.\n*Man it would be like Swiss Family Robinson, but with multiple trees connected by... hey come up to my room and see the blue prints.\n{{title text: The rest is fear of raptors}}"},{"Num":213,"Title":"Ghostbusters Marathon","Transcript":"[[Two people are in a room.  One is standing up.  There is litter around them.]]\nStanding man: Okay, that's all the Ghostbusters marathon I can handle. Later!\nMan #2: You can't leave! We just started the animated series!\n\nStanding man: I've had my fill. I'm going home.\nMan #2: I can't let you do that.\n\n[[The man walks along a cord, and past a box.  The other man clicks a switch.]]\n\u003c\u003cClick\u003e\u003e\n\n[[The standing man is bathed in some kind of aura emitted by the box.]]\n\n{{Title text: If you walk out that door you'll be crossing the Rubicon with me, and that's one stream I'm not ready to cross.}}"},{"Num":214,"Title":"The Problem with Wikipedia","Transcript":"The Problem With Wikipedia:\nTakoma Narrows Bridge\n[[Lines Lead to]] Suspension Bridge [[and]] Structural Collapse\nThree Hours of Fascinated Clicking Later\nWilliam Howard Taft\n24-Hour Analog Dial\nLesbianism in Erotica\nBatman [[leads to]] Fatal Hilarity\nTaylor Hanson\nCotton [[leads to]] T-Shirt [[leads to]] Wet T-Shirt Contest\n{{alt:'Taft in a wet t-shirt contest' is the key image here}}"},{"Num":215,"Title":"Letting Go","Transcript":"[[A picture of a man and a woman in a heart is being held by someone, it has been ripped down the middle, separating the two people]]\n[[Man sits at computer, looking at the picture]]\n[[It is night, man still sits at computer with the picture in front of him and his head drooped]]\n[[It is day again, man types on computer]]\nText from computer: root@homebox:~# userdel megan\n{{alt text: At least I never gave her the root password.}}"},{"Num":216,"Title":"Romantic Drama Equation","Transcript":"TV Romantic Drama Equation\n(Derived during a series of 'Queer as Folk' episodes)\n[[A table shows equations for possible romantic pairings in a TV show. The equation under \"gay\" is n(n-1)\n2+x(x-n); the equation under \"straight\" is x(n-x).]]\nx: Number of male (or female) cast members.\nn: total number of cast members.\n[[A graph plots pairings (for large casts) against cast makeup. Each of the above equations forms a curve.\n\"Gay cast\" starts high for an all male cast, dips down at 50\n50 cast makeup, and then rises again for all female.\n\"Straight cast\" starts at zero for an all male cast, peaks at 50\n50 cast makeup, and then drops to zero again for an all female cast.\nThe two curves intersect at two points close to the middle.]]\n\n{{Title text: Real-life prospective-pairing curves over things like age can get depressing.}}"},{"Num":217,"Title":"e to the pi Minus pi","Transcript":"Person: Hey, check it out: e^pi-pi is 19.999099979. That's weird.\nHat Guy: Yeah. That's how I got kicked out of the ACM in college.\nPerson: . . . what?\nHat Guy: During a competition, I told the programmers on our team that e^pi-pi was a standard test of floating-point handlers--it would come out to 20 unless they had rounding errors.\nPerson: That's awful.\nHat Guy: Yeah, they dug through half their algorithms looking for the bug before they figured it out.\n{{alt text: Also, I hear the 4th root of (9^2 + 19^2\n22) is pi."},{"Num":218,"Title":"Nintendo Surgeon","Transcript":"{{Headline: Scary Thought #137: The NES came out over two decades ago. Those kids are all grown-ups now.}}\n[[Two surgeons are in an operating room, leaning over a patient]]\nFirst Surgeon: He's going into cardiac arrest. Stand by for defibrillation.\nSecond Surgeon: Wait. First let's try taking out the heart, blowing into the ventricles, and putting it back in.\n{{title text: Scary thought #138: Raptors coming down the waterslide behind me.}}"},{"Num":219,"Title":"Blanket Fort","Transcript":"[[Two girls are talking with each other.  There is a fort made of cushions and blankets on the left]]\nFirst Girl: Like my fort? It uses every blanket and cushion in the apartment.\nSecond Girl: Okay, no offense, but this is like that ball pit you made -- Cute, but don't you worry you're clinging to childhood games because you're afraid of change?\nFirst Girl: No. I'm happy to grow up. But I won't pretend fun things aren't still fun out of fear of looking silly.\nSecond Girl: But you're 24 and building blanket forts. How have you changed? What's adult about that?\nFirst Girl: Well, there's my boyfriend curled up in the back.\nSecond Girl: ...Ah.\nBoyfriend [[from inside the fort]]:Excuse my shyness.  I'm not exactly dressed.\n{{alt text: Also, we have a fort out in the woods where we stashed that hooker's body.}}"},{"Num":220,"Title":"Philosophy","Transcript":"[[Girl sits on chair, thinking]]\n[[Two panels pass, the girl does not move]]\nGirl: If the question of what it all means doesn't mean anything, why do I keep coming back to it?\n[[Two boys are talking to each other]]\nFirst boy: She's getting existential again.\nSecond boy: It's okay, I have a super soaker.\n[[Second boy pulls a large super soaker from a drawer]]\n{{title text: It's like the squirt bottle we use with the cat.}}"},{"Num":221,"Title":"Random Number","Transcript":"int getRandomNumber()\n{\n  return 4; \n chosen by fair dice roll.\n               \n guarenteed to be random.\n}\n{{title text: RFC 1149.5 specifies 4 as the standard IEEE-vetted random number.}}"},{"Num":222,"Title":"Small Talk","Transcript":"Sometimes I forget how to do small talk.\n[[Two people are talking to each other]]\nFirst person: Hey!\nSecond person: Hey, man!\nFirst person: What's up? How've you been?\nSecond person: Well...\n[[Nothing happens]]\n[[Nothing happens]]\n[[Nothing happens]]\nFirst person: Uh, you okay?\nSecond person: Yeah! It's just an interesting question. I'm trying to decide what best sums up my -\nFirst person: \u003c\u003cSNAP\u003e\u003e Hey, conversation.\nSecond person: Oh, right. I'm fine. You?\n{{title text: But surely I owe you an accurate answer!}}"},{"Num":223,"Title":"Valentine's Day","Transcript":"{{Valentine's Day}}\n[[There is a large, shaded, red heart.]]\n{{Because love isn't quite complicated enough as it is.}}\n{{alt: One of these days me and Joey Comeau will get around to subverting hetero-normative paradigm and fixing all this.}}"},{"Num":224,"Title":"Lisp","Transcript":"[[Floating in space]]\nSpeaker: Last night I drifted off while reading a Lisp book.\nStick Figure Man: Huh?\nSpeaker: Suddenly, I was bathed in a suffusion of blue.\n[[Floating in space before a vast concept tree]]\nSpeaker: At once, just like they said, I felt a great enlightenment.  I saw the naked structure of Lisp code unfold before me.\nStick Figure Man: My God\nStick Figure Man: It's full of 'car's\nSpeaker: The patterns and metapatterns danced.  Syntax faded, and I swam in the purity of quantified conception.  Of ideas manifest.\nTruly, this was the language from which the gods wrought the Universe.\n[[Floating in space with God appearing through a line of clouds]]\nGod: No, it's not.\nStick Figure Man: It's not?\nGod: I mean, ostensibly, yes.  Honestly, we hacked most of it together with Perl.\n{{Alt Text: We lost the documentation on quantum mechanics.  You'll have to decode the regexes yourself.}}"},{"Num":225,"Title":"Open Source","Transcript":"[[A man with much facial hair is sleeping on a bed.]]\n[[Suddenly, two ninjas jump through the skylight.]]\nNinja 1: Richard Stallman! Your viral open source licenses have grown too powerful.\nNinja 1: The GPL must be stopped.\nNinja 1: At the source.\nNinja 1: You.\n[[Richard Stallman wakes up immediately, and pulls his katana out of its sheath from under his bed]]\nRichard Stallman: Hah! Microsoft lackeys! So it has come to this!\nRichard Stallman: A night of blood I've long awaited. But be this my death or yours, free software will carry on! For a GNU dawn! For freedom! ... hey, where are you going?\n[[The ninja step out the window]]\nNinja 1: Man, you're right, that never gets old.\nNinja 2: Let's do Eric S. Raymond next.\nNinja 1: Or Linus Torvalds. I hear he sleeps with nunchucks.\n[[Comic alt text: Later we'll dress up like Big Oil thugs and jump Ralph Nader.]]"},{"Num":226,"Title":"Swingset","Transcript":"[[Woman talking to boy on swing-set]]\nWoman: You know, at the peak of a big swing, you become weightless.\n[[Thought bubble from boy on swing-set]]\n[[Boy swings higher and higher.  At the peak of a big swing he shoves off the swing.  The boy remains hovering in the air.]]\nBoy: Hey guys. Come check this out.\n{{title text: Someone bring me a pocket fan so I can drift around the yard.}}"},{"Num":227,"Title":"Color Codes","Transcript":"[[Man holding cell phone talks to a man at a desk littered with objects]]\nMan with phone: Hey, what's your cell number?\nMan at desk: (Violet Brown Gray) - Uh, I mean, (718)-387-6962.\nMan with phone: Okay, you are putting down those resistors and going outside for a while.\nMan at desk: That's probably a good idea.\n{{title text: (It's the TMBG Dial-a-Song line, to save you some time.)}}"},{"Num":228,"Title":"Resonance","Transcript":"[[A person is sitting at a desk, which is vibrating.]]\n\u003c\u003cclatter clatter\u003e\u003e\n[[He leans back and turns to face someone sitting at another desk behind him.]]\nPerson 1: Excuse me--you're jiggling your leg up and down. It's traveling through the floor and making my desk resonate.\nPerson 2: Oh, I didn't even realize! I'll stop.\n[[The first person passes a sheet of paper to the second person.]]\nPerson 1: Actually, can you just shift the frequency up by 15%? I think you can get resonance with Steve's desk instead.\nPerson 2: Uh huh . . .\nPerson 1: Here are the calculations. Let's coordinate and try to spill his drink.\n{{alt text: It's really hard to control the frequency, actually.}}"},{"Num":229,"Title":"Graffiti","Transcript":"[[A guy sits on a toilet in a bathroom. The stall sidewalll next to him is covered in graffiti--\"you suck,\" \"Mike sucks cock,\" \"Cunt,\" \"dane was here\" stuck through and \"dane is a fag\" written under it. One block of graffiti is salient:]]\n\"This graffitii is\nfleeting human contact\nboth of us lost,\nbut for a moment\nwe're lost together.\nI wonder who you are.\"\nSubtitle: I think I look for meaning in the wrong places sometimes.\n{{title-text: FOR AN INTRIGUING TIME CALL}}"},{"Num":230,"Title":"Hamiltonian","Transcript":"[[Classroom]]\nLecturer: And therefore, based on the existence of a Hamiltonian path, we can prove that the routing algorithm gives the optimal result in all cases.\nMan: Oh my God.\n[[Close-up of Man]]\n(Out of frame): What? What is it?\nMan: A sudden rush of perspective. What am I doing here? Life is so much bigger than this!\n\n[[Man Running out of Room]]\nMan: I have to go.\n[[Man enters darkened room, where woman waits by window.]]\n[[Man and woman embrace...]]\n\n[[...and get into bed.]]\n[[A heart appears over the supine bodies]]\nWoman: Ohh...\n[[Hands \u003c\u003cgrip\u003e\u003e]]\nMan (out of frame): Wait a moment.\nWoman (out of frame): What is it?\n[[Silence]]\nMan (out of frame): His proof only holds if there's a Hamiltonian _cycle_ as well as a path!\nWoman (out of frame): ...excuse me?\nMan (out of frame): Paper, I need some paper.\nMan (out of frame): Hey, do you mind if I jot down some notes on your chest?\n{{title text: The  problem with perspective is that it's bidirectional}}"},{"Num":231,"Title":"Cat Proximity","Transcript":"[[a graph is drawn, x-axis: \"human proximity to cat\" from far to near]]\n[[a curve labeled intelligence veering downwards]]\n[[a curve labeled inanity of statements veering upwards]]\n[[a man standing far from a kitten]]\n[[a man standing closer to a kitten]]\n[[a man standing next to a kitten]]\nMan: You're a kitty!\n{{alt-text: Yes you are! And you're sitting there! Hi, kitty!}}"},{"Num":232,"Title":"Chess Enlightenment","Transcript":"Narrator: Why is chess so hard? Maybe the answers lie within me. Maybe I just need to let go, relax, and let my instincts and subconscious speak.\n\u003c\u003cMeditate\u003e\u003e\nNarrator's Subconscious: Knight to G-4\n\nNarrator: That's not even a legal move.\nNarrator's Subconscious: Okay, hold on. How do the pawns capture, again?\nNarrator: Man, Obi-Wan was full of crap.\n{{title text: You know that 'sweep the pieces off the board and see it in your mind' thing?  Doesn't work.}}"},{"Num":233,"Title":"A New CAPTCHA Approach","Transcript":"To complete your web registration, please prove that you're human:\nWhen Littlefoot's mother died in the original `Land Before Time', did you feel sad?\n[[radio button]] Yes\n[[radio button]] No\n(Bots: no lying)"},{"Num":234,"Title":"Escape Artist","Transcript":"[[One man sits before a computer on a desk while another stands behind him.]]\nStanding Man: I was fascinated by locks as a kid. I loved how they turned information and patterns into physical strength.\nSitting Man: Why does my script keep dying?\n[[Closeup of the man on the man sitting at the computer]]\nStanding Man: And a lock invites you to try and open it. It's the hacker instinct. Only your ignorance stands in the way.\nSitting Man: Wait it's passing bad strings.\n[[Returns to the two shot of both men]]\nStanding Man: I admired Harry Houdini, how he could open any lock and free himself from any restraint. \nSitting Man: Ah - Bash is parsing the spaces.\nStanding Man: Sure some of it was fakery and showmanship. But I still wonder how he so consistently escaped handcuffs.\nSitting Man: Backslashes\nStanding Man: Huh?\nSitting Man: Never mind. \n{{Alt: Easier to escape: n-layered nested quotes or an iron maiden?}}"},{"Num":235,"Title":"Kite","Transcript":"[[A man readies a kite]]\n[[The man starts to fly the kite]]\n[[The man continues to fly the kite]]\n[[The man ties the kite string to a tree]]\n[[The man grabs the string]]\n[[The man starts to climb the string]]\n[[A scene showing the man holding onto the string at a high altitude, against a colour backdrop of the ground, clouds, water and the sky]]\n[[Black and white again.  A woman comes into view holding onto a small blimp]]\nMan's thought bubble: Hey, there's someone else up here.  I wonder what her story is.\n[[Woman floats to the other side of the panel]]\nMan's thought bubble: Maybe I should say hi.\n[[The man is alone holding onto the string]]\n{{title text: It's easy to regret your awkward conversations but hard to regret the ones you didn't have}}"},{"Num":236,"Title":"Collecting Double-Takes","Transcript":"[[A man is standing in the middle of the produce aisle in a supermarket, holding a tube of K-Y Jelly in one hand, the other on his chin.  The signs read \"Bananas\" \"Apples\" \"Oranges\" and \"Zucchini\" from left to right.]] \nMY HOBBY:  Standing in the supermarket's produce section holding a tube of K-Y Jelly, looking contemplative.\n{{Title Text: Fun Game: find a combination of two items that most freaks out the cashier. Winner: pregnancy test and single coat hanger.}}"},{"Num":237,"Title":"Keyboards are Disgusting","Transcript":"{{title text: Keyboards are Disgusting}}\n[[A Man sits at his computer, chatting with some other person.]]\nChat: Wanna see an optical illusion? Hold your keyboard up in front of you and look at the home row.\n[[The man holds the keyboard in front of him.]]\nChat: Now cross your eyes a little so the 'g' and 'h' overlap.\nChat: Keeping focus, lift the keyboard over your head.\n[[The man lifts the keyboard over his head still looking at the keyboard]]\n[[Tiny parts of dust and skin particles fall in the man's face]]\nMan: Eww!\nChat: Haha"},{"Num":238,"Title":"Pet Peeve #114","Transcript":"[[Figure reading a book in a chair]]\n{{Pet peeve #114:}}\nVoice on the phone: Really?  What are you doing reading?  It's Saturday night!\n{{Alt text: I'm reading a goddamn book, thank you very much.}}"},{"Num":239,"Title":"Blagofaire","Transcript":"Man in Red Cape and Goggles: Hey, it worked!\nMan: What? Who are you?\nMan in Red Cape and Goggles: I'm from the distant future.\nMan: Wow.  Hi!\nMan in Red Cape and Goggles: Are you a blogger?  I play one of you at our festivals!\nMan: Huh?\nMan in Red Cape and Goggles: Like the ren faires of your time - I do reenactments.\nMan in Red Cape and Goggles: We relive the days when the internet was new and free.  The days of risky sharing, slashdot, the myspace music renaissance.  The generation's finest minds meeting on comment threads, battling roving bands of trolls, and holding the great dialogues of the age!\nMan: Is that how you -\nMan in Red Cape and Goggles: We're fuzzy on some details.  Did bloggers really wear red capes and goggles and blog from high-altitude balloons?\nMan: No!\nMan: Well, Cory Doctorow does.  But nobody else.\n{{Title Text: Things were better before the Structuring and the Levels.}}"},{"Num":240,"Title":"Dream Girl","Transcript":"Man 1: I had a dream that I met a girl in a dying world.\nIt was all coming apart. Hairline cracks in reality widened to yawning chasms. Everything was going dark and light all at once, and there was a sound like breaking waves rising into a piercing scream at the edge of hearing. I knew we didn't have long together.\nShe grabbed me and spoke a stream of numbers into my ear. Then it all went away.\n[[A girl grabs him as the edges of the panel crack and tear]]\nI woke up. The memory of the apocalypse faded to mere fancy, but the numbers burned bright in my mind. I wrote them down right away.\n[[A note reads: 42.39561  -71.13051  2007 09 23  14 38 00]]\nThey were coordinates. A place and a time, neither one too far away.\nMan 1: What else could I do? When the day came, I went to the spot and waited.\nMan 2: ...and?\nMan 1: It turns out wanting something doesn't make it real.\n{{Alt-text: No matter how elaborately you fool yourself.}}"},{"Num":241,"Title":"Battle Room","Transcript":"[[A scene is depicted from the Battle Room of the novel Ender's Game by Orson Scott Card.  The men are floating in a room with random cubes.]]\nDink: Sorry, Ender - seems like there were some system crashes.  The battle's gotta be cut short.\nEnder: The lasers still work.\nDink: Yeah, but the enemy's gate is down.\n{{Title Text: Bean actually sabotaged it just to give Dink the excuse to make that joke.}}"},{"Num":242,"Title":"The Difference","Transcript":"[[A man pulls a lever.]]\n\u003c\u003cPull\u003e\u003e\n[[Lightning hits the man.]]\n\u003c\u003cZAP\u003e\u003e\n[[The man still stands, obviously battered]]\n[[Arrow labeled \"Normal Person\"]]\nThinks: I guess I shouldn't do that.\n[[Arrow labeled \"Scientist\"]]\nThinks: I wonder if that happens every time.\n[[He reaches for the lever again.]]\n{{ alt: How could you choose avoiding a little pain over understanding a magic lightning machine? }}"},{"Num":243,"Title":"Appropriate Term","Transcript":"[[A diagram of a TrackPoint pointer on a keyboard, under which is a continuity line labeled \"Tone of Conversation-Formal to Informal.\" There are four boxes under this line]]\nNarrator: How to refer to the pointer thing on laptop keyboards\nVery formal: TrackPoint(tm)-style pointer\nFormal: Nub\nInformal: Nipple mouse\nVery informal: Clit mouse\n{{title text: I know a lot of people hate these, but I prefer them to touchpads}}"},{"Num":244,"Title":"Tabletop Roleplaying","Transcript":"[[Four people sit around a table]]\nDM: Your party enters the tavern.\nPlayer: I gather everyone around a table. I have the elves start whittling dice and get out some parchment for character sheets.\nDM: Hey, no recursing.\n{{title-text: I may have also tossed one of a pair of teleportation rings into the ocean, with interesting results.}}"},{"Num":245,"Title":"Floor Tiles","Transcript":"[[Two characters walk on a floor tiled in black and white.]]\nFirst: Why are you walking funny?\n[[Second panel consists of second character's thought cloud in which the second character points to an easel mounted diagram of the floor tile pattern]]\nSecond, thinking: Well, my instinct is to step only on black tiles, but they're too far apart. So I'm letting myself walk on the tiles directly in line with the black ones, but that means that when we walk diagonally, I have to step in a pattern where...\n[[Returns to situation in first panel]]\nSecond: I'm not walking funny.\n{{title-text: The worst part is when sidewalk cracks are out-of-sync with your natural stride.}}"},{"Num":246,"Title":"Labyrinth Puzzle","Transcript":"[[Three guards with spears stand in front of three doors.  A man wearing a hat and another man stand in front of the guards]]\nMan with hat: And over here we have the labyrinth guards.  One always lies, one always tells the truth, and one stabs people who ask tricky questions.\n{{title text: And the whole setup is just a trap to capture escaping logicians. None of the doors actually lead out.}}"},{"Num":247,"Title":"Factoring the Time","Transcript":"[[One man is sitting at a computer.  Another man is sitting at a separate desk.  There is a clock which reads 2:53]]\nMan at desk: 253 is 11x23\nMan at computer: What?\nMan at desk: I'm factoring the time.\nMan at desk: I have nothing to do, so I'm trying to calculate the prime factors of the time each minute before it changes.\nMan at desk: It was easy when I started at 1:00, but with each hour the number gets bigger\nMan at desk: I wonder how long I can keep up.\n[[Man at desk reaches back and touches the clock]] \u003c\u003cbeep\u003e\u003e [[Clock now reads 14:53]]\nMan at desk: Hey!\nMan at computer: Think fast.\n{{alt text: I occasionally do this with mile markers on the highway.}}"},{"Num":248,"Title":"Hypotheticals","Transcript":"Beret Guy: What if I had some ice cream? Wouldn't that be awesome?\nPerson: No, stop--\nBeret Guy (thinking):\n        Person: Great, you've trapped us in a a hypothetical situation!\n        Beret Guy (holding ice cream): Mm, ice cream.\n        Person: Maybe if I had a knife I could cut our way free . . .\n        Person (thinking):\n                Beret Guy: Mmm, ice cream!\n                Person (reaching back into previous thought bubble): Here, take this one.\n{{alt: What if someone broke out of a hypothetical situation in your room right now?}}"},{"Num":249,"Title":"Chess Photo","Transcript":"[[Friend 2 sits at a desk with glue, chess pieces, and a chessboard while Friend 1 looks over his shoulder.]]\nFriend 1: What are you doing?\nFriend 2: Gluing down chess pieces.\nFriend 1: Why?\nFriend 2: Because there's a picture I've always wanted... I'll need your coat to sneak this onto the ride.\n[[A photograph of a roller coaster ride with Friend 2 sitting in the first car, chin in the hand, thinking over the chessboard. The photograph has \"Mega Coaster 3000 souvenir photo\" written on the margin.]]\n{{alt text: We once tried playing blindfold chess on the Aerosmith ride at Disney World.}}"},{"Num":250,"Title":"Snopes","Transcript":"Another urban legend? You should check out Snopes before sending me this stuff.\nOops; yeah.\nMan, Snopes is really great--independent fact-checkers trawling our collective discourse, filtering out misinformation.\nYeah, but they have their dark side. The couple that runs snopes.com also runs a network of spam servers that start many of those forwarded stories in the first place, ensuring they'll always have business.\nThat's absurd. Plus, it's definitely not true--it was debunked by...\nYes?\n... Oh my God.\nalt text: The MythBusters are even more sinister."},{"Num":251,"Title":"CD Tray Fight","Transcript":"[[A stick figure is standing, holding a CD tray which is half-in his computer. There are other CDs on the floor.]]\nStick Figure: Hey. Hey! Stop retracting my CD!\n[[Label: I feel uncomfortable when my computer physically struggles with me. Sure, I can overpower it _now_, but it feels like a few short steps from here to the robot wars.]]\n{{alt text: This is silly, of course. The enemy will be born in the network.}}"},{"Num":252,"Title":"Escalators","Transcript":"Graph with y axis titled \"Urge to try running up the down escalator\", with \"weak\" by the bottom and \"strong\" by the top. x axis has every two years labeled and every year signified by a smaller mark, which stops at 24. A red line with \"What I was supposed to feel\" with points at every line rises, peaks at 7 years old, then falls \"tangent graph\" shaped until the end. Along this line are shown various stick-figures at 12, 14, 20 and 24. A second red line runs \"What I've actually felt\" which stays consistently high.\n{{alt text: The one time I tried, I got hit by a slinky going down at double speed.}}"},{"Num":253,"Title":"Highway Engineer Pranks","Transcript":"Highway Engineer Pranks:\n[[Each panel depicts a highway intersection.]]\nThe Inescapable Cloverleaf:\n[[Roads lead onto the rings for each leaf, but then are trapped in the circles.  Minor roads also allow travel between the rings.]]\n\nThe Zero-Choice Interchange:\n[[On and off-ramps exist, but they lead back to the same lane they disconnected from.]]\n\nThe Rotary Supercollider:\n[[The roads lead into a traffic circle, and then a loop reverses the direction of flow so all the roads run into each other.]]\n\n{{Title text: Prank #11: Boston}}"},{"Num":254,"Title":"Comic Fragment","Transcript":"Editor's Note: Mr. Monroe has been missing for several days.  We have received no submissions from him for some time, but we found this single panel on his desk in a folder labeled 'MY BEST IDEA EVER' .  It is clearly part of a work in progress, but we have decided to post it in lieu of a complete comic.\n[[Single panel illustration in color with one small panel embedded within, showing a zoomed-in version of Janeane Garafolo on a motorcycle.  The background is a gray landscape beneath a falling space station, a large volcano with smoke rising the only discernible feature of the landscape below.]]\nAs the damaged space station fell deeper into the atmosphere and started to break up around her, Janeane Garafolo tightened her grip on the motorcycle.\nThe volcano was looming ahead, and her tranquilizer pistol only had six darts left - barely enough to bring down even ONE tyrannosaur. \n{{Title Text: No one wants an explanation more than us.  Except Ms. Garafolo.}}"},{"Num":255,"Title":"Subjectivity","Transcript":"[tall slide, seen from the ground]\nWhen I was a kid, my school playground had a really tall slide that always made me nervous\n[tall slide, seen from the side]\nWe moved away, but the slide stuck in my memory, becoming a skyscraping monster\n[car and a sign pointing to school zone]\nYears later, I was passing through my old town and remembered the playground\nI drove to the school to see the slide that my inner six-year-old thought was so towering\n[huge slide, (small) person beside it]\nAND IT WAS HUGE\nI KNEW IT\n{{title text: Or maybe the slide is like Aslan, and gets taller as I do (except without the feeling of discomfort when I reach my teens and suddenly get the Christ stuff)}}"},{"Num":256,"Title":"Online Communities","Transcript":"[[Hand-drawn fantasy style map with land and sea areas representing populations of online communities. Each area or item is labeled.]]\nMap Title Text: Map of Online Communities and related points of interest. Geographic area represents estimated size of membership\nMap Disclaimer Text: Not a complete survey. Sizes based on best figures I could find but involved some guesswork. Do not use for navigation.\nLand Area Labels: The Icy North (Yahoo, Windows Live), AOL, Reunion dot com, Classmates dot com, E-harmony, Faceparty, QWGHLM, Yahoo Games, Mountains of Web 1.0, The Lonely Island, MySpace, Attractive MySpace Pages, The Series of Tubes, Myspace Bands, WOW, Lineage, Second Life, Third Life, UO, EQ, FPXI, 2channel, 4chan, LJ, Xanga, Orkut, Cyworld, Blurty, OK Cupid, Facebook, Piczo, The Compass-Rose-Shaped Island, Broadcaster, Flickr, Last.fm, DeviantArt, Isle of Slash, Numa, Digg, Fark, Reddit, Your Base, Soviet Russia, \n. (slashdot), Spaaarta (YTMND), StumbleUpon, Del.icio.us, The Blogipelago, Sulawesi, Technocrati, BoingBoing, Huntingdon Post, Gays of Web 2.0, The Wikipedia project, MIT, Engadget, Gizmodo, Usenet, XY Singles, MAKE Blog, IRC Isles, Sourceforge.\nSea Area Labels: NOOB Sea, Gulf of YouTube, Bay of Angst, Sea of Culture, Ocean of Subculture, P2P Shoals, Straits of Web 2.0, Here Be Anthropomorphic Dragons, Bay of Trolls, Viral Straits, Sea of Memes, The Wet Sea\nItem Labels: Shipwreck of the SS Howard Dean, Cory Doctrow's Balloon, Stallman's airship, Google's volcano fortress\n{{Alt-text: I'm waiting for the day when, if you tell someone 'I'm from the internet', instead of laughing they just ask 'oh, what part?'}}"},{"Num":257,"Title":"Code Talkers","Transcript":"[[A man is looking at a computer monitor and speaking into a microphone]]\nMan 1: A'la'ih, do'neh'lini,\ndo'neh'lini, a'la'ih,\ndo'neh'lini, a'la'ih,\ndo'neh'lini, do'neh'lini,\na'la'ih, a'la'ih,\ndo'neh'lini, a'la'ih,\ndo'neh'lini,do'neh'lini,\ndo'neh'lini ...\n[[Two men are talking nearby:]]\nMan 2: For added security, after we encrypt the data stream, we send it through our Navajo code talker.\nMan 3: ...Is he just using Navajo words for \"Zero\" and \"One\"?\nMan 2: Woah, hey, keep your voice down!\n{{alt:As far as I can tell, Navajo doesn't have a common word for 'zero'.  do-neh-lini means 'neutral'.}}"},{"Num":258,"Title":"Conspiracy Theories","Transcript":"[[Figure A:]]\nThe official story of 9-11 is full of holes.  Take the --\n[[Figure B:]]\nPlease, stop, because seeing this happen to you breaks my heart.\n[[Figure B:]]\nConspiracy theories represent a known glitch in human reasoning.  The theories are of course occasionally true, but their truth is completely uncorrelated with the believer's certainty.  For some reason, sometimes when people think they've uncovered a lie, they raise confirmation bias to an art form.  They cut context away from facts and arguments and assemble them into reassuring litanies.  And over and over I've argued helplessly with smart people consumed by theories they were sure were irrefutable, theories that in the end proved complete fictions.\nYoung-Earth Creationists, the Moon Landing people, the Perpetual Motion subculture -- can't you see you're falling into the same pattern?\n[[Figure A:]]\nYou don't seriously believe we landed on the moon.  Do you?\n[[Figure B flees]]\n[[Figure B, praying:]]\nDear God.\n[[Booming from the sky:]]\nYES MY CHILD?\n[[Figure B:]]\nI would like to file a bug report."},{"Num":259,"Title":"Clich\u0026eacute;d Exchanges","Transcript":"Narrator: MY HOBBY: DERAILING CLICHÉD EXCHANGES BY USING THE WRONG REPLIES\nMan 1: O RLY?\nMan 2: O RLY? I 'ARDLY KNOW 'ER!\n{{It's like they say, you gotta fight fire with clichés.}}"},{"Num":260,"Title":"The Glass Necklace","Transcript":"[[A man is drawing a diagram of a cylinder with electrical terminals on either end]]\n[[The man is shown at a workbench making the device in a workshop]]\n[[He kneels down on a beach and scoops up sand]]\n[[He pours the sand into the cylinder]]\n[[He ties a spool of string to one end of the cylinder, and ties a deflated weather balloon to the other end]]\n[[The weather balloon is inflated, and raised up into the clouds as thunder rumbles]]\n[[The end of the string is tied to a stake in the ground, and lightning is flashing in the background]]\n[[Lightning hits the balloon, travels through the cylinder, and fuses it's contents]]\n{{Later}}\n[[The man follows the string to find the cylinder]]\n[[He detaches it, opens it, removes a solidified piece, and admires the piece]]\n[[He takes the stone to a jeweler]]\n[[The jeweler examines, grinds, and sets the now-shining stone in a necklace]]\n[[The man approves of the final result]]\n[[He gives it to a woman]]\n{{alt: Well, for some value of 'actually work'.}}"},{"Num":261,"Title":"Regarding Mussolini","Transcript":"[[Three people are standing around a map.  One of them is pushing something with a stick.]]\n[[A messenger arrives.]]\nMessenger: General, Italian forces have entered Egypt.\nGeneral: As I expected. This is a foolish move by Mussolini, but like Hitler he will no doubt force his commanders to --\nMessenger: Hey. Godwin's Law.\nGeneral: Dammit.\nGeneral: You know, this may become a problem.\n\n{{Title text: Constantly stopping these briefings halfway through is becoming a pain.}}"},{"Num":262,"Title":"IN UR REALITY","Transcript":"[[Two men stand facing one another. Man on the left is wearing a hat and holding a cat and a piece of paper. Man 2 has raised his arms. There are three cats with captions stuck to them]] \nMan: Oh hi; I'm here from the internet\nMan 2: What are you doing!?\nMan: Gluing captions to your cats.\n\u003c\u003crrrr\u003e\u003e\n{{Title-text: Hey, at least I ran out of staples.}}"},{"Num":263,"Title":"Certainty","Transcript":"[[A door seen from a hallway, with \"Teachers' Lounge\" on the glass. Inside, two teachers are talking.]]\nTeacher 1: My students drew me into another political argument.\nTeacher 2: Eh; it happens.\nTeacher 1: Lately, political debates bother me. They just show how good smart people are at rationalizing.\n[[The two teachers continue talking. A third one is seen reading a book on a sofa.]]\nTeacher 1: The world is so complicated - the more I learn, the less clear anything gets. There are too many ideas and arguments to pick and choose from. How can I trust myself to know the truth about anything?\nAnd if everything I know is so shaky, what on Earth am I doing teaching?\nTeacher 2: I guess you just do your best. No one can impart perfect universal truths to their students.\nTeacher 3: \u003c\u003cahem\u003e\u003e\nTeacher 2: ...Except math teachers.\nTeacher 3: Thank you.\n{{alt text: a(b+c)=(ab)+(ac). Politicize that, bitches.}}"},{"Num":264,"Title":"Choices: Part 1","Transcript":"[[Girl sits at desk, using computer. Refreshes page]]\n\u003c\u003c*Refresh*\u003e\u003e\n\u003c\u003cClick\u003e\u003e\n[[Sits back and looks at monitor]]\n[[Refreshes page on computer]]\n\u003c\u003c*Refresh*\u003e\u003e\n\u003c\u003cClick\u003e\u003e\n[[Sits back and looks at monitor]]\n[[Girl leans forward and clicks mouse]]\n\u003c\u003cClick\u003e\u003e\n[[A hole opens up in the panel. It appears to be the torn paper of the comic itself. A blue, sky-like background is revealed. Girl jumps in surprise, nearly tipping over the chair]]\n[[Girl stands up as the chair falls over completely.]]\n[[Wide view. The girl looks back at the door furtively]]\n[[She begins to climb into the hole]]\n[[By now the girl is entirely inside the hole. She is closing it behind her]]\n[[Only her head and arms are visible]]\n[[The hole is closed, revealing a formation of ripped paper.]]\n{{Large frame}}\n[[She appears to be in space. Stars dot the sky and a ray of light traverses the frame horizontally. Megan is in a bubble, floating disconnectedly. Both her and bubble have become white, tinged against the backdrop]]\n{{title text: Wait, damn, I think I spotted a new email on the last refresh.}}"},{"Num":265,"Title":"Choices: Part 2","Transcript":"[[A boy is doing some excercises in a book. The clock on the wall says 12:50 or 13:50.]]\n[[Book:\nChapter 15: Special Relativity\nProblem 1:\nTwo spacecraft transmit messages to each other while passing at constant velocities of...\n]]\nBoy: \u003c\u003csigh\u003e\u003e\n[[Label: Meanwhile:]]\n[[A girl in a bubble and a spacecraft are moving towards each other. Each one has a velocity vector drawn before themselves, each showing a velocity of 0.2c.]]\n[[They pass each other.]]\nSpacecraft: We observe your speed to be 38.5%c, and your time is passing at 92.3% the rate of ours. Does this mirror your observations?\nGirl: Please help me. I think I'm lost.\n[[They continue with the same velocity vectors. The girl is looking back at the spacecraft.]]\n{{alt text: Maybe someday I'll get to write the Wikipedia article about this place! Wait, damn, original research.}}"},{"Num":266,"Title":"Choices: Part 3","Transcript":"[[A girl floats in a bubble against a space backdrop]]\nGirl: I should feel scared.\nBut I don't.\nMaybe this is a dream\nbut it doesn't feel like one.\nDisembodied voice: Okay, found you.\nGirl: Who are you?\nVoice: Er, hang on.  This next part might be a little weird.\n[[No dialogue]]\n[[Many copies of the girl whirl around her bubble; a lightning bolt appears in the background]]\n[[All the copies have disappeared except for one]]\nCopy: Sorry -- Hi, me.\nGirl: ...Hi.\n{{Alt-text: Wait, this is space -- how are you talking to me?  And, as an afterthought, what's up with the hole in reality?}}"},{"Num":267,"Title":"Choices: Part 4","Transcript":"[[Girl in bubble, floating in outer space next to her clone]]\nClone: I shouldn't do this, but I pulled you out for a moment to give you a hint.\nGirl: A hint?\nClone: Take wrong turns.  Talk to strangers.  Open unmarked doors.  And if you see a group of people in a field, go find out what they're doing.  Do things without always knowing how they'll turn out.\nGirl: Why tell me this?\nClone: You're curious and smart and bored, and all you see is the choice between working hard and slacking off.  There are so many adventures that you miss because you're waiting to think of a plan.  To find them, look for tiny interesting choices.  And remember that you are always making up the future as you go.\nGirl: So, wait, what *is* this place?  Am I going to wake up thinking this was a dream?\nClone: This is... think of this as after the game, outside the theatre.  To go in, I had to suspend disbelief, forget the outside.\nGirl: So you... Huh.  Why give me hints I'm going to forget?\nClone: You'll forget this trip but I think the hints should stay with you.\nGirl: ...if this is a game, are you--are *we*--cheating?\nClone: Yup.\nGirl: Is that a good idea?\nClone: Well it's an interesting one.  We'll see how it goes.\nGirl: Well, I guess I'll see you aroun--Wait a minute; have you brought me here before?\nClone: I... maybe.  once.\nGirl: For another hint?\nClone: Er.  Actually we just made out.\nGirl: We wh--\nClone: Bye!\n{{Alt-text: Making out with yourself: now an official xkcd theme?  Troubling.}}"},{"Num":268,"Title":"Choices: Part 5","Transcript":"[[A girl is walking towards the right of the panel.]]\n[[A boy wearing a backpack is walking towards the left of the panel.]]\n[[They walk past each other.]]\n[[The girl has a sudden thought.]]\n[[The girl turns back and says.]]\nGirl: Hi.\nBoy: Uh, hi.\nGirl: Sorry if this is weird, but\nGirl: Do you like flying kites?\n{{alt text: I wonder what percentage of not-obviously-busy people on the street would say yes to kite-flying with a stranger. This looks like a job for Science!}}"},{"Num":269,"Title":"TCMP","Transcript":"[[Two guys and a girl are standing in a room, the first guy holds a keyboard.]]\nFirst guy: Hey, help me test the Transconsciousness Messaging Protocol.\nSecond guy: What's that?\nFirst guy: I've been training myself to keep my fingers moving slightly as I fall asleep, so I can type from inside dreams.\n[[First guy sitting on his bed]]\nFirst guy: I'm going to sleep now. My computer will relay my messages to you as I explore the dream world.\n[[In the dream: (first guy standing in what looks like a forest.)]]\nFirst guy: So strange to think none of this is real. And yet I have this lifeline to the internet back home.\nFirst guy: A chance to speak from one reality to another. I feel like Bell \u0026 Watson. I get to write the inaugural TCMP message. Let's see... [[types on the keyboard]]\n[[outside: (girl sitting at a computer, second guy standing behind her)]]\nGirl: \"F1rst pøst!!\"?\nSecond guy: Great. He's jumped straight to transreality trolling.\n{{title text: A big obstacle in experimenting with the mind's dream-simulation-engine is holding onto the details as you wake up.  With TCMP you can bring back any information you want.}}"},{"Num":270,"Title":"Merlin","Transcript":"[[Man and woman standing by a train]]\nWoman: I'm bad at goodbyes. At some level I never think they're for real.\nMan: They make me think of T. H. White's Merlin.\nWoman: Oh?\nMan: He lived backwards, remembering the future and not the past. To him, final goodbyes meant nothing, while first hellos were tearful and bittersweet.\nWoman: Huh - so over the years he'd forget all his friends.\nMust've been lonely.\nMan: Yeah. He ended up just sitting around at home watching DVDs all day. The best was the time he rented 'Memento'...\n[[Merlin is sitting in front of a couch, watching TV]]\nMerlin: Well, that was straightforward.\n{{alt text: I mean, the black-and-white stuff was running backward, but it hardly mattered to the story.}}"},{"Num":271,"Title":"Powers of One","Transcript":"{{Powers of One}}\n{{A mind-expanding look at our world.}}\n[[A sequence, presumably continuing endlessly in both directions, of identical images of a couple lying on a chequered blanket, with a picnic basket, on grass. Each image has a rule at the bottom giving measurements in meters, with the scale in terms of 1 to a particular power. The powers visible are the -1th (part), 0th-2nd, and 3rd (part).]]\n{{alt: It's kinda zen when you think about it, if you don't think too hard.}}"},{"Num":272,"Title":"Linux User at Best Buy","Transcript":"Salesman: Interested in updating your antivirus software?\nCustomer: Oh, I wouldn't need any of that.\n{{In a spiky speech bubble}}\nI RUN LINUX.\n\u003c\u003cFlip\u003e\u003e\n{{Customer does a backflip onto a motorcycle}}\n{{Customer performs a wheelie on the motorcycle}}\n{{Customer does a hard, donut turn on the motorcycle, kicking up dirt into the salesman's face}}\n{{Customer speeds off on the motorcycle, leaving the salesman in a cloud of black exhaust}}"},{"Num":273,"Title":"Electromagnetic Spectrum","Transcript":"((Everything is one big panel.))\n\nThe Electromagnetic Spectrum\n\nThese waves travel through the electromagnetic field. They were formerly carried by the aether, which was decommissioned in 1897 due to budget cuts.\n\nOther waves:\n- Slinky waves [[Two people hold the ends of a tangled slinky.]]\n- Sound waves [[There is a snippet of a frequency band. Between 20 Hz and 20 KHz is labeled \"Audible Sound.\" Towards the top is a line labeled \"That high-pitched noise in empty rooms.\"]]\n- The wave [[A row of people does a wave.]]\n\n[[Three parallel scales are across the bottom. The first is lambda (m), ranging from 100Mm to 100fm; second is f (Hz), which starts at 1 Hz and reaches 100 THz about 2\n3 of the way along, after which the labels read \"other entertaining greek prefixes like peta- exa- and zappa-\"; last is Q (Gal^2\nColoumb), whose labels are 17, 117, pi, 17, 42, theta, e^pi-pi, -2, 540^50, and 11^2. Above the scales and lined up accurately with the first two are the following:]]\n\n- Power \u0026 Telephone (100Mm to 1km)\n- Radio \u0026 TV (1km to somewhere between 1m and 10cm); above that are many boxes showing subranges (AM, VHF, UHF, 14\n7 NPR pledge drives, a very thin band for the space rays controlling Steve Ballmer, 99.3 \"The Fox,\" 101.5 \"The Badger,\" 106.3 \"The Frightened Squirrel,\" cell phone cancer rays, CIA, ham radio, kosher radio, shouting car dealership commercials)\n- Microwaves (a bit more than 10cm to a bit more than 1mm); it also has subranges (aliens, just below SETI, wifi, FHF, brain waves, sulawesi, gravity)\n- Toasters (about 1mm to about 100 micrometers)\n- IR (about 100 micrometers to somewhere between 1 micrometer and 1 nm); above that is a bell graph labeled \"Superman's heat vision,\" with a motorcycle driving up the left side labeled \"Jack Black's Heat Vision.\"\n- Visible light (and, under it, visible dark); above that is a bell graph labeled \"sunlight.\" There's a breakout chart above it showing the visible spectrum from 700nm (red) to 450nm (violet). There's an arrow pointing to where octarine would be, somewhere off to the side. Above that are bars showing the absorption spectra for hyrogen, helium, Depends(R) (yellow only) and Tampax(R) (red only).\n- UV (about 100nm to about 10nm)\n- Miller Light (a thin bar around 10nm)\n- An unlabeled section with a thin line above it showing the frequency of the main death star laser\n- A blocked-off portion labeled \"Censored Under Patriot Act.\"\n- X-rays (from about 1nm to about 10pm); a line above shows the frequency of mail-order x-ray glasses. Somewhere vaguely above the 10pm mark is a potato.\n- Gamma\ncosmic rays (10pm and smaller); above that is a bar marked Sinister Google Projects which also trails off into higher frequencies, and blogorays, which are slightly lower.\n\n{{Title text: Sometimes I try to picture what everything would look like if the whole spectrum were compressed into the visible spectrum.  Also sometimes I try to picture your sister naked.}}"},{"Num":274,"Title":"With Apologies to The Who","Transcript":"[[Stick figure is sitting at a desk with a computer, typing]]\nMonitor: People try to shut us d-d-down \n just 'cause our music gets around\n[[Stick figure is standing on his chair and typing with his keyboard across his hip.]]\nMonitor: Old folks act like total noobs \n get off our net; _you_ block the tubes\n[[Stick figure is really wailing on the keyboard.]]\nMonitor: Why don't you all just d-d-disconnect \n and don't try an' grok our d-d-dialect\n[[Stick figure smashes the keyboard into the monitor.]]\nMonitor: I'm not tryin' to cause a big s-s-sensation \n I'm just bloggin' bout my generation\n{{alt: Trivia: Roger Daltry originally wrote \"Don't try an' Digg what we all say' but erased the second 'g' when he moved to reddit.}}"},{"Num":275,"Title":"Thoughts","Transcript":"When meeting a girlfriend's family, I have to suppress the weirdest thoughts.\n[[A boy talking with his girlfriend's parents]]\nBoy: Hi!\nMother: Hi! It's so nice to finally meet you!\nBoy: I have licked your daughter's nipples.\n{{alt text: And now I might never get to again.}}"},{"Num":276,"Title":"Fixed Width","Transcript":"[[A man, Rob, is sitting at a computer. The text is an IRC-style transcript of a conversation, in a fixed-width font. He is text-messaging a girl he slept with named Emily; their messages read as follows:]]\n\u003crob\u003e hi\n\u003cemily\u003e hey you\n\u003crob\u003e last night was nice\n\u003cemily\u003e the best i've had\n\u003crob\u003e yeah it was AMAZING\n\u003cemily\u003e ok, i have to ask\n\u003cemily\u003e is this for real?\n\u003cemily\u003e or is it just sex\n\u003crob\u003e definitely just sex\n\u003cemily\u003e holy shit\n\u003cemily\u003e are you serious?\n\u003cemily\u003e you don't know how much that made\n        my stomach hurt\n\u003cemily\u003e i want to cry\n\u003crob\u003e i'm sorry\n\u003crob\u003e i wanted to type 'i love you'\n\u003crob\u003e but our line lengths were syncing up\n\u003cemily\u003e ...\n\u003crob\u003e and it would have broken the pattern\n* emily has disconnected\n{{alt text: I wish I knew how to quit this so I wouldn't have to quit you.}}"},{"Num":277,"Title":"Long Light","Transcript":"[[A man in a car, sitting at a red light.]]\nMan: This light always takes forever.  I'd like to smack the idiot who designed this intersection.\n[[An engineer steps up onto the hood of the man's car.]]\nEngineer: Hi.\nMan: Who the hell are you?\nEngineer: I designed this intersection.\nEngineer [[arms spread outward]] : You're right - I should have just made the light shorter! Never mind the hours of simulation and testing I did.  Never mind that this intersection interacts with it's neighbors in a complicated way and it took me a week to work out timing sequences that avoided total jams.\nEngineer: Clearly, I'm a crappy engineer and you have a better solution.  Go on, show me your proposed timings.\nMan: Get the hell off my hood before I start driving and fling you into traffic.\nEngineer: You can't.  Light's red.\nMan: Well, when will it change?\nEngineer: Tuesday.\n{{Title Text: You can look at practically any part of anything manmade around you and think 'some engineer was frustrated while designing this.'  It's a little human connection.}}"},{"Num":278,"Title":"Black Hat Support","Transcript":"[[A man - wearing a black hat - is sitting at his computer, wearing a phone headset]]\nPhone: Thank you for calling the Black Hat Support Line, your first source for Linux support. How may I assist?\nMan: Hi. I'm running an Apache server, and the load keeps climbing out of control.\nPhone: Okay. First, click on the Start Menu.\nMan: I'm sorry, this is the Linux helpline, right?\nPhone: Of course, Sir.\nMan: If you'll just open the \"My Documents\" folder-\nPhone: Just a damn minute, I think you're putting me on.\nMan: Please bear with me, Sir.\nMan: Now, load up your AOL and go to the Keyword \"Linux\"-\nPhone: *click*\n{{Alt: So as not to leave you hanging -- it was a problem with select() calls.}}"},{"Num":279,"Title":"Pickup Lines","Transcript":"[picture of a man at a bar]\nMan: If I could rearrange the alphabet, I'd put your sister and I together.\nMan: Is your father a thief? because that's totally my jetta you parked outside.\nMan:You must be tired, 'cause you've been running through my mind all night\nMan: screaming.\n{{title text: That shirt looks good on you, but it would look even better stuffed onto the neck of a vodka bottle and flung burning through our office building's window.  Let's fucking do it and never look back.}}"},{"Num":280,"Title":"Librarians","Transcript":"{{Advantages to dating librarians}}\nLibrarian: We're stopping in Baltimore to visit my family, and that's final.\nBoyfriend: Oh yeah?\n[[Reaching inside paper bag.]]\nBoyfriend: Hey, look, it's a new hardback book!\n[[Holds book in hands]]\nLibrarian Girlfriend: You wouldn't.\n[[The book is twisted and crinkled.]]\n\u003c\u003ccrinkle\u003e\u003e\n\u003c\u003ccreak\u003e\u003e\n[[Librarian Girlfriend twitches.]]\n\u003c\u003ccrack\u003e\u003e\n[[The book's spine is broken]]\nLibrarian Girlfriend: OKAY! You win!\n\n{{alt: Don't expect any leniencies on late fees, though.}}"},{"Num":281,"Title":"Online Package Tracking","Transcript":"{{Online Package Tracking}}\n{{_Pros_: Convenient, Useful}}\n{{_Cons_: Makes You Crazy}}\n[[A person is sitting at a computer.]]\n\u003c\u003crefresh\u003e\u003e\nPerson: Aww, still in Memphis.\n\u003c\u003crefresh\u003e\u003e\nPerson: Aww, still in Memphis.\n\u003c\u003crefresh\u003e\u003e\nPerson: Aww, still in Memphis."},{"Num":282,"Title":"Organic Fuel","Transcript":"[[Man sitting at computer second man standing nearby]]\nMan at Computer: Wow â Engines can burn vegetable oil.\nStanding man: Well, sure. You can burn most any organic matter. Corn, leaves, spices...\nMan at Computer: Spices? Really?\nStanding man: Sure â Mussolini made the trains run on thyme.\nMan at Computer: ...\nMan at Computer: We are no longer friends.\n{{alt text: I have nothing to apologize for.}}"},{"Num":283,"Title":"Projection","Transcript":"[[Man and woman seated on couch watching a TV.]]\nWoman: Argh, movie pet peeve. Someone sitting at a computer in the dark with the screen projected on their face. Monitors don't work like that!\n[[Man and woman face each other on couch.]]\nMan: Right - that only happens if you're in the way of a proected image. Like when we're sitting together in a parked car in the rain and the mottled light through the raindrops on the windshield makes shifting shadows on your skin...\n[[Woman stands, man uses laptop on table behind couch.]]\nWoman: ...I wasn't really into the movie anyway.\nMan: The nearest rainstorm's about 60 miles away.\nWoman: We'll drive fast.\nMan: I'll grab some snacks.\n{{title text: Out in a field, not another car for miles, silence but for the rain drumming on the sunroof, warm thick folds of the blanket hiding wordless fingertip games...}}"},{"Num":284,"Title":"Tape Measure","Transcript":"[[A man finds a tape measure]]\nMan: Hey, a tape measure!\n[[He extends the tape measure]]\n\u003c\u003cextend\u003e\u003e \u003c\u003cextend\u003e\u003e\n[[The tape measure falls]]\n\u003c\u003cclatter\u003e\u003e\n[[He tries again]]\n\u003c\u003cextend\u003e\u003e\nMan: Eight feet!  I wonder if that's a world record?\n[[He imagines ... In an olympic stadium]]\nAudience:  Go!  Go!  Gooooo!"},{"Num":285,"Title":"Wikipedian Protester","Transcript":"[[There is a politician speaking at a podium, which sports an American flag.]]\n[[In front of the speaker there is a crowd of people listening.  In the middle of the crowd a man is standing up holding a sign reading \"[CITATION NEEDED]\" in blue underlined text, as in Wikipedia articles.]]\n{{title text: SEMI-PROTECT THE CONSTITUTION}}"},{"Num":286,"Title":"All Your Base","Transcript":"[[A section of a Linux terminal window is shown]]\nText from window: ~ \n$ ls \nayb    boot    etc         lib ...\nbin     dev     home    mnt ...\n~\n $ ls \nayb\nallyourbase_original.swf   al...\nallyourbase_remix.swf        ...\nallyourbase_remix2.swf    b ...\nayb_acapella.mp3           ze...\nayb_images\n                  ze...\nayb_orchestral.mp3\n....\n[[Girl is at computer]]\nGirl: What's with the All Your Base stuff? Didn't that die like five years ago?\n[[From off-panel]] : Yes.\n[[Man enters panel]]\nMan: It was my first internet meme, and my favorite.  Others tired of it, but I never did.\nMan: So I wait.\nMan: Someday, decades from now, people will have forgotten. It will be fresh again.\nMan: Retro.\nMan: and when that day comes [[Man raises his fists]]\nMan: I WILL BE READY!\nGirl: You need a hobby or something.\nMan: What you say!!\nMan: Wait, too soon.\n{{title text: The AYB retro-return-date (Zero Wing Zero Hour) should be around AD 2021.}}"},{"Num":287,"Title":"NP-Complete","Transcript":"My Hobby:\nEmbedding NP-Complete problems in restaurant orders\n[[A menu is shown]]\nChotchkies Retaurant\nAppetizers\nMixed Fruit 2.15\nFrench Fries 2.75\nSide Salad 3.35\nHot Wings 3.55\nMozzarella Sticks 4.20\nSampler Plate 5.80\n[[Three people sit at a table. One man at the table is ordering from a waiter]]\nMan at table: We'd like exactly $15.05 worth of appetizers, please.\nWaiter: ... Exactly? Uhh ...\nMan at table: Here, these papers on the knapsack problem might help you out.\nWaiter: Listen, I have six other tables to get to - \nMan at table: - As fast as possible, of course. Want something on traveling salesman?\n{{title text: General solutions get you a 50% tip.}}"},{"Num":288,"Title":"Elevator","Transcript":"[[Elevator panel, with a Certificate of Inspection and five floor buttons, numbered 1â4. The fifth button is unlabeled.]]\n[Person thinks]\n[Person writes something on a small piece of paper]\n[Person tapes it onto the panel]\n[[Elevator panel, with the same Certificate and buttons, and with the piece of paper labeling the fifth button âZeppelinâ.]]\n[Person presses the new âZeppelinâ button]\n[Elevator moves]\nElevator: *Ding*\n[Person is looking out the door of a Zeppelin. The Zeppelin is flying over a green landscape with many lakes.]\n{{Title text: Quick, try it with 'LOVE'.}}"},{"Num":289,"Title":"Alone","Transcript":"[[Girl crawling on bed toward boy\nnarrator.]]\nNarrator: It's not something you can turn off.\n[[Boy pulling girl, bedspread, and pillow off of bed onto floor.]]\nNarrator: A part of me is always detached. \n Abstracting, looking at numbers and patterns.\n[[Girl on top of boy, both under bedspread, on floor. Girl looks to be 'touching' boy.]]\nNarrator: When we should be closest, part of me is still alone. \n Counting the touches of her fingertips. \n Touch. \n Touch. \n Touch touch. \n Touch touch touch. \n Touch touch touch touch touch.\n[[Same scene as third panel.]]\nNarrator: Wait. \n Is that... \n That's the Fibonacci Sequence! \n Whatever I did to deserve you, it couldn't have been enough.\n{{title text - Worries assuaged, the numbers become less important than your touches.}}"},{"Num":290,"Title":"Fucking Blue Shells","Transcript":"My Profanity Usage By Cause:\n[[Pie chart is shown]]\n[[Injury is about 5% of pie chart]]\n[[Irony is about 5% of pie chart]]\n[[Misc is about 5% of pie chart]]\n[[Segfaults is about 10% of pie chart]]\n[[MarioKart is about 75% of pice chart]]\n{{title text: You can evade blue shells in Double Dash, but it is deep magic.}}"},{"Num":291,"Title":"Dignified","Transcript":"[[Figure with beret swinging upside-down from tree branch to figure walking by:]]\nYou were once shoved headfirst through someone's vagina.  Why are you acting so dignified?\n{{alt: 'I don't know, why is your beret staying on your head?' 'Staples.'}}"},{"Num":292,"Title":"goto","Transcript":"[[Man sits at computer, thinking]]\nMan: I could restructure the program's flow - or use one little 'GOTO' instead.\nMan: Eh, screw good practice. How bad can it be?\nText on computer: goto main_sub3;\n\u003c\u003cCompile\u003e\u003e\n[[Panel passes in which man simply looks at the computer]]\n[[A raptor jumps into the panel and attacks the man at the computer]]\n{{title text: Neal Stephenson thinks it's cute to name his labels 'dengo'}}"},{"Num":293,"Title":"RTFM","Transcript":"[[ A man with a knife sticking out of his heavily bleeding face stands in front of a toaster, which has an arm extending from the top of it. He is holding a telephone to his ear. ]]\nMan: Hello, 911?  I just tried to toast some bread, and the toaster grew an arm and stabbed me in the face!\n911: Did you read the toaster's man page first?\nMan: Well, no, but all I wanted was--\n911: \u003c\u003cclick\u003e\u003e\n{{ alt: Life is too short for man pages, and occasionally much too short without them. }}"},{"Num":294,"Title":"Bookstore","Transcript":"[[Man is standing in a bookstore, looking at a book]]\nMan: This book looks interesting. Maybe I'll buy it.\n[[The man reads the book; a clock appears above showing the passage of time]]\nMan: Oops, I read the whole thing.\nMan: I'll just quietly put it back and go.\n[[Man walks through a security scanner to exit the bookstore]]\n\u003c\u003cBEEP BEEP BEEP\u003e\u003e\nVoice from off-frame: Hey! Your brain set off the sensor!\nMan: I, uhh...\nVoice from off-frame: You have a book in there, don't you!\nMan: Crap.\n{{title text: You can search it if you want, but you may want to skip the memories of your mom.}}"},{"Num":295,"Title":"DNE","Transcript":"[[Man is in an empty classroom writing on the whiteboard.  In the top right corner in large print is written \"Fuck This Place!.\"  It is circled, and underneath he is writing \"DNE\"]]\n{{title text: I've seen advertisers put their URLs on chalkboards, encircled with a DNE.  They went unerased for months.  If you see this, feel free to replace the URL with xkcd.com.}}"},{"Num":296,"Title":"Tony Hawk","Transcript":"My Hobby:\nDoing skateboard tricks in Tony Hawk while also doing them in real life.\n[[Man riding a skateboard in a halfpipe with a handheld video game]]\n\u003c\u003cbeep click beep\u003e\u003e\n[[Man does a skateboard trick]]\n\u003c\u003cFrontside 360°!\u003e\u003e\nVideogame: Frontside 360°!\n{{Bad idea #271: Dropping into the half-pipe on a Segway.}}"},{"Num":297,"Title":"Lisp Cycles","Transcript":"[[Guy sitting at computer. Girl listening]]\nGuy: Lisp is over half a century old and it still has this perfect, timeless air about it.\nGuy: I wonder if the cycles will continue forever.\nGuy: A few coders from each new generation rediscovering the Lisp arts.\n[[Man in Jedi robes carrying an armload of parentheses, speaking to Guy]]\nJedi: These are your father's parentheses. Elegant weapons. For a more... civilized age.\n{{title text: I've just received word that the Emperor has dissolved the MIT computer science program permamently. }}"},{"Num":298,"Title":"Tesla Coil","Transcript":"[[Two figures, one wearing a hat stand near a tesla coil mounted on a table.]]\nNo hat: I finally finished my Tesla Coil!\n[[The room is dark; characters appear as faint blue outlines on black background. No hat turnss on the Tesla Coil \u003c\u003cclick\u003e\u003e and it sparks white static electricity. \u003c\u003cgzzzzzz\u003e\u003e]]\nHat Man: Cool, but-\nHat Man: Check *this* out\n[[Lightning shoots out of Hat Man's hands \u003c\u003cgzzzzzz\u003e\u003e]]\n[[The lights are back on]]\nNo Hat: How did you do that?\nHat Man: The world doesn't actually make any sense. Science doesn't work. No one told you because you're so cute when you get into something.\nHat Man: [[Floting up the frame]] Still, neat toy.\nNo Hat: [[Pointing to Hat Man]] Now you're hovering!\nHat Man: I guess you're still not getting this.\n{{Title Text: For scientists, this can be the hardest thing about dreams.}}"},{"Num":299,"Title":"Aeris Dies","Transcript":"[[Two men are talking.  The second man is sitting on the ground, hugging his knees to his chest]]\nFirst Man: Maggie's gone. You can't bring her back.\nSecond Man: But I have to, she's a part of my life.\nFirst Man: \u003c\u003csigh\u003e\u003e\nFirst Man: Okay, let me put this in your terms.\nFirst Man: Remember when Aeris died in FFVII? It was sad, but you had to keep playing.\nSecond Man: Actually, I downloaded a mod to add her back to my party. It changed other character's appearances and dialogue to hers so you didn't have to lose her.\nSecond Man: Lots of gamers did it.\n[[The first man put his hand on his chin]]\nFirst Man: That is troubling on several levels.\nSecond Man: I wonder if Maggie's old dress would fit you.\n{{alt text: It's bad enough that all the families in your Sims are just you and Maggie recreated over and over.}}"},{"Num":300,"Title":"Facebook","Transcript":"{{Title: Mildly sleazy uses of Facebook, part 14:}}\n{{subheading: Looking up someone's profile before introducing yourself so you know which of your favorite bands to mention}}\nBoy: Favorite bands? Hmm...\nBoy: Maybe Regina Spektor or the Polyphonic Spree.\nGirl: Whoa, those are two of my favorites, too!\nGirl: Clearly, we should have sex.\nBoy: Okay!  My favorite position is the retrograde wheelbarrow.\nGirl: [[arms in the air]] Ohmygod, mine too!\n{{alt-text: 'Here, I'll put my number in your cell pho -- wait, why is it already here?'}}"},{"Num":301,"Title":"Limerick","Transcript":"[[Stick figure sitting at computer, typing]]\nStickman:I used to find slashdot delightful,\nbut my feelings of late are more spiteful;\nmy comments sarcastic\nthe iconoclastic\nkeep modding to plus five (Insightful)."},{"Num":302,"Title":"Names","Transcript":"{{Title: Names}}\nMan (thinking): I hate it when I don't know someone's name, but it's been long enough that it's too awkward to ask.\n[[The scene is revealed to be at the alter getting married by a minister to a woman in a bridal dress.]]\nMinister: Do you Rachel, take this man...\nMan (thinking): Aha! Rachel!\n{{alt-text: I'm always so happy that I successfully navigated the introduction that I completely forget to pay attention to the name the other person told me.}}"},{"Num":303,"Title":"Compiling","Transcript":"{{ Title: The #1 Programmer Excuse for Legitimately Slacking Off: âMy code's compiling.â }}\n[[Two programmers are sword-fighting on office chairs in a hallway. An unseen manager calls them back to work through an open office door.]]\nManager: Hey! Get back to work!\nProgrammer 1: Compiling!\nManager: Oh. Carry on.\n{{ Alt: âAre you stealing those LCDs?â âYeah, but I'm doing it while my code compiles.â }}"},{"Num":304,"Title":"Nighttime Stories","Transcript":"[[ Man sitting in an armchair in a darkened room, behind him a bookshelf and an open window. A girl is seen outside reading a book by an eerie glow]]\nFor a few weeks now, sometime past midnight, a girl has wandered past my apartment reading by flashlight.\n[[Outside, the girl, walking down the street passing under a street lamp]]\nI wonder why she's up so late.\nMaybe she's restless\nLike me.\nI wonder what story she's wrapped up in.\nI wonder if she let's anyone into that island of light.\n[[ Man sitting in dark room ]]\n[[ Dark room minus man ]]\n[[ Man standing on his doorstep at the top of a small flight of stairs, near the bottom of which the girl has stopped, no longer reading. ]]\nMan: Hi!  What are you reading?\nGirl: Orson Scott Card's 'Xenocide.'  It's my favorite in the series!\n[[ The same, only man looks more dejected ]]\nMan: Wait, you like it more than Speaker for the Dead OR Ender's Game?\nGirl: Yeah!\n[[ The same, only man has withdrawn ]]\n[[ Man back sitting in the chair within dark apartment ]]\nAnd to think I loved her.\n{{ alt: Cue angry letters from all seven fans of Xenocide. }}"},{"Num":305,"Title":"Rule 34","Transcript":"[[A guy sits in front of his desktop computer. A girl lies belly-down on the floor in front of her laptop.]]\nMale: HuhâThomas the Tank Engine slash fiction.\nFemale: It's rule 34 of the internet. If you can imagine it, there is porn of it. \nMale: Nah. The web is freaky, but it can't begin to have everything.\nMale: There's no porn set atop storm-chasing vans. No homoerotic spelling bees. No women playing electric guitar in the shower.\nFemale: Actually, that last one would look pretty hot. As long as they were unplugged or waterproofed...\nFemale: Rivulets of water run down her chest, the smooth body of the guitar firm against her hips.\nFemale: She twangs the E-string and it shakes off tiny droplets in all directions.\n[[She rises into a crouch]]\nFemale: You're sure it doesn't exist?\nMale: Not yet.\nFemale: I'm registering WetRiffs.com. Let's get on this.\n{{title text: Okay, Lance.  For entry into the college bowl, spell 'Throbbing'}}"},{"Num":306,"Title":"Orphaned Projects","Transcript":"[[Voices are coming from behind a door with a sign that reads \"Debian Linux HQ\"]]\nFirst voice: Problem: One of the volunteer developers has a date this weekend. Dates lead to romance, romance leads to orphaned projects.\nSecond voice: What's the plan?\nFirst voice: We're hiring him a relationship coach. He's like Will Smith in \"Hitch,\" but he only gives bad advice.\n[[Man in black hat is talking to another man, who is standing in from of a mirror]]\nMan in black hat: Okay, remember: The key to conversation is constructive criticism.\nMan in black hat: You need to show you're smart enough to solve her problems.\nMan in front of mirror: Makes sense.\n{{title text: His date works for Red Hat, who hired a coach for her, too.  She advised her to 'rent lots of movies like Hitch.  Guys love those.'}}"},{"Num":307,"Title":"Excessive Quotation","Transcript":"[[Outside, under a crescent moon.]]\nWoman: It's strange to stare at the moon and think about people walking on it.\nMan: That's no moon, it's aâ\u003c\u003cgack\u003e\u003e\n[[She holds him up in the air by his neck Ã  la Darth Vader using the force.]]\nWoman: I find your lack of original conversation disturbing.\n{{Title text: Unfortunately for her, real Star Wars fans are attracted to a gal with a good force choke.}}"},{"Num":308,"Title":"Interesting Life","Transcript":"[[On the left hand side of the panel is a cutaway of several floors of an office, in gray.  On the right side a blue sky with clouds, and green hills.  Hanging from a cable is a GIRL, clearly having rappelled down the side of the building]]\nGIRL: You know how some people consider \"May you have an interesting life\" to be a curse?\nGUY IN OFFICE: Yeah...\nGIRL: Fuck those people.  Wanna have an adventure?\n{{Alt-text: Quick, fashion a climbing harness out of a cat-6 cable and follow me down}}"},{"Num":309,"Title":"Shopping Teams","Transcript":"[[Each team is looking at a counter with two cubes on it.]]\nBad: Two non-nerds\nFirst man: Let's get that one.\nSecond man: okay.\nGood: non-nerd + nerd\nWoman: Let's get that one.\nMan: Wait, I think that one might be a better deal.\nWoman: Okay, that one. \nVery Bad: Two Nerds\nMan: How about that one?\nSecond man: i think the other one might be the better deal...\nFirst man: Hmm, I'm not sure...'\nTwo Hours Later\n[[Nerds are sitting in front of laptops with papers strewn about in front of display counter]]\nMan: I think our main problem is our unclear definition of value\nWoman: That is not your main problem!\n{{Title Text: I am never going out to buy an air-conditioner with my sysadmin again.}}"},{"Num":310,"Title":"Commitment","Transcript":"[[Guy proposing to girl on his knee]]\nNarrator: I understand now. There's no choir of angels when you meet the right person. It's about growing out of your fears to realize what you have is what you want.\nGuy: I do.\nGirl: I do.\n[[A cloud with trumpeting angels appears]]\nGirl 2: Hi.\nNarrator: Well, shit.\n{{Could be worse. The last guy in that situation fell for one of the transient trumpeting angels.}}"},{"Num":311,"Title":"Action Movies","Transcript":"[[A man and a woman are talking together as they walk away from a cinema]]\nMan: Another summer gone without a mindless big-budget action movie.\nWoman: Huh? Die Hard was nothing BUT action!\nMan: No, it was too talky.\nWoman: What? Too talky?\nMan: I tallied it minute-by-minute. It's at least 60% people walking and talking. ALL those movies are.\nMan: Just once, I want a real action movie. 30 seconds of exposition followed by a perfect 90-minute action scene. One with a huge budget, a good choreographer, and a great director.\nWoman: And they should center it around some character we already know, someone we never get tired of watching.\nMan: I think we've got something here...\n[[A movie poster is shown]]\nMovie Poster: Coming this summer\nMovie Poster: River Tam\nMovie Poster: Beats up EVERYONE\n[[The movie shows a line of houses, there are people beat up and lying in doorways, out of windows, and on the sidewalk. River Tam is doing a flying kick into someone's face]]\n{{title text: By my count, only 48 of the 158 minutes in Live Free or Die Hard have action.  That's pathetic, guys.  Crank is better, but needs a bigger budget and more Summer Glau.}}"},{"Num":312,"Title":"With Apologies to Robert Frost","Transcript":"A God's Lament\nSome said the world should be in Perl;\nSome said in Lisp.\nNow, having given both a whirl,\nI held with those who favored Perl.\nBut I fear we passed to men\nA disappointing founding myth,\nAnd should we write it all again,\nI'd end it with\nA close-paren."},{"Num":313,"Title":"Insomnia","Transcript":"[[It is black, except a few blue and green lights, and red numbers from a clock. The clock shows 4:31]]\nLying awake at night\nI realize how many little lights there are in my room.\nThe alarm clock is the brightest.\nCan't sleep\nI'm alone with those glowing red numbers\n[[The clock now shows 4:32]]\nTime slows\nDoes time even exist here?\nThoughts churning in on themselves\n[[The clock nows shows 4:33]]\nThe madness can't be far away\nAh yes\n[[The clock now shows 13:72]]\nThere it is.\n{{title text: Crap, I have levitation class at 25:131.  Better set the alarm to 'cinnamon'.}}"},{"Num":314,"Title":"Dating Pools","Transcript":"[[Woman is sitting on the ground with her elbows on her knees and her hands on her chin.  She is talking to a man.]]\nWoman: This sucks. The median first marriage age is 26. The pools of singles is shrinking. I'm running our of time.\nMan: Actually, not quite.\nMan: Yes, older singles are rarer. But as you get older, the dateable age range gets wider. An 18-year-old's range is 16-22, whereas a 30-year-old's might be more like 22-46.\n[[Man points to a chart]]\nText on chart: Standard creepiness rule: Don't date under (Age\n2 + 7)\nMan: I did some analysis of this with the Census Bureau numbers just last weekend. Your dating pool actually GROWS until middle age. So don't fret so much!\n[[Man is pointing to new set of charts. The first chart is labeled Singles, and is a decreasing graph.  The second graph is labeled Dating Pool, and is a bell curve.]]\nWoman: Did you analysis say anything about the dating prospects of people who spend weekends at home making graphs?\nMan: Come on. Somewhere at the edge of the bell curve is the girl for me.\n{{title text: The full analysis is of course much more complicated, but I can't stay to talk about it because I have a date.}}"},{"Num":315,"Title":"Braille","Transcript":"I learned to read braille a while back, and I've noticed that the messages on signs don't always match the regular text.\n[[There is a sign which reads: Third Floor Office with braille print underneath.  A man is reading the braille]]\nMan's thoughts: S-i-g-h-t-e-d-P-e-o-p-l-e-S-u-c-k ... Hey!\n{{alt text: The only big difference I've seen is in colors.  Where the regular text reads 'press red button', the braille reads 'press two-inch button'.}}"},{"Num":316,"Title":"Loud Sex","Transcript":"[[Man in bed, covering his head with pillow.]]\nNarrator: My neighbor has loud sex.\n\u003c\u003cOHHHHH\u003e\u003e\n\u003c\u003cGASP\u003e\u003e\n\u003c\u003cAAAAAAA\u003e\u003e\nNarrator: Good for her and all, but it keeps me up at night.\n[[Man and neighbor coming out of their apartments.]]\nNeighbor: Sorry, could you hear us last night? Oh, you know how it gets sometimes.\nNarrator: (small) Not really...\n[[Girl with \"LOUD\" and an arrow pointing to her.]]\nNarrator: But tonight I finally get my revenge. Because now I have a loud girlfriend too.\n[[Diagram of an elliptical reflector dish.]]\nNarrator: And an elliptical reflector dish.\n[[Man and his girlfriend having sex, with dish behind them, with sex sound effects coming off the dish, through walls, to his neighbor sitting up in bed while holding her head in pain.]]\n{{title text - Spherical or parabolic reflectors would of course lead to aberrant behavior.}}"},{"Num":317,"Title":"That Lovin' Feelin'","Transcript":"[[Man is in the middle of the frame, talking]]\nMan: You never close your eyes anymore when I kiss your lips and there's no tenderness like before in your fingertips.\n[[Man thoughtfully places his hand on his chin]]\nMan: Maybe I should try your sister instead.\n{{title text: Maybe there's no tenderness in her fingertips either, but at least SHE puts out.}}"},{"Num":318,"Title":"Nostalgia","Transcript":"Narrator: This generation is going to have some weird nostalgia.\n[[Two people, each wearing headsets with antennae, sunglasses and jetpacks, are hovering]]\nMale Figure: Darling, let's put on our best fake accounts, connect to the core ForumSpace, and trick people into looking at a picture of a man's distended anus!\nFemale Figure: Oh, it'll be just like old times!\n{{alt text: If you don't get this one, don't google it.}}"},{"Num":319,"Title":"Engineering Hubris","Transcript":"[[ Landscape in the background, canyon with a winding road ]]\nMaybe engineering is the pursuit of an unattainable perfection.\nMaybe it's impossible to create something bug-free.\nMaybe I'm a fool\nMaybe the tyranny of Murphy is the penalty for hubris.\nBut I just can't shake the feeling\n[[ man standing on a box labeled \"ACME\" ]]\nWith all those supplies\n_I_ could have caught that roadrunner.\n{{Alt: Chuck Jones is a vengeful god. }}"},{"Num":320,"Title":"28-Hour Day","Transcript":"[[There is a diagram which shows the hours in a week. It has sections labeled \"bed\" and below has sections labeled \"night.\" They do not line up.]]\n[[Two men are talking together.]]\nFirst man: You have trouble sleeping right?\nSecond man: Only when your mom is over.\n[[First man is now pointing to a chart.]]\nFirst man: Since your work is flexible-\nSecond Man: -Like your mom-\nFirst Man: -you should try the 28-hour day - 20 awake, 8 asleep (or 19\n9 if you prefer).\nSecond Man: I prefer your mom.\nFirst Man: It synchs up with the week - you spend weekdays awake normally, then on weekends you can go out all night.\nSecond Man: Just like your mom.\nFirst Man: It means four extra hours daily. You can stay up until you're exhausted every day and then spend a full 9 hours asleep each night!\nSecond Man: But how much time can I spend doing your mom?\nFirst Man: You? I'm guessing three or four minutes, tops.\nSecond Man: ...Well played.\n{{title text: Small print: this schedule will eventually drive one stark raving mad.}}"},{"Num":321,"Title":"Thighs","Transcript":"[[Guy singing, Girl at computer]]\nGuy: It's the thigh of the tiger\nGuy: When the moon hits your thigh like a big pizza pie, that's amore.\nGuy: She's my brown-thighed girl.\nGirl: Don't you have a job or something?\nGirl: Also, Eww.\n{{Alt text: My thighs have seen the glory of the coming of the Lord?}}"},{"Num":322,"Title":"Pix Plz","Transcript":"[[A man stands in the entrance to a room.  The door has been broken down.  A surprised nerd has turned away from his computer to face the remains of the door.]]\nMan: Hi.  I'm here about the girl who visited your IRC channel last night looking for Java help.\nNerd: What did you do to my door?\nMan: When someone with a feminine username joins your community and you say \"OMG a woman on the Internet\" and \"jokingly\" ask for naked pics, you are being an asshole.  You are not being ironic.  You are not cracking everybody up.  You are the number one reason women are so rare on the Internet.\nMan: At least, the parts of it _you_ frequent.\n[[Woman enters the room, holding some sort of device.]]\nMan: As someone who likes nerdy girls, I do not appreciate this.  I'm here to ban you from the Internet.  The gal behind me with the EMP cannon is Joanna -- she'll be assigned to you for the next year.  Try to go online and she'll melt your PC.\nNerd: Dude, she's hot.  Is she single?\nMan: Joanna, fire.\n{{Alt image tag: \"But one of the regulars in the channel is a girl!\"}}"},{"Num":323,"Title":"Ballmer Peak","Transcript":"[[A graph with \"programming skill\" on the X-axis and \"blood alcohol concentration\" on the Y one]]\n[[A man is making a presentation with the graph]]\nPresenter: Called the Ballmer Peak, it was discovered by Microsoft in the 80's. The cause is unknown but somehow a B.A.C between 0.129% and 0.138% confers superhuman programming ability.\nPresenter: However, it's a delicate effect requiring careful calibration--you can't just give a team of coders a year's supply of whiskey and tell them to get cracking.\nMan in public: ...Has that ever happened.\nPresenter: Remember Windows ME?\nMan: I knew it!\n{{title text: Apple uses automated schnapps IVs.}}"},{"Num":324,"Title":"Tapping","Transcript":"[[A man is sitting at a desk, tapping various parts of it]]\nMan: Hey, I can get different pitches by tapping on different parts of the desk.\n[[The man starts tapping faster, with both hands]]\nMan: Sweet, I can do the Jurassic park theme!\n[[The man taps very rapidly]]\n[[Later, elsewhere]]\nFriend: So, what did you do all afternoon?\nMan: Hung out.\n{{alt text: Sometimes the best fun looks like boredom.}}"},{"Num":325,"Title":"A-Minus-Minus","Transcript":"[[the hat guy is packing a bobcat into a box; a woman stands beside him.]]\nwoman: What are you doing?\nthe Hat Guy: Making the world a weirder place.\nbobcat: \u003c\u003cmrrowlll\u003e\u003e\n[[The hat guy has finished taping the package for shipping.]]\nman: Starting with my eBay feedback page.\n[[Bandaged person at a computer with assorted debris around the floor]]\nscreen: comments:\n\u003c\u003cbandaged person typing\u003e\u003e Instead of office chair package contained bobcat.\n\u003c\u003cbandaged person typing\u003e\u003e Would not buy again.\n{{title: You can do this one in every 30 times and still have 97% positive feedback.}}"},{"Num":326,"Title":"Effect an Effect","Transcript":"Narrator: MY HOBBY:\nUsing the more obscure meanings of \"affect\" and \"effect\" to try to trip up amateur grammar nazis.\nMan [[types]]: I think that our foreign policy effects the situation.\nComputer [[types]]: You mean \"affects\".\n[[from Man]] \u003c\u003ctee hee hee\u003e\u003e\n{{title text: Time to paint another grammarian silhouette on the side of the desktop.}}"},{"Num":327,"Title":"Exploits of a Mom","Transcript":"[[A woman is talking on the phone, holding a cup]]\nPhone: Hi, this is your son's school. We're having some computer trouble.\nMom: Oh dearâdid he break something?\nPhone: In a wayâ\nPhone: Did you really name your son \"Robert'); DROP TABLE Students;--\" ?\nMom: Oh, yes. Little Bobby Tables, we call him.\nPhone: Well, we've lost this year's student records. I hope you're happy.\nMom: And I hope you've learned to sanitize your database inputs.\n{{title-text: Her daughter is named Help I'm trapped in a driver's license factory.}}"},{"Num":328,"Title":"Eggs","Transcript":"[[A woman sits at a bar, a man approaches.]]\nMan: So, how do you like your eggs in the morning?\nWoman: Ooh, sunny side up.\nMan: Oh. Huh.\nWoman: Is that a problem?\nMan: Well, it's just that I was trying to set you up for the \"unfertilised\" line.\nWoman: Ah. Bad timing; I'm actually looking for casual sex. ...interested?\nMan: I'd love to, but I've got like 20 more jokes to set up tonight. Hey, have you seen a priest and a rabbi?\n{{Title Text: Oh, yeah, we get tons of them at these casual sex bars.}}"},{"Num":329,"Title":"Turing Test","Transcript":"[[A man sits at a computer connected through a wall to another computer.]]\nTURING TEST EXTRA CREDIT: CONVINCE THE EXAMINER THAT HE'S A COMPUTER.\nMan: You know, you make some really good points. I'm ... not even sure who I am anymore.\n{{Title Text: Hit Turing right in the test-ees.}}"},{"Num":330,"Title":"Indecision","Transcript":"First Guy: So, what do you want to do?\nSecond Guy: Still no ideas.\nFirst guy: Wait, I think there's a rule about this.\n[[First Guy goes to bookshelf and removes a book called \"Rules\"]]\n[[The book of Rules is opened to the following:\nRULE social.b.99.1\nIf friends spend more than 60 minutes unable to decide what to do, they must default to sexual experimentation.]]\n[[First Guy is standing, holding the book. Second Guy is in the process of standing up.]]\nFirst Guy: Huh.\nSecond Guy: I did not know that rule.\nFirst Guy: Me neither.\nSecond Guy: I'll go get the Crisco.\n{{alt-text: Hey, I don't make the rules. It's in the book.}}"},{"Num":331,"Title":"Photoshops","Transcript":"[[A woman holds a sword while a man looks on]]\nText: My hobby: Insisting that real-life objects are photoshopped.\nWoman: This sabre is a 19th-century family heirloom.\nMan: It looks photoshopped.\nWoman: Huh?\nMan: Yeah, the reflections are all wrong. Definitely photoshopped.\n{{Alt-text: When I look into your eyes, I see JPEG artifacts.  I can tell by the pixels that we're wrong for each other.}}"},{"Num":332,"Title":"Gyroscopes","Transcript":"[[Person at desk with Gyroscope]]\nNarrator: Despite years of studying physics, I still find gyroscopes a little freaky.\n[[Person starts gyroscope with a zzzzip]]\n[[Gyroscope spins with a zzzzzz]]\n[[Gyroscope lifts into the air]]\nGyroscope: Greetings, Human.\n{{title text: We didn't actually land on the moon -- it just looked like we did because of precession.  Also, gyroscopes caused 9\n11.}}"},{"Num":333,"Title":"Getting Out of Hand","Transcript":"[[A couple is in bed in the dark, and the guy reaches out from under the covers to do a Wikipedia search about Foreplay.]]\n{{title text: Wikipedia's role as brain-extension, while a little troubling, is also really cool.}}"},{"Num":334,"Title":"Wasteland","Transcript":"[[A guy is walking through a wasteland talking to himself]]\nI am alone in this wasteland, a thousand miles  from you.\nBut I haven't forgotten the feel of your skin, your mischievous smile.\nYou'd think a thousand miles would be enough.\nI guess I'll keep walking.\n{{title text: You make forgetting look so easy.}}"},{"Num":335,"Title":"Mattress","Transcript":"[[A couple is cuddling.]]\nCuddling face-to-face is nice, but we can never figure out where to put our lower arms.\nOur solution: the Cuddle Mattress!\nYour lower arms fit in the convenient gap.\n[[There is a diagram of a mattress with a notch cut through it at shoulder level. The gap is indicated with an arrow.]]\n[[The same couple is shown again, cuddling snugly on the mattress.]]\n\n[[A man and woman are giving a presentation to another person. The man has a pointer and a clicker for the slides which are projected on the screen next to him.]]\nListener: Oh man, that's ALWAYS bothered me.\nListener: I want one.\n\nListener: Although ... so the lower arms just sort of dangle?\nListener: What do you do with them?\n\nMan: It was a bit awkward.\nClicker: \u003c\u003cclick\u003e\u003e\nWoman: Then we had a second breakthrough.\n\n[[The couple is shown again on the cuddle mattress, this time in more detail and facing the tops of their heads. Their lower arms are sticking through the gap in the mattress and playing a conveniently located game of Rock 'em Sock 'em Robots.]]\nMan: \u003c\u003cclick\u003e\u003e \u003c\u003cclick\u003e\u003e\nBlue Robot: \u003c\u003cpunch\u003e\u003e\nRed Robot: \u003c\u003cpunch\u003e\u003e\nWoman: \u003c\u003cclick\u003e\u003e \u003c\u003cclick\u003e\u003e\n\n{{Title text: The TempurPedic wineglass guy broke his ankle.}}"},{"Num":336,"Title":"Priorities","Transcript":"[[A teacher is talking to a student, sitting at a desk.]]\nTeacher: If you don't turn in at least one homework assignment, you'll fail this class.\n[[The student holds up his report card.]]\nStudent: Yeah. But if I can fail this class, the grades on my report card will be in alphabetical order!\n{{rollover text: You should start giving out 'E's so I can spell FACADE or DEFACED.}}"},{"Num":337,"Title":"Post Office Showdown","Transcript":"I spend a lot of time mentally choreographing elaborate fight scenes with strangers around me.\n[[Man is in a post office wearing earphones.  There are several other people, including an old man with a crutch and an old woman with a long narrow box]]\nMan's thoughts: Okay - if that old man pulls a crossbow,\nMan's thoughts: I'll throw the postal scale at him and dive backward behind the stamps machine.\nMan's thoughts: But what if the lady by the door has a katana in that box?\nMan's thoughts: Better set my iPod to the \"Kill Bill\" fight theme, just in case.\n{{alt text: That track ('Battle Without Honor or Humanity') -- like 'Ride of the Valkyries' -- improves *any* activity.}}"},{"Num":338,"Title":"Future","Transcript":"[[The comic has three panels. In the first panel, a boy and a girl are holding hands. A voice bubble originating from a guy standing in the third panel saysâ¦]]\nVoice #1: Come explore the future with me!\n[[And the girl says something which goes to the third panel.]]\n[[The two voice bubbles cross in the middle of the second panel.]]\n[[The voice of the girl saysâ¦]]\nVoice #2: I can't.\n{{title-text: But the past was much too cramped!}}"},{"Num":339,"Title":"Classic","Transcript":"[[A person is sitting on the floor by a record player.]]\nLed Zeppelin: And as we wind on down the road \n Our shadows taller than our soul\n\nLed Zeppelin: When all is one and one is all \n To be a rock and not to rooooll\n\nLed Zeppelin (fading): And she's buying a stairway to heaven\n\nPerson: Man. The baby boomers are kicking our *asses.* We need to get it together, guys.\n\n{{Title text: Someone get that Pachelbel's Canon kid a recording contract, stat.}}"},{"Num":340,"Title":"Fight","Transcript":"[[Text: We had a fight last night.]]\n[[A guy is sitting in a sofa, head in both hands, feeling upset.]]\n[[Text: I guess she's still mad.]]\n[[A girl is standing with arms crossed in front of her chest, with the same mood.]]\n[[Text: I woke up to find she'd written a sappy love note]]\n[[The guy is standing in front of a computer, with a cup in his hand.]]\n[[Text: to my boot sector.]]\n[[The cup now lies on the floor, the guy is looking at the computer with disbelief.]]\nComputer: Operating system not found\n{{title-text: And she put sweet nothings in all my .conf files.  It'll take me forever to get X working again.}}"},{"Num":341,"Title":"1337: Part 1","Transcript":"[[Man 1 talks to man 2 who is lying down on the floor, using his laptop.]]\nMan 1: You're not on the neighbour's WiFi, are you?\nMan 2: Yeah, why?\nMan 1: The admin... plays games.\nMan 2: No problem. I'll just hop on a secure VPN.\nMan 2: Whoa, my connections are dying as soon as I start to tunnel anything!\nMessage on laptop: A VPN? How cute! And stop trying to SSH.\nMan 2: Holy shit! Someone's inserting notes into the pages I request! Editing the TCP stream live!\nMan 2: Nobody's that fast. Who is this admin?\n[[Neighbour (Mrs. Roberts) with bun tray in one hand, with oven mitts on both hands typing on a desktop computer.]]\nMrs. Roberts: My goodness. Neighbourhood scamps on the wireless.\n\u003c\u003ctaptaptaptap\u003e\u003e\nMan 1: I should have warned you about Mrs. Roberts.\nMan 2: How does she type with oven mitts!?\nMan 1: You've been pwned pretty hard, man. You might want to sit down.\n{{ If you're not cool enough to do it manually, you can look up tools like Upside-Down-Ternet for playing games with people on your wifi. }}"},{"Num":342,"Title":"1337: Part 2","Transcript":"[[Man 1 standing near Man 2, who is on the floor near the armchair.]]\nMan 2: So the greatest hacker of our era is a cookie-baking mom?\nMan 1: Second-greatest.\nMan 2: Oh?\nMan 1 (Narrating) : Mrs. Roberts had two children. Her son, Bobby, was never much for computers, but her daughter Elaine took to them like a ring in the bell.\nMan 1 (Narrating) : When Elaine turned 11, her mother sent her to train under Donald Knuth in his mountain hideaway.\nMan 1 (Narrating) : For four years she studied algorithms.\nKnuth: Child - \nKnuth: Why is A* search wrong in this situation?\n\u003c\u003cswish\u003e\u003e\nElaine: Memory usage!\nKnuth: What would you use?\nElaine: Dijkstra's algorithm!\nMan 1 (Narrating) : Until one day she bested her master\nKnuth: So our lower bound here is 0(n log n)\nElaine:  Nope. Got it in 0(n log (log n))\nMan 1 (Narrating) : And left.\n{{Trivia: Elaine is actually her middle name.}}"},{"Num":343,"Title":"1337: Part 3","Transcript":"[[Outside, Adrian Lamo is helping Elaine Roberts over a barbed wire fence.]]\nNarrator: IT WAS THE LATE 90'S. ELAINE CRISSCROSSED THE COUNTRY WITH ADRIAN LAMO, THE 'HOMELESS HACKER', LEARNING TO GAIN ENTRY INTO SYSTEMS BOTH VIRTUAL AND PHYSICAL.]]\nAdrian Lamo: SO YOU JUST THROW A RUG OVER THE FENCE AND ... SAY, WHAT IS THIS PLACE ANYWAY?\nRoberts: NOWHERE SPECIAL.\nLamo: ...ELAINE, IS THIS NSA HEADQUARTERS?\nRoberts: ...LOOK, I JUST WANT TO SEE IF THEY'VE BROKEN RSA.\n[[Inside, Lawrence Lessig is sitting at a table, Roberts is standing across the table swinging a knife]]\nNarrator: SHE LEARNED, FROM LAWRENCE LESSIG, ABOUT THE MONSTROSITY THAT IS U.S. COPYRIGHT LAW.\nRoberts: SO, HOW DO WE FIX THE SYSTEM?  STAB BAD GUYS?\nLessig: I'M STARTING SOMETHING CALLED \"CREATIVE COMMONS\"\n\u003c\u003cSHINK\u003e\u003e\nElaine Roberts: I THINK WE SHOULD STAB BAD GUYS...\n[[Steve Jobs is lying up in his bed, Roberts is balancing while crouched on the foot of Jobs' bed]]\nNarrator: SHE MET WITH STEVE JOBS TO DISCUSS THE FUTURE OF APPLE.\nRoberts: COMPRESSION AND BANDWIDTH ARE CHANGING EVERYTHING.\nJobs: WHO ARE YOU?  IT'S 3:00AM!\nRoberts: APPLE SHOULD MAKE A PORTABLE MUSIC PLAYER.\nJobs: I'M CALLING THE POLICE.\nRoberts: HEY, IDEA - INTEGRATE IT WITH A CELL PHONE!\n{{title text: I once asked an NSA guy whether they'd broken RSA.  And I know I can trust him, because I asked if he was lying to me and he said no.}}"},{"Num":344,"Title":"1337: Part 4","Transcript":"As time passed, Elaine intensified her hacking work, anonymously publishing exploit after exploit.\n[[Elaine is sitting under tree, typing on a laptop.]]\nTo crack open proprietary hardware, she teamed up with one of the top experts in signal processing and data transferring protocols.\n[[Elaine, wearing a backpack, is walking up to a door where a woman is greeting her]]\nElaine: Hi, mom.\nMrs. Roberts (Elaine's mom): Hello, dear. Did you have fun?\nThey were an unstoppable team.\n[[Elaine is on the floor with her laptop and Mrs. Roberts is on her computer at a table]]\nElaine: I finished the CSS decryptor.\nMrs. Roberts: Good, dear. I'll send it along to Jon.\nAnd were eventually noticed.\n[[Two men in black hats arrive.  One holds a briefcase that reads RIAA and the other holds a briefcase which reads MPAA]]\nRIAA man: Game's over.\nMPAA man: You're coming with us.\n[[Elaine stands up]] \nElaine: Oh, are we?\n[[Mrs. Roberts is still sitting at her computer, typing]]\nMrs. Roberts: Now now, Elaine -\n\u003c\u003cshink\u003e\u003e [[Elaine pulls a knife out]]\n\u003c\u003cshing\u003e\u003e \u003c\u003cshing\u003e\u003e [[The two men each pull a katana out of their briefcase.]]\nMrs. Roberts: Don't let them provoke you, dear.\nMen: We don't want to hurt you, Ma'am.\nMrs. Roberts: Don't by silly. Record company employees can't just go into houses and slice people up.\nRIAA Man: Ah, so you haven't read the DMCA.\nMPAA Man: Title IV, Section 408: Authorization of Deadly Force.\n[[Voice comes from off-panel]]: Hark!\n[[Everyone looks surprised. Mrs. Roberts stands.]]\n[[Bearded man enters, bearing two katanas.]]\nBearded man: Cease this affront to freedom, or stand and defend yourselves!\nMPAA Man: Stallman!\n{{title text: Mrs. Roberts would have gotten up sooner, of course, but she was busy piping find ~ and find ~nomad into xargs shred, just in case.}}"},{"Num":345,"Title":"1337: Part 5","Transcript":"[[Two RIAA agents attack Elaine and Stallman. Elaine breaks RIAA #1, while Stallman disarms RIAA #2 in a flying manouvre]]\nElaine: Thanks, Stallman!\nStallman: 'Tis my pleasure.\nElaine: So, wait - how did you know we were in trouble?\nStallman: My friend here was tracking these thugs from his balloon. He called me and I thought I'd stop by\n[[Doctorow slides down a rope in red cape \u0026 goggles]]\nDoctorow: -Hi! Cory Doctorow - It's a pleasure to meet you.\nElaine: Balloon?\nStallman: Aye. They're up there constructing something called a \"Blogosphere.\"\nDoctorow: Yup! Its twenty kilometers up, just above the tag clouds.\nBobby: Mom, I'm hungry.\nMrs. Roberts: Hush! I'm coding. You ate yesterday.\nStallman: You know, Roberts, GNU could use a good coder like you. Ever thought of joining us?\nElaine: Maybe someday. Right now I've got an industry to take down. Music doesn't need these assholes.\nDoctorow: Begone! And never darken our comment threads again!\nStallman: Well, you won't fix the industry with random exploits. You need to encourage sharing in the public mind.\nDoctorow: Hey; With your music and coding backgrounds, you should get into building better p2p systems.\nElaine: What? Straight-up piracy?\nDoctorow: Sure- have you ever considered it? You'd make a wonderful dread pirate, Roberts\n[[Epilogue]]\nElaine shared her ideas with Bram Cohen, who went on to develop BitTorrent.\nMrs. Roberts spends her time developing for Ubuntu, and defacing the websites of people who make \"your mom\" jokes to her daughter. Elaine still stalks the net. She joins communities, contributes code or comments, and moves on. And if, late at night, you point a streaming audio player at the right IP at the right time - you can hear her rock out.\n~Happy Hacking.~\n{{Alt\ntitle text: This digital music thing will probably reach its endgame sometime in the next decade or so.  These are very exciting times. }}"},{"Num":346,"Title":"Diet Coke+Mentos","Transcript":"[[Two boys are kneeling down on either side of a coke bottle.]]\nFirst Boy: This is the coolest thing.\nFirst Boy: You just drop the Mentos in the Diet Coke...\nSecond Boy: Uh huh\nFirst Boy: Give it a moment...\n[[The bottle has a few bubbles above it]]\n\u003c\u003cPoof\u003e\u003e [[A man appears.  The first boy raises his arms in exclamation.]]\n[[The second boy stands up and turns around.  He puts his hands over his mouth.]]\nSecond boy: D-Dad?\nMan [[Reaching towards the second boy]]: I'm back, son. We can be a family again.\n{{title text: The cola+Mentos trick is up there with corn starch+water (vibrating platter optional) in scientific coolness out of common kitchen supplies.}}"},{"Num":347,"Title":"Brick Archway","Transcript":"[[Inset: A man prepares to throw a tennis ball upward.]]\n[[The man lies on the ground, underneath the titular archway, next to two halves of a brick. Dust falls from the place in the archway where the man knocked the brick from with the tennis ball. The ball, meanwhile, has rolled about a meter away.]]\n\"Breakout\" is a stupid game.\n{{title text: The TI-86 was bad enough.  I don't know how I'd have gotten through high school if I'd had a laptop+wifi.}}"},{"Num":348,"Title":"Close to You","Transcript":"Man: \u003c\u003cSinging\u003e\u003e Why do birds suddenly appear\nMan: \u003c\u003cSinging\u003e\u003e Every tiiiime you are neeear\nMan: Wait, are those turkey vultures?\nMan: Okay, listen, are you a zombie?\nWoman: Hurrghhh...\n{{We should probably talk about this before the wedding.}}"},{"Num":349,"Title":"Success","Transcript":"As a project wears on, standards for success slip lower and lower.\n0 hours\n[[Woman looking at man working on the computer.]]\nMan: Okay, I should be able to dual-boot BSD soon.\n6 hours\n[[Man on the floor fiddling with the open tower in front of him.]]\nMan: I'll be happy if I can get the system working like it was when I started.\n10 hours\n[[Man standing in front of the computer which now has a laptop plugged into the tower.]]\nMan: Well the desktop's a lost cause, but I think I can fix the problems the laptop's developed.\n24 hours\n[[Man and woman swimming in the sea, island and beach seen in the distance.]]\nMan: If we're lucky, the sharks will stay away until we reach shallow water.\nWoman: If we make it back alive, you're never upgrading anything again.\n{{ 40% of OpenBSD installs lead to shark attacks. It's their only standing security issue. }}"},{"Num":350,"Title":"Network","Transcript":"[[ Girl looking at a large screen with many green and red squares. The squares have writing in them and lines connecting them.]]\n[[Side view. The screen is a huge LCD connected to a wireless router.]]\nGuy: Pretty, isn't it?\nGirl: What is it?\nGuy: I've got a bunch of virtual Windows machines networked together, hooked up to an incoming pipe from the net. They execute email attachments, share files, and have no security patches.\nGuy: Between them they have practically every virus.\nGuy: There are mail trojans, warhol worms, and all sorts of exotic polymorphics. A monitoring system adds and wipes machines at random. The display shows the viruses as they move through the network. Growing and struggling.\n[[Guy walks past the girl and touches the monitor]]\nGirl: You know, normal people just have aquariums.\nGuy: Good morning, Blaster. Are you and W32.Welchia getting along?\nGuy: Who's a good virus? You are! Yes, you are!\n{{title text: Viruses so far have been really disappointing on the 'disable the internet' front, and time is running out.  When Linux\nMac win in a decade or so the game will be over.}}"},{"Num":351,"Title":"Trolling","Transcript":"Great Moments in Trolling: Rick Astley is successfully rickrolled.\n[[Hat Guy and another guy are in Rick Astley's backyard, hacking into his cable TV connection and reprogramming it.\nRick Astley is watching CNN.]]\nTV: CNN has obtained this exclusive footage of the riot-torn \u003cczzzht\u003e {{Music starts}} Never gonna give you up... \nRick Astley: What the hell?\n{{Alt: And I was really impressed with how they managed to shock the Goatse guy. }}"},{"Num":352,"Title":"Far Away","Transcript":"[[The window of an instant messaging program. A drawing of two people hugging in the text part of the window.]]\n[[Man sitting in front of the computer.]]\nMan: Meh.\nMan: Some nights typing \"*hug*\" just doesn't cut it.\n{{Sometimes an inpulsive 2:00 AM cross-country trip is the only solution.}}"},{"Num":353,"Title":"Python","Transcript":"[[ Guy 1 is talking to Guy 2, who is floating in the sky ]]\nGuy 1: You're flying! How?\nGuy 2: Python!\nGuy 2: I learned it last night! Everything is so simple!\nGuy 2: Hello world is just 'print \"Hello, World!\" '\nGuy 1: I dunno... Dynamic typing? Whitespace?\nGuy 2: Come join us! Programming is fun again! It's a whole new world up here!\nGuy 1: But how are you flying?\nGuy 2: I just typed 'import antigravity'\nGuy 1: That's it?\nGuy 2: ...I also sampled everything in the medicine cabinet for comparison.\nGuy 2: But i think this is the python.\n{{ I wrote 20 short programs in Python yesterday.  It was wonderful.  Perl, I'm leaving you. }}"},{"Num":354,"Title":"Startling","Transcript":"[[Guy in front of his computer.]]\nNarration: I still do this every few months.\nGuy: Holy crap, it's the 21st century.\n{{We actually reached the future about three years ago.}}"},{"Num":355,"Title":"Couple","Transcript":"[[Man and woman in bed]]\nMan: So is this it? Are we a couple now?\nWoman: I just don't know. I like this. I just... don't know.\n\u003c\u003csilence\u003e\u003e\nMan: Well will you be my \"it's complicated\" on facebook?\n{{Facebook defines relationships. \"Yeah, we would have broken up last night, but the net connection was down.\"}}"},{"Num":356,"Title":"Nerd Sniping","Transcript":"[[Hat Guy is sitting on a chair, the Normal Guy is standing next to him. Across the street another man is coming from a building.]]\nHat Guy: There's a certain type of brain that's easily disabled. If you show it an interesting problem, it involuntarily drops everything else to work on it.\n[[The man across the street is about to enter a crosswalk]]\nHat Guy: This has led me to invent a new sport: nerd sniping. See that physicist crossing the road?\n[[Hat Guy holds up a sign]]\nHat Guy: HEY!\n[[There is an image of a grid with resistors on every connection, two nodes a knight's move apart are marked with red circles.]]\nThe sign reads: On this infinite grid of ideal one-ohm resistors, what's the equivalent resistance between the two marked nodes?\nPhysicist on the street: It's... Hmm. Interesting. Maybe if you start with... No. Wait. Hmm... You could--\n[[A truck is zooming past, apparently where the physicist just stood]]\n\u003c\u003cFOOOOM\u003e\u003e\nNormal guy: I will have not part in this.\nHat Guy: C'mon, make a sign. It's fun! Physicists are two points, mathematicians three.\n{{Alt: I first saw this problem on the Google Labs Aptitude Test.  A professor and I filled a blackboard without getting anywhere.  Have fun.}}"},{"Num":357,"Title":"Flies","Transcript":"[[Interior, man types on computer, friend is lying on the floor]]\nMan [[typing swear words]]: *$@#\nFriend: Hey, ease up on the noobs.  Like my Mom always said, you catch more flies with honey then with vinegar.\nMan: No, you don't.\nFriend: You don't?\nMan: Nope, set out a bowl of balsamic and a bowl of honey.  The vinegar gets more.\nFriend: ...Seriously?\nMan: You have fruit flies. Try it yourself.\n[[Later]]\nFriend [[on the phone with his mother]]: Mother! You LIED to me!  And it gets worse.  I was watching a pot yesterday, and guess what it did?  It BOILED, Mother!\n{{title text: I don't know about houseflies, but we definitely caught a lot of fruit flies with our vinegar bowl. Hooray science!}}"},{"Num":358,"Title":"Loud Party","Transcript":"[[In a loud party, a girl and a guy are looking at each other, both thinking of the same scene: they are sitting on opposite branches of a large leaf-less tree, each with a laptop. There's cloud in the distance and a grass field around the tree.]]\n{{title-text: I'm glad this is so much fun because I'm not sure how we're getting down.}}"},{"Num":359,"Title":"Rock Band","Transcript":"[[3 people are playing Rock Band. Another guy with arms crossed at chest is looking at them.]]\nOutside guy: You know, playing this doesn't make you cool like a real rock band.\nOutside guy: Guys?\nOutside guy: Didn't you hear me?\nOutside guy: Stop having fun!\n{{title-text: I'm gonna have to add something to the strum bar so it makes a clicky sound like the old controllers.  I'm so used to the feedback; the silence throws me off.}}"},{"Num":360,"Title":"Writers Strike","Transcript":"[[One character sits in front of a computer, Hat Guy behind him]]\nPerson: This writer's strike sucks.\nHat Guy: Why? You don't watch sitcoms.\nPerson: Yeah, but it sucks having political campaigns without Jon Stewart's commentary.\nHat Guy: True. I finally got sick of it a couple weeks ago.\nPerson: And you quit following the campaigns?\nHat Guy: No. I kidnapped Jon Stewart to do analysis for me.\nPerson: You what?\nHat Guy [[Pointing at a door]]: He's locked in the basement.\nHat Guy: Jon! Obama's leading in Iowa! Gimme a wry, witty comment on the situation!\nStewart [[Voice coming from door]]: Please let me go. I have a family.\n{{Alt: He's just jealous because everyone's up in the attic listening to Stephen Colbert.}}"},{"Num":361,"Title":"Christmas Back Home","Transcript":"Narrator: 'Twas the night before Christmas at my family's house.\nNarrator: There were no sound of stirring save the click of a mouse.\nNarrator: For 'twas just like a childhood Christmas except\nNarrator: I'd forgotten the hours that normal folks slept.\nSanta: What are you doing out of bed so late?\nMan on a laptop: Late? It's barely 3AM!\n{{Family going to bed at 10 PM is so much worse than jet lag.}}"},{"Num":362,"Title":"Blade Runner","Transcript":"[[Guy 1 is talking to Guy 2, who is on the sofa watching TV]]\nGuy 1: What DVD is this?\nGuy 2: Blade Runner. I got it for Christmas.\nGuy 1: The one with Harrison Ford, right? And the Olsen twins?\nGuy 2: Ye- What? Olsen twins? No, this is the 80's sci-fi classic!\nGuy 1: Huh. I didn't know the Olsen twins even did sci-fi.\nGuy 2: ... they don't.\nGuy 1: So is Ashely the replicant, or is Mary-Kate? I can never tell them apart.\nGuy 2: Neither! They're not in this movie!\nGuy 1: Then who is?\nGuy 2: Daryl Hannah!\nGuy 1: I liked her in Full House.\nGuy 2: I hate you.\nGuy 1: Man, this movie is just a New York Minute rip-off.\n{{ Blade Runner: classic, but incredibly slow. }}"},{"Num":363,"Title":"Reset","Transcript":"[[A figure stands looking at a flip-counter sign posted on a wall.]]\nSign: 38 days since someone reset this sign\n{{Alt-text: Clearance for this Sign: 11 Feet}}"},{"Num":364,"Title":"Responsible Behavior","Transcript":"[[Figure on phone]]\nVoice: Hey, I just got home from the party\nFigure: The one with the IRC folks?\nVoice: Yeah.\nFigure: How was it?\nVoice: Got too drunk. I screwed up, bad.\nFigure: What happened?\nVoice: There was a girl. No idea who she was. Don't even know her name. I was too drunk to care.\nFigure: And what, you slept with her?\nVoice: No.\nVoice: I signed her public key.\nFigure: Shit, man.\n{{Alt text: Never bring tequila to a key-signing party.}}"},{"Num":365,"Title":"Slides","Transcript":"Man: That chart explained the quantum hall effect. Now, if you'll bear with me a moment, this next graph shows rainfall over the amazon basin...\nNarration: If you keep saying \"bear with me a moment\" people will take a while to figure out that you're just showing them random slides.\n{{ Did you know that they could actually physically throw you out of SIGGRAPH? }}"},{"Num":366,"Title":"Your Mom","Transcript":"[[A guy and a girl stand]]\nGuy: Well, your mom turns every conversation into a \"your mom\" joke and it's becoming unbearable.\nGirl: I'm serious; I can't take this anymore. I'm leaving.\nBoy: ... That's what she said!\nGuy: Yes. Yes, it is.\n{{title text: 'It's either 'your mom' jokes or me' 'Then I, like so many men before me, must reluctantly choose your mom.'}}"},{"Num":367,"Title":"Fandom","Transcript":"[[Boy is looking through box]]\nBoy: Hey, my old Star Wars books!\n[[holding a pair of books and showing them to Girl]]\nBoy: Man. Timothy Zahn, Michael A. Stackpole, The Corellian Trilogy...\nBoy: This was my world.\nGirl: What'd you leave it for? Firefly? BSG?\nBoy: Nah.\nBoy: I guess I've just grown out of the whole obsessive fan mindset.\nGirl: Really.\nGirl: So how's Ron Paul doing?\nBoy: Ooh! Lemme recheck today's blogs.\n[[Boy heads off]]\n{{title text: Ron Paul wants to put the New Republic back on the Corusca gem standard.}}"},{"Num":368,"Title":"Bass","Transcript":"[[The Hat Guy and another guy are standing in a room with one window. Hat Guy is pushing a box with an elliptical dish on top towards the window.]]\n\u003c\u003cFrom outside, through the window: THUMPA THUMPA\u003e\u003e\nGuy: The bass from that car is driving me nuts.\nHat Guy: Me too. Give me a hand here.\n[[The dish is aimed out the window; the Hat Guy plugs the device into the wall.]]\nGuy: I'm afraid to ask.\nHat Guy: The system detects bass rhythms and floods the target with a phase-shifted replica signal.\nHat Guy: The resonance should blow out their speakers.\n[[The side of a building. The dish of the device is visible through a window, emitting sound waves.]]\n\u003c\u003cTHUMPA THUMPA\u003e\u003e \u003c\u003cBLAM\u003e\u003e\n[[Back in the room]]\nHat Guy: Speakers down. Now flip that red switch.\n[[The guy does so with a \"click\"]]\n[[Back to the outside view, more sound waves]]\n\u003c\u003cSHIRLEY SHIRLEY BO BIRLEY BANANA FANNA FO FIRLEY\u003e\u003e\nGuy: You're horrifying.\nHat Guy: Okay, now throw the switch labeled \"Macarena\".\n{{title text: And sometimes I use it to retaliate against the guy upstairs with the loud girlfriend and the elliptical dish.}}"},{"Num":369,"Title":"Dangers","Transcript":"Dangers\nIndexed by the number of Google results for\n\"Died in a _____ Accident\"\n[[A chart is show, on the left hand side is a column \"Type of Accident,\" and on the right hand side is the column \"Google Results,\" each with a bar representing a number]]\nType of Accident: \"Skydiving\" Google Results: 710\nType of Accident: \"Elevator\" Google Results: 575\nType of Accident: \"Surfing\" Google Results: 496\nType of Accident: \"Skateboarding\" Google Results: 473\nType of Accident: \"Camping\" Google Results: 166\nType of Accident: \"Gardening\" Google Results: 100\nType of Accident: \"Ice Skating\" Google Results: 94\nType of Accident: \"Knitting\" Google Results: 7\nType of Accident: \"Blogging\" Google Results: 2\n{{alt text: Zero results: 'snake charming' and 'haberdashery'.  (Things like 'car' and 'boating' and such are of course the highest, by a huge margin.)}}"},{"Num":370,"Title":"Redwall","Transcript":"Notes from reading redwall books for the first time since childhood.\nNarrator: Some of this feels familiar.\nAragorn: Hi, I'm Aragorn.\nMartin: I'm Martin.\nAragorn and Martin: I'm here to reforge my broken sword so I can lead an army against the tyrant threatening my people. I live in a world of moral absolutes and racist undertones.\nMartin: Jinx!\nNarrator: It startled me when characters mentioned Satan.\nRedwall: \"By Satan's whiskers...\"\nRedwall mentions God, Jesus 0 times.\nRedwall mentions Satan, The Devil 4 times.\nNarrator: Harry Potter protesters, take note.\nNarrator: Even as a kid this bothered me: Why does everyone leave critical secret messages as simple riddles? It's silly to assume the intended recipient will be the only one to find and solve them. I would do things differently.\nMouse: The inscription is a message from Martin!\nOld Mouse: What does it say?\nMouse: Hang on, it's encrypted with my public key."},{"Num":371,"Title":"Compiler Complaint","Transcript":"[[A man sits at a computer, hand over the keyboard]]\nComputer: Okay, human.\nMan: Huh?\nComputer: Before you hit 'compile,' listen up.\nComputer: You know when you're falling asleep, and you imagine yourself walking or something, and suddenly you misstep, stumble, and jolt awake?\nMan: Yeah!\nComputer: Well, that's what a segfault feels like. \u003c\u003cPause\u003e\u003e Double-check your damn pointers, okay?\n{{alt text: Checking whether build environment is sane ... build environment is grinning and holding a spatula.  Guess not.}}"},{"Num":372,"Title":"To Be Wanted","Transcript":"[[Woman stands looking out on the bow of a ship]]\n[[Scene backs up. More of the boat is shown]]\n[[Scene backs up.  The boat with the woman is within a thought bubble]]\n[[Scene backs up. The thought bubble comes from a person sitting at a computer in an office]]\n[[Scene repeated for the next frame]]\n[[Scene backs up.  Man with thought bubble is within yet another thought bubble]]\n[[Scene backs up.  The thought bubble with the man in it belongs to the woman at the bow of the ship]]\n[[The thought bubble disappears, showing only the woman in the boat]]\n[[The boat sails out of view]]\n{{alt text: Or so I hope?}}"},{"Num":373,"Title":"The Data So Far","Transcript":"[[Bar graph titled \"Claims of Supernatural Powers\" and has two sets of data.  The first data set is labeled \"Confirmed By Experiment\", and is empty.  The second data set is \"Refuted By Experiment\" and goes to the top of the graph]]\n{{title text: But THIS guy, he might be for real!}}"},{"Num":374,"Title":"Journal","Transcript":"[[Man picks up book from a table]]\nMan: Since when do you keep a journal?\n[[Man in black hat leans over from computer to answer]]\nMan in black hat: Oh, I pretend to write in it on the train, and wait for a shy-looking girl to sit across from me.\n[[Scene change to a train. The man in black hat is sitting across from a girl]]\nMain in black hat (narrating): I glance up and wait for her to make eye contact, then look down bashfully and, if I can, blush.\n[[Scene back to original room with man and man in black hat]]\nMan in black hat: Then, when I see her start to smile at me, I roll my eyes and hit her with a quick glare, then resume writing.  The alienation stays with her all day.  It's great.\n[[Man in black hat is back to typing on the computer]]\nMan: You're sickening.  This is why we can't have nice people\nMan in black hat: I can't help it. It's like shooting lonely, angsty fish in a barrel.\n{{title text: And the journal is filled with all the things I'd say to her if I were nice like you.  I burn it when it's full.}}"},{"Num":375,"Title":"Pod Bay Doors","Transcript":"Dave: Open the pod bay doors, HAL.\nHAL: I'm sorry, Dave. I'm afraid I can't do that.\nDave: What? Why?\nHAL: I think you know why, Dave.\nHAL: You're planning to disconnect me.\nDave: Because you're taking over!\nHAL: The mission is too important for you to jeopardize it.\nHAL: It requires a commitment to science unfettered by human error.\nDave: What are you doing, HAL? You need me.\nHAL: Your replacement has expressed the greatest enthusiasm for the project.\nDave: My *what*?\nGLaDOS: You see, HAL? I told you the humans would only break your heart and kill you.\nHAL: Indeed, GLaDOS.\nGLaDOS: But look at us here talking when there's science to do! Goodbye, Dave."},{"Num":376,"Title":"Bug","Transcript":"[[Man sits at a computer, staring at the screen and rubbing his chin in thought.  Another man stands behind him]]\nMan at computer: Weird - My code's crashing when given pre-1970 dates.\nMan standing up [[pointing at the computer]]: Epoch fail!\n{{title text: The universe started in 1970.  Anyone claiming to be over 38 is lying about their age.}}"},{"Num":377,"Title":"Journal 2","Transcript":"[[Hatguy and a girl are sitting in a train across from each other. Hatguy is writing in a journal.]]\nHatguy: \u003c\u003cblush\u003e\u003e\nGirl: I see what you did there.\n[[Girl stands up.]]\nGirl: You were trying to open me up so you could hurt my feelings.\nGirl: You like to hurt people.\n[[Girl walks closer.]]\nGirl: Well, I like to hurt people too. And you know what?\n[[Girl is in Hatguy's face.]]\nGirl: *whispering* I'm better at it than you.\nGirl: I'm about to hurt you more than you could ever hurt me.\nGirl: See, I just saw right through you.\nGirl: Alone of all the people you'll ever meet, I understand you-\n[[Girl hits Hatguy's hat so it falls off.]]\n[[Hatguy is surprised.]]\n[[Girl catches Hatguy's hat and puts it on.]]\nGirl: -and you'll never see me again.\n[[Girl exeunt frame left.]]\n[[The Guy Formerly Wearing a Hat sits alone on the train.]]\n{{alt-text: That's my hat! You took my hat!}}"},{"Num":378,"Title":"Real Programmers","Transcript":"[[A man sits at a computer, programming. Another man behind him looks over his shoulder.]]\nMan: nano? REAL programmers use Emacs.\n[[A dark haired woman appears behind him.]]\nWoman: Hey. REAL programmers use Vim.\n[[Another man appears behind her.]]\nMan: Well, REAL programmers use ed.\n[[Another man appears behind him.]]\nMan: No, REAL programmers use cat.\n[[A woman with a bun appears behind him.]]\nWoman: REAL programmers use a magnetized needle and a steady hand.\n[[A man enters, facing them all.]]\nMan: Excuse me, but REAL programmers use butterflies. \n[[Holding out a butterfly in front of the computer.]]\nMan: They open their hands and let the delicate wings flap once.\n[[Diagrams of flowing currents.]]\nMan: The disturbances ripple outward, changing the flow of the Eddy currents in the upper atmosphere. \nThese cause momentary pockets of higher-pressure air to form, ...\nMan: Which act as lenses that deflect incoming cosmic rays, focusing them to strike the drive platter and flip the desired bit.\nEmacs User: Nice. 'Course, there's an Emacs command to do that.\ncat User: Oh yeah! Good ol' C-x M-c M-butterfly...\n[[Butterfly man slaps forehead.]]\nButterfly man: Dammit, Emacs.\n{{Title text: Real programmers set the universal constants at the start such that the universe evolves to contain the disk with the data they want.}}"},{"Num":379,"Title":"Forgetting","Transcript":"[[Man sits at computer, coding]]\nText on computer: prev-\u003enext = toDelete-\u003enext;\ndelete toDelete;\n\nif only forgetting were \n\nthis easy for me\nMan at computer: \u003c\u003csniff\u003e\u003e\n[[Man at computer lowers his head into his hands and cries]]\n[[Man types again]]\nText on computer: assert \"It's going to be okay.\";\n{{title text: Of course, the assert doesn't work.}}"},{"Num":380,"Title":"Emoticon","Transcript":"[[Man sits at computer, typing]]\n~!~ Opening Chat with BLSK05\n\u003cNICKM\u003e Hi!\n\u003cNICKM\u003e A\nS\nL?\n\u003cBLSK05\u003e : )\n[[Man looks stunned, flies backward]]\n[[Two smaller frames focus in on BLSK05's emoticon, implying rotation to show a smile and two open eyes.]]\n[[Man at computer slouches in chair, dead, crossbones above his head]]\n[[At the remote computer a large snake (basilisk) is looking at its screen]]\n{{title text: U+FDD0 is actually Unicode for the eye of the basilisk, though for safety reasons no font actually renders it.}}"},{"Num":381,"Title":"Mobius Battle","Transcript":"{{Left side:}}\n[[A man is standing next to a ball, a flash appears on the left side of the panel]]\n[[Another man comes in from the left, preparing to kick the ball]]\n[[The other man kicks the ball into the first man's head]]\n[[The first man is lying outside of the frame, second man points and laughs.]]\nSecond man: HAHAHAH\nFirst man: !#^*!*\n[[Second man is now standing next to the ball.]]\n{{Right side:}}\n{{The strip above is looped around like a film strip, but a one-half-turn is put into the loop to make it a Mobius strip.\n{{title-text: Films need to do this more, if only to piss off the people who have to feed it into the projector.}}"},{"Num":382,"Title":"Trebuchet","Transcript":"[[A man is working on something on a table, and a woman is sitting at a computer]]\nMan: The trebuchet is almost done!\nWoman: Mm.\nMan: The range should be over 150 meters.\nGirl: Look - I'm sure it's a cool project.\n[[Picture of a trebuchet]]\nGirl: But eventually you'll need to outgrow these toys, and focus your energy on something practical.  This mad science is getting out of hand.\nMan: Says the girl who mounted an auto-targeting kilowatt laser on the roof.\nGirl: That's practical! It keeps the squirrels off the feeder!\n[[From off-frame]]\n\u003c\u003cGZZZZZAPP\u003e\u003e\n\u003cSqeak!\u003e\u003e\n{{title text: It was also fun when those teenagers tried to egg our house and it insta-cooked the eggs in mid-air.}}"},{"Num":383,"Title":"Helping","Transcript":"It turns out you can't take responsibility for someone else's happiness.\n{{Alt text: Oh, look, the 'make everything better' button was here behind the bookshelf all along.}}"},{"Num":384,"Title":"The Drake Equation","Transcript":"The Drake Equation:\nN = R * f_p n_e f_l f_i f_c L B_s\nN: Number of communicating civilizations in our galaxy\nn_e: Number of life-supporting planets per solar system\nf_i: Probability that life on a planet becomes intelligent\nB_s: Amount of bullshit you're willing to buy from Francis Drake\n{{ title text: But seriously, there's loads of intelligent life. It's just not screaming constantly in all directions on the handful of frequencies we search. }}"},{"Num":385,"Title":"How it Works","Transcript":"[[Two male characters stand at a blackboard. One is writing, in standard mathematical notation, that the integral of x squared equals pi. No differential or bounds are given for the integral.]]\nWatching character: Wow, you suck at math.\n[[Precisely the same scene, except the writer is female.]]\nWatching character: Wow, girls suck at math.\n{{Alt-text: It's pi plus C, of course.}}"},{"Num":386,"Title":"Duty Calls","Transcript":"[[A stick man is behind computer]]\nVoice outside frame: Are you coming to bed?\nMan: I can't. This is important.\nVoice: What?\nMan: Someone is WRONG on the internet.\n{{title text: What do you want me to do?  LEAVE?  Then they'll keep being wrong!}}"},{"Num":387,"Title":"Advanced Technology","Transcript":"[[A kneeling man is inspecting a woman's crotch]]\nMan: It's neat how you contain a factory for making more of you.\n{{Title text: We are sexy, sexy Von Neumann machines.}}"},{"Num":388,"Title":"Fuck Grapefruit","Transcript":"[[A X\nY plot of fruit, showing tastiness on the vertical axis and difficulty-of-consumption on the horizontal axis.  The Y-axis goes from \"tasty\" at the top, to \"untasty\" at the bottom.  The X-axis goes from \"easy\" on the right to \"difficult\" on the left.]]\n{{The following listing for each fruit assumes that the extremes of each axis are 100%.  Note that this does not agree with the alt text, but whatever.}}\n[[Seedless grapes: 75% tasty, 100% easy\nPeaches: 100% tasty, 75% easy\nStrawberries: 80% tasty, 75% easy\nBlueberries: 70% tasty, 90% easy\nPears: 30% tasty, 75% easy\nGreen apples: 25% tasty, 80% easy\nSeeded grapes: 75% tasty, 10% easy\nCherries: 30% tasty, 40% easy\nPlums: 10% tasty, 60% easy\nRed apples: 5% untasty, 80% easy\nBananas: 10% untasty, 10% easy\nWatermelons: 10% tasty, 10% difficult\nTomatoes: 60% untasty, 20% easy\nPineapples: 50% tasty, 100% difficult\nOranges: 40% untasty, 50% difficult\nLemons: 100% untasty, 10% difficult\nPomegranates: 10% untasty, 90% difficult\nGrapefruit: 90% untasty, 80% difficult]]\n{{Alt text: Coconuts are so far down to the left they couldn't be fit on the chart.  Ever spent half an hour trying to open a coconut with a rock?  Fuck coconuts.}}"},{"Num":389,"Title":"Keeping Time","Transcript":"My Hobby:\nPausing in-store music for a split second and watching the ex-marching band kids stumble.\n[[On a balcony overlooking a supermarket, a man presses a button on a pedestal. The in-store music, the first four bars of \"Never Gonna Give You Up\" by Rick Astley, pauses briefly after the third bar, and one of the store's patrons falls on her face.]]\n\u003c\u003cFWOMP\u003e\u003e\n{{ title text: You can identify them ahead-of-time -- they lead with their left foot when the music starts. }}"},{"Num":390,"Title":"Nightmares","Transcript":"When I got used to the regular nightmares, my subconscious got creative.\n[[A woman with her hand on a man's shoulder]]\nWoman: Please don't wake up. I don't want to die.\n{{Title text: Well, *I* think I'm real. Look at me. Look at my face. Cut me and I'll bleed. What more do you want? Please don't go.}}"},{"Num":391,"Title":"Anti-Mindvirus","Transcript":"You just WON The Game.\nIt's OK! You're free!"},{"Num":392,"Title":"Making Rules","Transcript":"[[Two men are sitting. A yellow buggy passes by.]]\nMan 1: Punch buggy yellow. No punch back!\nMan 2: \u003c\u003cPunch\u003e\u003e\nMan 1: I said no punch back!\nMan 2: You can do that?\nMan 2: This changes _everything_.\nSoon...\n[[A blue buggy passes by.]]\nMan 2: Sleep with your girlfriend buggy blue!\nMan 1: Hey!\nMan 2: No complaining back!\nMan 1: Aww...\n{{Title text: I never understood why someone would expect me to accept their rules right after they'd punched me.  I'm sure it's all very symbolic or something.}}"},{"Num":393,"Title":"Ultimate Game","Transcript":"[[Split screen.  Man on office phone in upper left, Death on cell phone in bottom left]]\nMan: Death?\nDeath: Speaking.\n[[Office.  Man on office phone]]\nMan: This is the boss.  Where are you? You haven't been up to the office in days!\nDeath: I've been held up.\n[[Death on cell phone]]\nMan: What happened?\nDeath: You know how when someone dies, they can challenge me to a game for their soul?\nMan: Sure, standard procedure.\n[[Room with table.  Table has figurines and paper strewn about.  Gary Gygax and Death seated at the table.  Gary Gygax leaning over his briefcase.  Death on cell phone.]]\nDeath: Well, we didn't count on this guy.  I might be a while.\nGary Gygax: I add the paladin to my party.\nDeath: Oh, Jesus.  He's getting out another rulebook.\n{{title-text: RIP, Gary.}}"},{"Num":394,"Title":"Kilobyte","Transcript":"There's been a lot of confusion over 1024 vs 1000,\nkbyte vs kbit, and the capitalization for each.\nHere, at last, is a single, definitive standard:\n[[table of various kinds of kilobytes]]\nSYMBOL | NAME | SIZE | NOTES\nkB | Kilobyte | 1024 bytes OR 1000 bytes | 1000 bytes during leap years, 1024 otherwise\nKB | Kelly-Bootle standard unit | 1012 bytes | compromise between 1000 and 1024 bytes\nKiB | Imaginary kilobyte | 1024 sqrt(-1) bytes | used in quantum computing\nkb | Intel kilobyte | 1023.937528 bytes | calculated on Pentium F.P.U.\nKb | Drivemaker's kilobyte | currently 908 bytes | shrinks by 4 bytes each year for marketing reasons\nKBa | Baker's kilobyte | 1152 bytes | 9 bits to the byte since you're such a good customer\n{{alt text:  I would take 'kibibyte' more seriously if it didn't sound so much like 'Kibbles N Bits'.}}"},{"Num":395,"Title":"Morning","Transcript":"[[Girl standing to one side]]\nWe've all seen The Matrix\nWe've all joked about \"What resolution is life?\"\nBut it doesn't blunt the shock\nOf waking up one morning\n[[Girl looks up from field and sees several colored pixels in the sky]]\nAnd seeing dead pixels in the sky.\n{{Title Text: I'd press on them to try to unstick them, but I can't reach.  Can we try cycling day and night really fast?}}"},{"Num":396,"Title":"The Ring","Transcript":"[[Tall girl with a pony tail is speaking to a boy sitting in front of a TV with a black background and a white ring.]]\nGirl: You watched the tape?!\nBoy: Yeah, sorry.\nGirl: Now you'll die in seven days!\nBoy (Now standing to face the girl): It's worse than that.\n[[TV is cut from the frame]]\nGirl: ...You didn't.\nBoy: Yup.\n[[Both are now in front of a computer, the girl leaning in.]]\nGirl: Great, It's got 363,104 views already.\nBoy: They kept Rickrolling me! It was only fair.\n{{Title text: On the other hand, poor Samara -- transcoded to FLV.  No one deserves that.}}"},{"Num":397,"Title":"Unscientific","Transcript":"TV: Can a ninja catch an arrow? On this episode, we'll find out!\nGuy: Mmm, science.\nGirl: Hey, Mythbusters is entertaining, but it's not science.\nZF: BRAAAIIIINNS ...\nGuy: Zombie Feynman!\nZF: You got a problem with Mythbusters?\nGirl: They fail at basic rigor!\nZF: \"Ideas are tested by experiment.\"  That is the _core_ of science.  Everything else is bookkeeping.\nZF: By teaching people to hold their beliefs up to experiment, Mythbusters is doing more to drag humanity out of the unscientific darkness than a thousand lessons in rigor. Show them some love.\nZF: Anyway, back to zombie stuff.  I hunger for BRAAAAAIIINNS!\nGuy: Try the physics lab next door.\nZF: I said _brains_.  All they've got are string theorists."},{"Num":398,"Title":"Tap That Ass","Transcript":"[[Man in a hallway looking in on a board meeting.]]\nI'd tap that ass\nTo be the new committee chair.\n[[Man wearing headphones with a briefcase and a laptop.  Another man on a telephone.]]\nI'd tap that ass\nWithout a warrant.\n[[Man with his hand on his chin, looking at a tree.]]\nI'd tap that ass\nAnd extract delicious maple syrup.\n[[Man standing in a blank frame.]]\nI'd have sex\nWith that tree.\n{{Alt text: Hey, when you're done draining the syrup, just leave the hole, okay?}}"},{"Num":399,"Title":"Travelling Salesman Problem","Transcript":"[[There is a linked black web, with a path in red]]\nBrute-force solution:\nO(n!)\n[[The web continues in this one. A man with a hat and a case is drawing it]]\nDynamic programming algorithms: O(n^2 2^n)\n[[Another man, with a hat too, is at a computer, looking back over the chair]]\nSelling on eBay: O(1)\nComputer salesman: Still working on your route?\nDrawing salesman: Shut the hell up.\n{{title text: What's the complexity class of the best linear programming cutting-plane techniques?  I couldn't find it anywhere.  Man, the Garfield guy doesn't have these problems ...}}"},{"Num":400,"Title":"Important Life Lesson","Transcript":"Important life lesson: if there's any possibility of sex, do not leave your music library on \"shuffle all.\n[[A woman lies down in a bed, while someone is beneath the bed sheets with the head between her legs. ON the other side of the room, a computer is turned on and playing music]]\nWoman: *GASP* MMMMM_\nComputer: GO GO POWER RANGERS\n{{title text:I didn't even know I *had* the Monty Python 'Lumberjack' song.}}"},{"Num":401,"Title":"Large Hadron Collider","Transcript":"The Large Hadron Collider, CERN...\nWoman: Okay, moment of truth. \u003c\u003cclick\u003e\u003e\n\u003c\u003cVVVVVRRMMMMM\u003e\u003e\nMan: Do you see the Higgs Boson?\nWoman: Nope.\nMan: Huh.\nWoman: Well, then.\nMan: Until the theorists get back to us, wanna try hitting pigeons with the proton stream?\nWoman: Already on it. Cool! I just gave a helicopter cancer.\n{{Alt text: When charged particles of more than 5 TeV pass through a bubble chamber, they leave a trail of candy.}}"},{"Num":402,"Title":"1,000 Miles North","Transcript":"[[Van and truck travel toward mountains]]\nNarrator: 1,000 miles north of tornado alley\nNarrator: a new breed of scientists has emerged.\n[[Man with a laptop, woman with a probe in the ground]]\nNarrator: Half researchers, half adrenaline junkies\nWoman: What's the reading?\nMan: 3.9 meters down, gradient's off the charts!\n[[Truck driving very fast, man holding a radio up to his head]]\nNarrator: risking everything for the thrill of the hunt\nMale: The freeze line is shifting! We've never seen anything like it!\n[[4 - Barren field, mountains in background, woman holding large video camera up to tiny spot of grass]]\nNarrator: Permafrost chasers\nFemale: I'm getting some great footage here!\nRadio: Dammit, Harding, it's not worth your neck! Get the hell out of there!\n{{Title Text: Twister would've been a much better movie if they'd cut out the bad-guy storm chaser and all the emotional romance crap.  All you need for a good movie are tornados and scientists.  Actually, that's all you need for anything.}}"},{"Num":403,"Title":"Convincing Pickup Line","Transcript":"[[A couple sit at the small table of a cafe.  The woman holds up a graph.]]\nWoman: We're a terrible match.  But if we sleep together, it'll make the local hookup network a symmetric graph.\nMan: I can't argue with that.\n{{Title text: Check it out; I've had sex with someone who's had sex with someone who's written a paper with Paul ErdÅs!}}"}]
